{"text": "On one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika 's monastery. Then two brahmans — feeble old men, aged, advanced in years, having come to the last stage of life, 120 years old — went to the Blessed One. On arrival, they exchanged courteous greetings with him and, after an exchange of friendly greetings & courtesies, sat to one side. As they were sitting there, they said to him: \"Master Gotama, we are brahmans — feeble old men, aged, advanced in years, having come to the last stage of life, 120 years old. And we have done no admirable deeds, no skillful deeds, no deeds that allay our fears. Teach us, Master Gotama. Instruct us, Master Gotama, for our long-term benefit & happiness.\"", "entities": [[20, 31, "PERSON"], [49, 57, "GPE"], [61, 73, "LOC"], [75, 88, "PERSON"], [231, 242, "PERSON"], [430, 436, "PERSON"], [655, 661, "PERSON"], [683, 689, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an03.051.than.html", "title": "Dvejana Sutta", "para_seq": null}}
{"text": "On one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika 's monastery. Then two brahmans — feeble old men, aged, advanced in years, having come to the last stage of life, 120 years old — went to the Blessed One. On arrival, they exchanged courteous greetings with him and, after an exchange of friendly greetings & courtesies, sat to one side. As they were sitting there, they said to him: \"Master Gotama, we are brahmans — feeble old men, aged, advanced in years, having come to the last stage of life, 120 years old. And we have done no admirable deeds, no skillful deeds, no deeds that allay our fears. Teach us, Master Gotama. Instruct us, Master Gotama, for our long-term benefit & happiness.\"", "entities": [[20, 31, "PERSON"], [49, 57, "GPE"], [61, 73, "LOC"], [75, 88, "PERSON"], [231, 242, "PERSON"], [430, 436, "PERSON"], [655, 661, "PERSON"], [683, 689, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an03.052.than.html", "title": "Dvejana Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One, on a wandering tour among the Kosalans with a large community of monks, arrived at Kesaputta , a town of the Kalamas . The Kalamas of Kesaputta heard it said, \"Gotama the contemplative — the son of the Sakyans, having gone forth from the Sakyan clan — has arrived at Kesaputta. And of that Master Gotama this fine reputation has spread: 'He is indeed a Blessed One, worthy, & rightly self-awakened, consummate in knowledge & conduct, well-gone, a knower of the cosmos, an unexcelled trainer of those persons ready to be tamed, teacher of human & divine beings, awakened, blessed. He has made known — having realized it through direct knowledge — this world with its devas, maras, & brahmas, its generations with their contemplatives & brahmans, their rulers & common people; has explained the Dhamma admirable in the beginning, admirable in the middle, admirable in the end; has expounded the holy life both in its particulars & in its essence, entirely perfect, surpassingly pure. It is good to see such a worthy one.'\"", "entities": [[38, 49, "PERSON"], [134, 143, "GPE"], [185, 194, "GPE"], [211, 217, "PERSON"], [318, 327, "GPE"], [348, 354, "PERSON"], [404, 415, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an03.065.than.html", "title": "Kalama Sutta", "para_seq": null}}
{"text": "So the Kalamas of Kesaputta went to the Blessed One. On arrival, some of them bowed down to him and sat to one side. Some of them exchanged courteous greetings with him and, after an exchange of friendly greetings & courtesies, sat to one side. Some of them sat to one side having saluted him with their hands palm-to-palm over their hearts. Some of them sat to one side having announced their name & clan. Some of them sat to one side in silence.", "entities": [[18, 27, "GPE"], [40, 51, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an03.065.than.html", "title": "Kalama Sutta", "para_seq": null}}
{"text": "As they sat there, the Kalamas of Kesaputta said to the Blessed One, \"Lord, there are some brahmans & contemplatives who come to Kesaputta. They expound & glorify their own doctrines, but as for the doctrines of others, they deprecate them, revile them, show contempt for them, & disparage them. And then other brahmans & contemplatives come to Kesaputta. They expound & glorify their own doctrines, but as for the doctrines of others, they deprecate them, revile them, show contempt for them, & disparage them. They leave us absolutely uncertain & in doubt: Which of these venerable brahmans & contemplatives are speaking the truth, and which ones are lying?\"", "entities": [[34, 43, "GPE"], [56, 67, "PERSON"], [129, 138, "GPE"], [345, 354, "GPE"]], "meta": {"nikaya": "AN", "identifier": "an03.065.than.html", "title": "Kalama Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying in Savatthi at the Eastern Monastery, the palace of Migara's mother . Now at that time — it being the Uposatha day — Visakha , Migara's mother, went to the Blessed One in the middle of the day and, on arrival, having bowed down to him, sat to one side. As she was sitting there the Blessed One said to her, \"Well now, Visakha, why are you coming in the middle of the day?\"", "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [179, 186, "PERSON"], [218, 229, "PERSON"], [344, 355, "PERSON"], [380, 387, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an03.070.than.html", "title": "Muluposatha Sutta", "para_seq": null}}
{"text": "On one occasion the Blessed One was staying near Savatthi at Jeta's Grove, Anathapindika's monastery . Then Channa the Wanderer [1] went to Ven. Ananda and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to Ven. Ananda, \"Do you, too, friend Ananda, advocate the abandoning of passion? Do you advocate the abandoning of aversion? Do you advocate the abandoning of delusion?\"", "entities": [[20, 31, "PERSON"], [49, 57, "GPE"], [61, 73, "LOC"], [75, 88, "PERSON"], [145, 151, "PERSON"], [324, 330, "PERSON"], [353, 359, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an03.071.than.html", "title": "Channa Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion Ven. Ananda was staying in Kosambi at Ghosita 's monastery. Then a certain householder, a disciple of the Fatalists (Ajivakas), went to him and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to Ven. Ananda, \"Among us, sir, whose Dhamma is well-taught? Who has practiced well in this world? Who in the world is well-gone?\"", "entities": [[39, 45, "PERSON"], [61, 68, "GPE"], [151, 159, "NORP"], [274, 280, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an03.072.than.html", "title": "Ajivaka Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying among the Sakyans at Kapilavatthu in the Banyan Park . Now at that time the Blessed One had just recovered from being ill, was not long recovered from his illness. Then Mahanama the Sakyan went to the Blessed One and, on arrival, having bowed down, sat to one side. As he was sitting there he said to the Blessed One: \"For a long time I have known the Dhamma taught by the Blessed One that 'There is knowledge for one who is concentrated, not for one who is not concentrated.' Now, does concentration come first, and knowledge after, or does knowledge come first, and concentration after?\"", "entities": [[38, 49, "PERSON"], [83, 95, "GPE"], [138, 149, "PERSON"], [263, 274, "PERSON"], [367, 378, "PERSON"], [435, 446, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an03.073.than.html", "title": "Sakka Sutta", "para_seq": null}}
{"text": "On one occasion the Blessed One was living in Vesālī , in the Great Wood. Then a certain Vajjian monk approached him and, on arrival, having bowed down to him, sat to one side. As he was sitting there, he said to the Blessed One, \"Lord, this recitation of more than 150 training rules comes every fortnight. [1] I cannot train in reference to them.\"", "entities": [[20, 31, "PERSON"], [46, 52, "GPE"], [217, 228, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an03.083.than.html", "title": "Vajjiputta Sutta", "para_seq": null}}
{"text": "On one occasion the Blessed One was staying near Rajagaha at the Bamboo Grove in the Squirrels' Sanctuary. Then Vassakara the brahman, the chief minister of Magadha, went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to the Blessed One, \"Master Gotama, we declare a person endowed with four qualities to be one of great discernment, a great man. Which four?", "entities": [[20, 31, "PERSON"], [49, 57, "GPE"], [65, 77, "LOC"], [85, 105, "LOC"], [112, 121, "PERSON"], [157, 164, "GPE"], [178, 189, "PERSON"], [361, 372, "PERSON"], [382, 388, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an04.035.than.html", "title": "Vassakara Sutta", "para_seq": null}}
{"text": "On one occasion the Blessed One was staying near Savatthi , in Jeta's Grove, Anathapindika 's monastery. Then Rohitassa , the son of a deva, in the far extreme of the night, his extreme radiance lighting up the entirety of Jeta's Grove, went to the Blessed One. On arrival, having bowed down to the Blessed One, he stood to one side. As he was standing there he said to the Blessed One: \"Is it possible, lord, by traveling, to know or see or reach a far end of the cosmos where one does not take birth, age, die, pass away or reappear?\"", "entities": [[20, 31, "PERSON"], [49, 57, "GPE"], [63, 75, "LOC"], [77, 90, "PERSON"], [223, 235, "LOC"], [249, 260, "PERSON"], [299, 310, "PERSON"], [374, 385, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an04.045.than.html", "title": "Rohitassa Sutta", "para_seq": null}}
{"text": "On one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika 's monastery. Now, at that time in Savatthi a certain monk had died after having been bitten by a snake. Then a large number of monks went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As they were sitting there they said to him, \"Lord, just now in Savatthi a certain monk died after having been bitten by a snake.\"", "entities": [[20, 31, "PERSON"], [49, 57, "GPE"], [61, 73, "LOC"], [75, 88, "PERSON"], [124, 132, "GPE"], [235, 246, "PERSON"], [371, 379, "GPE"]], "meta": {"nikaya": "AN", "identifier": "an04.067.than.html", "title": "Ahina Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion Ven. Ananda was staying in Kosambi , at Ghosita 's Park. Then a certain nun said to a certain man, \"Go, my good man, to my lord Ananda and, on arrival, bowing your head to his feet in my name, tell him, 'The nun named such-and-such, venerable sir, is sick, in pain, severely ill. She bows her head to the feet of her lord Ananda and says, \"It would be good if my lord Ananda were to go to the nuns' quarters, to visit this nun out of sympathy for her.\"'\"", "entities": [[39, 45, "PERSON"], [61, 68, "GPE"], [162, 168, "PERSON"], [356, 362, "PERSON"], [402, 408, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an04.159.than.html", "title": "Bhikkhuni Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying at Rajagaha in the Bamboo Grove, the Squirrels' Sanctuary. Then Vassakara the brahman, the minister to the king of Magadha , approached the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there he said to the Blessed One: \"I am of the view, of the opinion, that when anyone speaks of what he has seen, [saying,] 'Thus have I seen,' there is no fault in that. When anyone speaks of what he has heard, [saying,] 'Thus have I heard,' there is no fault in that. When anyone speaks of what he has sensed, [saying,] 'Thus have I sensed,' there is no fault in that. When anyone speaks of what he has cognized, [saying,] 'Thus have I cognized,' there is no fault in that.\"", "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [81, 93, "LOC"], [99, 119, "LOC"], [126, 135, "PERSON"], [177, 184, "GPE"], [202, 213, "PERSON"], [384, 395, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an04.183.than.html", "title": "Suta Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying at Savatthi , in Jeta's Grove, Anathapindika 's monastery. There he addressed the monks, \"Monks, I will teach you the five-factored noble right concentration. Listen, and pay close attention. I will speak.\"", "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [79, 91, "LOC"], [93, 106, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an05.028.than.html", "title": "Samadhanga Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Vesali , in the Great Forest, at the Gabled Pavilion. Then General Siha went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the Blessed One: \"Is it possible, lord, to point out a fruit of generosity visible in the here & now?\"", "entities": [[38, 49, "PERSON"], [67, 73, "GPE"], [151, 162, "PERSON"], [262, 273, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an05.034.than.html", "title": "Siha Sutta", "para_seq": null}}
{"text": "Once the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika 's monastery. Then King Pasenadi the Kosalan went to the Blessed One and, on arrival, having bowed down, sat to one side. Now, at that time Queen Mallika died. Then a certain man went to the king and whispered in his ear: \"Your majesty, Queen Mallika has died.\" When this was said, King Pasenadi the Kosalan sat there miserable, sick at heart, his shoulders drooping, his face down, brooding, at a loss for words. Then the Blessed One saw the king sitting there miserable, sick at heart... at a loss for words, and so said to him, \"There are these five things, great king, that cannot be gotten by a contemplative, a brahman, a deva, a Mara, a Brahma, or anyone at all in the world. Which five?", "entities": [[9, 20, "PERSON"], [38, 46, "GPE"], [50, 62, "LOC"], [64, 77, "PERSON"], [97, 110, "PERSON"], [135, 146, "PERSON"], [218, 231, "PERSON"], [315, 328, "PERSON"], [360, 373, "PERSON"], [501, 512, "PERSON"], [714, 718, "PERSON"], [722, 728, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an05.049.than.html", "title": "Kosala Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Vesali , in the Great Forest, at the Gabled Pavilion. Then, in the late afternoon, he left his seclusion and went to the sick ward, where he saw a monk who was weak & sickly. Seeing him, he sat down on a prepared seat. As he was sitting there, he addressed the monks: \"When these five things don't leave a monk who is weak & sickly, it can be expected of him that, before long — with the ending of the fermentations — he will enter & remain in the fermentation-free awareness-release & discernment-release, having realized & directly known them for himself in the here & now. Which five?", "entities": [[38, 49, "PERSON"], [67, 73, "GPE"]], "meta": {"nikaya": "AN", "identifier": "an05.121.than.html", "title": "Gilana Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying at Kosambi , in Ghosita's Park. Now at that time Ven. Udayin was sitting surrounded by a large assembly of householders, teaching the Dhamma. Ven. Ananda saw Ven. Udayin sitting surrounded by a large assembly of householders, teaching the Dhamma, and on seeing him went to the Blessed One. On arrival, he bowed down to the Blessed One and sat to one side. As he was sitting there he said to the Blessed One: \"Ven. Udayin, lord, is sitting surrounded by a large assembly of householders, teaching the Dhamma.\"", "entities": [[38, 49, "PERSON"], [65, 72, "GPE"], [209, 215, "PERSON"], [339, 350, "PERSON"], [385, 396, "PERSON"], [457, 468, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an05.159.than.html", "title": "Udayi Sutta", "para_seq": null}}
{"text": "On one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery. And on that occasion the lay woman Velukandaki, Nanda's mother, had established a donation endowed with six factors for the community of monks headed by Sariputta & Moggallana. The Blessed One saw with his divine eye, surpassing the human, that the laywoman Velukandaki, Nanda's mother, had established a donation endowed with six factors for the community of monks headed by Sariputta & Moggallana. On seeing this, he addressed the monks: \"Monks, the lay woman Velukandaki, Nanda's mother, has established a donation endowed with six factors for the community of monks headed by Sariputta & Moggallana.", "entities": [[20, 31, "PERSON"], [49, 57, "GPE"], [61, 73, "LOC"], [75, 88, "PERSON"], [255, 264, "PERSON"], [267, 277, "PERSON"], [283, 294, "PERSON"], [478, 487, "PERSON"], [490, 500, "PERSON"], [682, 691, "PERSON"], [694, 704, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an06.037.than.html", "title": "Dana Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Rajagaha on Vulture's Peak Mountain. Then early in the morning, Ven. Sariputta put on his robes and, carrying his bowl and outer robe, was coming down from Vulture's Peak Mountain with a large group of monks when he saw a large wood pile off to one side. Seeing it, he said to the monks, \"Friends, do you see that large wood pile over there?\"", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [131, 145, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an06.041.than.html", "title": "Daruka-khandha Sutta", "para_seq": null}}
{"text": "On one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery. And at that time Ven. Khema and Ven. Sumana were staying near Savatthi in the Blind Man's Grove. Then Ven. Khema and Ven. Sumana went to the Blessed One and on arrival, have bowed down to him, sat to one side. As he was sitting there, Ven. Khema said to the Blessed One, \"When a monk is an arahant, with his fermentations ended — one who has reached fulfillment, done the task, laid down the burden, attained the true goal, totally destroyed the fetter of becoming, and is released through right gnosis — the thought doesn't occur to him that 'There is someone better than me,' or 'There is someone equal to me,' or 'There is someone worse than me.'\" That is what Ven. Khema said, and the Teacher approved. Sensing that \"The Teacher approves of me,\" Ven. Khema got up from his seat, bowed down to the Blessed One, circled him — keeping him on his right — and left.", "entities": [[20, 31, "PERSON"], [49, 57, "GPE"], [61, 73, "LOC"], [75, 88, "PERSON"], [164, 172, "GPE"], [243, 254, "PERSON"], [360, 371, "PERSON"], [903, 914, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an06.049.than.html", "title": "Khema Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Rajagaha , on Vulture Peak Mountain. And on that occasion Ven. Sona was staying near Rajagaha in the Cool Wood. Then, as Ven. Sona was meditating in seclusion [after doing walking meditation until the skin of his soles was split & bleeding], this train of thought arose in his awareness: \"Of the Blessed One's disciples who have aroused their persistence, I am one, but my mind is not released from the fermentations through lack of clinging/sustenance. Now, my family has enough wealth that it would be possible to enjoy wealth & make merit. What if I were to disavow the training, return to the lower life, enjoy wealth, & make merit?\"", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [152, 160, "GPE"], [363, 374, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an06.055.than.html", "title": "Sona Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying in Rajagaha , on Vulture Peak Mountain. There he addressed the monks: \"Monks, I will teach you the seven conditions that lead to no decline. Listen & pay close attention. I will speak.\"", "entities": [[38, 49, "PERSON"], [65, 73, "GPE"]], "meta": {"nikaya": "AN", "identifier": "an07.021.than.html", "title": "Bhikkhu-aparihaniya Sutta", "para_seq": null}}
{"text": "Once [1] the Blessed One was living among the Bhaggas in the Deer Park at Bhesakala Grove, near Crocodile Haunt . At that time Ven. Maha Moggallana [2] sat nodding near the village of Kallavalaputta , in Magadha . The Blessed One, with his purified divine eye, surpassing the human, saw Ven. Maha Moggallana as he sat nodding near the village of Kallavalaputta, in Magadha. As soon as he saw this — just as a strong man might extend his flexed arm or flex his extended arm — he disappeared from among the Bhaggas in the Deer Park at Bhesakala Grove, near Crocodile Haunt, and re-appeared near the village of Kallavalaputta, in Magadha, right in front of Ven. Maha Moggallana. There he sat down on a prepared seat. As he was sitting there, the Blessed One said to Ven. Maha Moggallana, \"Are you nodding, Moggallana? Are you nodding?\"", "entities": [[13, 24, "PERSON"], [61, 70, "LOC"], [96, 111, "LOC"], [137, 147, "PERSON"], [204, 211, "GPE"], [218, 229, "PERSON"], [297, 307, "PERSON"], [365, 372, "GPE"], [520, 529, "LOC"], [555, 570, "LOC"], [627, 634, "GPE"], [664, 674, "PERSON"], [743, 754, "PERSON"], [773, 783, "PERSON"], [803, 813, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an07.058.than.html", "title": "Capala (Pacala) Sutta", "para_seq": null}}
{"text": "On one occasion the Blessed One was staying near Rajagaha on Vulture Peak Mountain, not long after Devadatta's departure. There, referring to Devadatta, he addressed the monks: \"Monks, it's good for a monk periodically to have reflected on his own failings. It's good for a monk periodically to have reflected on the failings of others. It's good for a monk periodically to have reflected on his own attainments. It's good for a monk periodically to have reflected on the attainments of others.", "entities": [[20, 31, "PERSON"], [49, 57, "GPE"], [99, 108, "PERSON"], [142, 151, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an08.007.than.html", "title": "Devadatta Sutta", "para_seq": null}}
{"text": "\"Amazing, venerable sir. Astounding, venerable sir — how well that has been said by Ven. Uttara: 'Whatever is well said is all a saying of the Blessed One, the Worthy One, the Rightly Self-awakened One. Adopting it again & again from there do we & others speak.' * [1] On one occasion the Blessed One was staying near Rajagaha on Vulture Peak Mountain, not long after Devadatta's departure. There, referring to Devadatta, he addressed the monks: 'Monks, it's good for a monk periodically to have reflected on his own failings. It's good for a monk periodically to have reflected on the failings of others. It's good for a monk periodically to have reflected on his own attainments. It's good for a monk periodically to have reflected on the attainments of others.", "entities": [[143, 154, "PERSON"], [289, 300, "PERSON"], [318, 326, "GPE"], [368, 377, "PERSON"], [411, 420, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an08.008.than.html", "title": "Uttara Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying in Rajagaha , at Jivaka's Mango Grove. Then Jivaka Komarabhacca went to the Blessed One and, on arrival, having bowed down, sat to one side. As he was sitting there he said to the Blessed One: \"Lord, to what extent is one a lay follower?\"", "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [79, 99, "LOC"], [138, 149, "PERSON"], [242, 253, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an08.026.than.html", "title": "Jivaka Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was dwelling among the Koliyans . Now the Koliyans have a town named Kakkarapatta . There Dighajanu [1] the Koliyan went to the Blessed One and, on arrival, having bowed down to the Blessed One, sat to one side. As he was sitting there he said to the Blessed One, \"We are lay people enjoying sensuality; living crowded with spouses & children; using Kasi fabrics & sandalwood; wearing garlands, scents, & creams; handling gold & silver. May the Blessed One teach the Dhamma for those like us, for our happiness & well-being in this life, for our happiness & well-being in lives to come.\"", "entities": [[38, 49, "PERSON"], [178, 189, "PERSON"], [232, 243, "PERSON"], [301, 312, "PERSON"], [400, 404, "GPE"], [495, 506, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an08.054.than.html", "title": "Dighajanu (Vyagghapajja) Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika 's monastery. There he said to the monks: \"Monks, if wanderers who are members of other sects should ask you, ' What , friend, are the prerequisites for the development of the wings to self-awakening?' how would you answer them?\"", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [79, 91, "LOC"], [93, 106, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an09.001.than.html", "title": "Sambodhi Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying in Rajagaha , on Vulture Peak Mountain. Then Sutavan the wanderer went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to the Blessed One: \"One day recently when I was staying right here in Rajagaha, at Giribbaja , I heard it in the Blessed One's presence, learned it in the Blessed One's presence: 'Sutavan, an arahant monk whose mental fermentations are ended, who has reached fulfillment, done the task, laid down the burden, attained the true goal, totally destroyed the fetter of becoming, and who is released through right gnosis, cannot possibly transgress these five principles. It is impossible for a monk whose mental fermentations are ended to intentionally deprive a living being of life. It is impossible for a monk whose mental fermentations are ended to take, in the manner of stealing, what is not given. It is impossible for a monk whose mental fermentations are ended to engage in sexual intercourse. It is impossible for a monk whose mental fermentations are ended to tell a conscious lie. It is impossible for a monk whose mental fermentations are ended to consume stored-up sensual things as he did before, when he was a householder.' Now, did I hear this rightly from the Blessed One? Did I learn it rightly, attend to it rightly, understand it rightly?\"", "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [140, 151, "PERSON"], [323, 334, "PERSON"], [387, 395, "GPE"], [430, 441, "PERSON"], [472, 483, "PERSON"], [1391, 1402, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an09.007.than.html", "title": "Sutava Sutta", "para_seq": null}}
{"text": "On one occasion the Blessed One was staying near Sāvatthī in Jeta's Grove, Anāthapiṇḍika's monastery. Then Anāthapiṇḍika the householder went to the Blessed One and, on arrival, bowed down to him and sat to one side. As he was sitting there, the Blessed One said to him, \"Householder, are gifts still given in your family?\"", "entities": [[20, 31, "PERSON"], [49, 57, "GPE"], [61, 73, "LOC"], [149, 160, "PERSON"], [246, 257, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an09.020.than.html", "title": "Velāma Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion Ven. Sariputta was staying near Rajagaha in the Bamboo Grove, the Squirrels' Feeding Sanctuary. There he said to the monks, \"This Unbinding is pleasant, friends. This Unbinding is pleasant.\"", "entities": [[34, 48, "PERSON"], [66, 74, "GPE"], [82, 94, "LOC"]], "meta": {"nikaya": "AN", "identifier": "an09.034.than.html", "title": "Nibbana Sutta", "para_seq": null}}
{"text": "\"Once, friend, when I was staying in Saketa at the Game Refuge in the Black Forest, the nun Jatila Bhagika went to where I was staying, and on arrival — having bowed to me — stood to one side. As she was standing there, she said to me: 'The concentration whereby — neither pressed down nor forced back, nor with fabrication kept blocked or suppressed — still as a result of release, contented as a result of standing still, and as a result of contentment one is not agitated: This concentration is said by the Blessed One to be the fruit of what?'", "entities": [[37, 43, "GPE"], [510, 521, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an09.037.than.html", "title": "Ananda Sutta", "para_seq": null}}
{"text": "On one occasion Ven. Ananda was staying in Kosambi at Ghosita's Park. Then Ven. Udayin went to him and, on arrival, exchanged courteous greetings. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to Ven. Ananda, \"This has been said by Pañcalacanda the deva's son:", "entities": [[21, 27, "PERSON"], [43, 50, "GPE"], [262, 268, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an09.042.than.html", "title": "Pañcala Sutta", "para_seq": null}}
{"text": "\"Once, friend Ananda, when I was staying right here in Savatthi in the Blind Man's Grove, I reached concentration in such a way that I was neither percipient of earth with regard to earth... nor of the next world with regard to the next world, and yet I was still percipient.\"", "entities": [[14, 20, "PERSON"], [55, 63, "GPE"]], "meta": {"nikaya": "AN", "identifier": "an10.007.than.html", "title": "Sariputta Sutta", "para_seq": null}}
{"text": "[1] \"Monks, as far as Kasi & Kosala extend, as far as the rule of King Pasenadi the Kosalan extends, King Pasenadi the Kosalan is reckoned supreme. Yet even in King Pasenadi the Kosalan there is still aberration, there is change. Seeing this, the instructed disciple of the noble ones grows disenchanted with that. Being disenchanted with that, he becomes dispassionate toward what is supreme, and even more so toward what is inferior.", "entities": [[22, 26, "GPE"], [29, 35, "GPE"], [66, 79, "PERSON"], [101, 114, "PERSON"], [160, 173, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an10.029.than.html", "title": "Kosala Sutta", "para_seq": null}}
{"text": "(e) \"Having a single formless perception internally, one sees forms externally as blue, blue in their color, blue in their features, blue in their glow. Just as a flax-flower is blue, blue in its color, blue in its features, blue in its glow, or just as Benares muslin, smooth on both sides, is blue, blue in its color, blue in its features, blue in its glow; in the same way, having a single formless perception internally, one sees forms externally as blue, blue in their color, blue in their features, blue in their glow. Mastering them, one has the perception, 'I know; I see.' This is the fifth dimension of [mental] mastery.", "entities": [[254, 261, "GPE"]], "meta": {"nikaya": "AN", "identifier": "an10.029.than.html", "title": "Kosala Sutta", "para_seq": null}}
{"text": "(f) \"Having a single formless perception internally, one sees forms externally as yellow, yellow in their color, yellow in their features, yellow in their glow. Just as a kannikara-flower is yellow, yellow in its color, yellow in its features, yellow in its glow, or just as Benares muslin, smooth on both sides, is yellow, yellow in its color, yellow in its features, yellow in its glow; in the same way, having a single formless perception internally, one sees forms externally as yellow, yellow in their color, yellow in their features, yellow in their glow. Mastering them, one has the perception, 'I know; I see.' This is the sixth dimension of [mental] mastery.", "entities": [[275, 282, "GPE"]], "meta": {"nikaya": "AN", "identifier": "an10.029.than.html", "title": "Kosala Sutta", "para_seq": null}}
{"text": "(g) \"Having a single formless perception internally, one sees forms externally as red, red in their color, red in their features, red in their glow. Just as a bandha-jivaka-flower is red, red in its color, red in its features, red in its glow, or just as Benares muslin, smooth on both sides, is red, red in its color, red in its features, red in its glow; in the same way, having a single formless perception internally, one sees forms externally as red, red in their color, red in their features, red in their glow. Mastering them, one has the perception, 'I know; I see.' This is the seventh dimension of [mental] mastery.", "entities": [[255, 262, "GPE"]], "meta": {"nikaya": "AN", "identifier": "an10.029.than.html", "title": "Kosala Sutta", "para_seq": null}}
{"text": "(h) \"Having a single formless perception internally, one sees forms externally as white, white in their color, white in their features, white in their glow. Just as the morning star is white, white in its color, white in its features, white in its glow, or just as Benares muslin, smooth on both sides, is white, white in its color, white in its features, white in its glow; in the same way, having a single formless perception internally, one sees forms externally as white, white in their color, white in their features, white in their glow. Mastering them, one has the perception, 'I know; I see.' This is the eighth dimension of [mental] mastery.", "entities": [[265, 272, "GPE"]], "meta": {"nikaya": "AN", "identifier": "an10.029.than.html", "title": "Kosala Sutta", "para_seq": null}}
{"text": "On one occasion the Blessed One was staying near Kapilavatthu at the Banyan Park. Then many Sakyan lay followers, it being the Uposatha day, went to the Blessed One. On arrival, having bowed down to him, they sat to one side. As they were sitting there, the Blessed One said to them, \"Sakyans, do you observe the eight-factored uposatha?\"", "entities": [[20, 31, "PERSON"], [49, 61, "GPE"], [153, 164, "PERSON"], [258, 269, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an10.046.than.html", "title": "Sakka Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi , in Jeta's Grove, Anathapindika 's monastery. And on that occasion Ven. Girimananda was diseased, in pain, severely ill. Then Ven. Ananda went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the Blessed One, \"Lord, Ven. Girimananda is diseased, in pain, severely ill. It would be good if the Blessed One would visit Ven. Girimananda, out of sympathy for him.\"", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [81, 93, "LOC"], [95, 108, "PERSON"], [208, 214, "PERSON"], [227, 238, "PERSON"], [338, 349, "PERSON"], [435, 446, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an10.060.than.html", "title": "Girimananda Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying in Savatthi at Jeta's Grove, Anathapindika 's monastery. Now at that time a large number of monks, after the meal, on returning from their alms round, had gathered at the meeting hall and were engaged in many kinds of bestial topics of conversation: conversation about kings, robbers, & ministers of state; armies, alarms, & battles; food & drink; clothing, furniture, garlands, & scents; relatives; vehicles; villages, towns, cities, the countryside; women & heroes; the gossip of the street & the well; tales of the dead; tales of diversity, the creation of the world & of the sea; talk of whether things exist or not.", "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [77, 89, "LOC"], [91, 104, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an10.069.than.html", "title": "Kathavatthu Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying in Savatthi at Jeta's Grove, Anathapindika's monastery . Now at that time a large number of monks, after the meal, on returning from their alms round, had gathered at the meeting hall and were engaged in many kinds of bestial topics of conversation: conversation about kings, robbers, & ministers of state; armies, alarms, & battles; food & drink; clothing, furniture, garlands, & scents; relatives; vehicles; villages, towns, cities, the countryside; women & heroes; the gossip of the street & the well; tales of the dead; tales of diversity, the creation of the world & of the sea; talk of whether things exist or not.", "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [77, 89, "LOC"], [91, 104, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an10.070.than.html", "title": "Kathavatthu Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery . Then Anathapindika the householder left Savatthi in the middle of the day to see the Blessed One, but the thought then occurred to him, \"Now is not the right time to see the Blessed One, for he is in seclusion. And it is not the right time to see the monks who are developing their minds [in meditation], for they are in seclusion. What if I were to visit the park of the wanderers of other persuasions?\" So he headed to the park of the wanderers of other persuasions.", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [79, 91, "LOC"], [93, 106, "PERSON"], [126, 139, "PERSON"], [161, 169, "GPE"], [206, 217, "PERSON"], [295, 306, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an10.093.than.html", "title": "Ditthi Sutta", "para_seq": null}}
{"text": "Now on that occasion the wanderers of other persuasions had come together in a gathering and were sitting, discussing many kinds of bestial topics, [1] making a great noise and racket. They saw Anathapindika the householder coming from afar, and on seeing him, hushed one another: \"Be quiet, good sirs. Don't make any noise. Here comes Anathapindika the householder, a disciple of Gotama the contemplative. He is one of those disciples of Gotama the contemplative, clad in white, who lives in Savatthi. These people are fond of quietude and speak in praise of quietude. Maybe, if he perceives our group as quiet, he will consider it worth his while to come our way.\" So the wanderers fell silent.", "entities": [[194, 207, "PERSON"], [336, 349, "PERSON"], [381, 387, "PERSON"], [439, 445, "PERSON"], [493, 501, "GPE"]], "meta": {"nikaya": "AN", "identifier": "an10.093.than.html", "title": "Ditthi Sutta", "para_seq": null}}
{"text": "Now on that occasion the wanderers of other persuasions had come together in a gathering and were sitting, discussing many kinds of bestial topics, [1] making a great noise & racket. They saw Vajjiya Mahita the householder coming from afar, and on seeing him, hushed one another: \"Be quiet, good sirs. Don't make any noise. Here comes Vajjiya Mahita the householder, a disciple of Gotama the contemplative. He is one of those disciples of Gotama the contemplative, clad in white, who lives in Savatthi . These people are fond of quietude and speak in praise of quietude. Maybe, if he perceives our group as quiet, he will consider it worth his while to come our way.\" So the wanderers fell silent.", "entities": [[381, 387, "PERSON"], [439, 445, "PERSON"], [493, 501, "GPE"]], "meta": {"nikaya": "AN", "identifier": "an10.094.than.html", "title": "Vajjiya Sutta", "para_seq": null}}
{"text": "On one occasion Ven. Ananda was staying near Rajagaha , at Tapoda monastery. Then, as night was ending, he got up & went to the Tapoda Hot Springs to bathe his limbs. Having bathed his limbs and having gotten out of the springs, he stood wearing only his lower robe, drying his limbs. Kokanuda the wanderer, as night was ending, also got up & went to the Tapoda Hot Springs to bathe his limbs. He saw Ven. Ananda from afar, and on seeing him said to him, \"Who are you, my friend?\"", "entities": [[21, 27, "PERSON"], [45, 53, "GPE"], [406, 412, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an10.096.than.html", "title": "Kokanuda Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika 's monastery. Then Ven. Ananda went to the Blessed One and on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the Blessed One: \"What is the purpose of skillful virtues? What is their reward?\"", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [79, 91, "LOC"], [93, 106, "PERSON"], [131, 137, "PERSON"], [150, 161, "PERSON"], [260, 271, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an11.001.than.html", "title": "Kimattha Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying among the Sakyans at Kapilavatthu in the Banyan Park . Now at that time many monks were at work making robes for the Blessed One, [thinking], \"When the robes are finished, at the end of the three months, [1] the Blessed One will set out wandering.\" Mahanama the Sakyan heard that many monks were at work making robes for the Blessed One, [thinking], \"When the robes are finished, at the end of the three months, the Blessed One will set out wandering.\" So he approached the Blessed One and, on arrival, having bowed down, sat to one side. As he was sitting there he said to the Blessed One: \"I have heard that many monks are at work making robes for the Blessed One, [thinking], 'When the robes are finished, at the end of the three months, the Blessed One will set out wandering.' For those of us living by means of various dwelling places [for the mind], by means of which dwelling place should we live?\"", "entities": [[38, 49, "PERSON"], [83, 95, "GPE"], [179, 190, "PERSON"], [274, 285, "PERSON"], [387, 398, "PERSON"], [478, 489, "PERSON"], [536, 547, "PERSON"], [640, 651, "PERSON"], [716, 727, "PERSON"], [807, 818, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an11.012.than.html", "title": "Mahanama Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying among the Sakyans at Kapilavatthu in the Banyan Park . Now at that time Mahanama the Sakyan had recovered from being ill, was not long recovered from his illness. And at that time many monks were at work making robes for the Blessed One, [thinking], \"When the robes are finished, at the end of the three months, [1] the Blessed One will set out wandering.\" Mahanama the Sakyan heard that many monks were at work making robes for the Blessed One, [thinking], \"When the robes are finished, at the end of the three months, the Blessed One will set out wandering.\" So he approached the Blessed One and, on arrival, having bowed down, sat to one side. As he was sitting there he said to the Blessed One: \"I have heard that many monks are at work making robes for the Blessed One, [thinking], 'When the robes are finished, at the end of the three months, the Blessed One will set out wandering.' For those of us living by means of various dwelling places [for the mind], by means of which dwelling place should we live?\"", "entities": [[38, 49, "PERSON"], [83, 95, "GPE"], [287, 298, "PERSON"], [382, 393, "PERSON"], [495, 506, "PERSON"], [586, 597, "PERSON"], [644, 655, "PERSON"], [748, 759, "PERSON"], [824, 835, "PERSON"], [915, 926, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an11.013.than.html", "title": "Mahanama Sutta", "para_seq": null}}
{"text": "On one occasion Ven. Ananda was staying near Vesali at Veluvagamaka. Now on that occasion Dasama the householder from Atthakanagara had arrived at Pataliputta on some business. Then he went to a certain monk at Kukkata Monastery and on arrival said to him, \"Where is Ven. Ananda staying now? I'd like to see him.\"", "entities": [[21, 27, "PERSON"], [45, 51, "GPE"], [272, 278, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an11.017.than.html", "title": "Dasama Sutta", "para_seq": null}}
{"text": "Then Dasama the householder from Atthakanagara, on completing his business at Pataliputta, went to Ven. Ananda at Veluvagamaka near Vesali. On arrival, having bowed down to him, he sat to one side. As he was sitting there, he said to Ven. Ananda: \"Venerable sir, is there a single quality declared by the Blessed One — the one who knows, the one who sees, worthy & rightly self-awakened — where the unreleased mind of a monk who dwells there heedful, ardent, & resolute becomes released, or his unended fermentations go to their total ending, or he attains the unexcelled security from the yoke that he had not attained before?\"", "entities": [[104, 110, "PERSON"], [132, 138, "GPE"], [239, 245, "PERSON"], [305, 316, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an11.017.than.html", "title": "Dasama Sutta", "para_seq": null}}
{"text": "So Dasama the householder from Atthakanagara, having assembled the community of monks from Vesali and Pataliputta, with his own hands served & satisfied them with refined staple & non-staple foods. He presented a pair of cloths to each monk, and a triple robe to Ven. Ananda. And, for Ven. Ananda, he had a dwelling built worth five hundred [kahapanas].", "entities": [[91, 97, "GPE"], [268, 274, "PERSON"], [290, 296, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an11.017.than.html", "title": "Dasama Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying at Rajagaha , in Jivaka Komarabhacca 's mango grove, with a large community of monks — 1,250 monks in all. Now at that time — it being the observance day, the full-moon night of the water-lily season, the fourth month of the rains — King Ajatasattu of Magadha, the son of Queen Videha , was sitting on the roof terrace of his palace surrounded by his ministers. Then he felt inspired to exclaim: \"How wonderful is this moonlit night! How beautiful... How lovely... How inspiring... How auspicious is this moonlit night! What brahman or contemplative should we visit tonight who might enlighten and bring peace to our mind?\"", "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [300, 310, "PERSON"], [314, 321, "GPE"], [334, 346, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.02.0.than.html", "title": "Samaññaphala Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery . Now on that occasion Potthapada the wanderer , together with a large following of about 300 wanderers, had taken up residence in the debating hall near the Tinduka tree in the single-pavilion park of Queen Mallika . Then the Blessed One, early in the morning, taking his robes & bowl, entered Savatthi for alms. Then the thought occurred to him, \"While it's still too early to go into Savatthi for alms, why don't I go to the debating hall near the Tinduka tree in the single-pavilion park of Queen Mallika to see Potthapada the wanderer?\" So he went to the debating hall near the Tinduka tree in the single-pavilion park of Queen Mallika.", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [79, 91, "LOC"], [93, 106, "PERSON"], [142, 152, "PERSON"], [321, 334, "PERSON"], [346, 357, "PERSON"], [414, 422, "GPE"], [506, 514, "GPE"], [614, 627, "PERSON"], [635, 645, "PERSON"], [746, 759, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.09.0.than.html", "title": "Potthapada Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying at Nalanda in Pavarika 's mango grove. Then Kevatta the householder approached the Blessed One and, on arrival, having bowed down, sat to one side. As he was sitting there he said to the Blessed One: \"Lord, this Nalanda is powerful, both prosperous and populous, filled with people who have faith in the Blessed One. It would be good if the Blessed One were to direct a monk to display a miracle of psychic power from his superior human state so that Nalanda would to an even greater extent have faith in the Blessed One.\"", "entities": [[38, 49, "PERSON"], [65, 72, "GPE"], [145, 156, "PERSON"], [249, 260, "PERSON"], [274, 281, "GPE"], [366, 377, "PERSON"], [403, 414, "PERSON"], [513, 520, "GPE"], [571, 582, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.11.0.than.html", "title": "Kevatta (Kevaddha) Sutta", "para_seq": null}}
{"text": "A second time... A third time, Kevatta the householder said to the Blessed One: \"I won't argue with the Blessed One, but I tell you: Lord, this Nalanda is powerful, both prosperous and populous, filled with people who have faith in the Blessed One. It would be good if the Blessed One were to direct a monk to display a miracle of psychic power from his superior human state so that Nalanda would to an even greater extent have faith in the Blessed One.\"", "entities": [[67, 78, "PERSON"], [104, 115, "PERSON"], [144, 151, "GPE"], [236, 247, "PERSON"], [273, 284, "PERSON"], [383, 390, "GPE"], [441, 452, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.11.0.than.html", "title": "Kevatta (Kevaddha) Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was on a wandering tour among the Kosalans with a large community of monks — approximately 500 monks in all — and arrived at Salavatika . Now at that time the brahman Lohicca was reigning with feudatory rights over Salavatika — together with its wealth, grass, timber, & grain — through a royal grant bestowed by King Pasenadi Kosala . And at that time an evil viewpoint to this effect had arisen to him: \"Suppose that a brahman or contemplative were to arrive at a skillful doctrine. Having arrived at a skillful doctrine, he should not declare it to anyone else, for what can one person do for another? It would be just the same as if, having cut through an old bond, one were to make another new bond. I say that such a thing is an evil, greedy deed, for what can one person do for another?\"", "entities": [[38, 49, "PERSON"], [175, 185, "GPE"], [217, 224, "PERSON"], [265, 275, "GPE"], [363, 383, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.12.0.than.html", "title": "Lohicca Sutta", "para_seq": null}}
{"text": "Then Lohicca heard it said, \"Gotama the contemplative — the son of the Sakyans, having gone forth from the Sakyan clan — on a wandering tour among the Kosalans with a large community of monks — approximately 500 monks in all — has arrived at Salavatika. And of that Master Gotama this fine reputation has spread: 'He is indeed a Blessed One, worthy, & rightly self-awakened, consummate in knowledge & conduct, well-gone, a knower of the cosmos, an unexcelled trainer of those persons ready to be tamed, teacher of human & divine beings, awakened, blessed. He has made known — having realized it through direct knowledge — this world with its devas, maras, & brahmas, its generations with their contemplatives & brahmans, their rulers & common people; has explained the Dhamma admirable in the beginning, admirable in the middle, admirable in the end; has expounded the holy life both in its particulars & in its essence, entirely perfect, surpassingly pure. It is good to see such a worthy one.'\"", "entities": [[5, 12, "PERSON"], [29, 35, "PERSON"], [242, 252, "GPE"], [273, 279, "PERSON"], [329, 340, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.12.0.than.html", "title": "Lohicca Sutta", "para_seq": null}}
{"text": "Then the Blessed One, having put on his robes early in the morning, carrying his bowl & outer robe, went together with a community of monks to Salavatika. Meanwhile, Rosika the barber was following right behind the Blessed One and said to him, \"Lord, an evil viewpoint to this effect has arisen to the brahman Lohicca: 'Suppose that a brahman or contemplative were to arrive at a skillful doctrine. Having arrived at a skillful doctrine, he should not declare it to anyone else, for what can one person do for another? It would be just the same as if, having cut through an old bond, one were to make another new bond. I say that such a thing is an evil, greedy deed, for what can one person do for another?' It would be good if the Blessed One would extract the brahman Lohicca from this evil viewpoint.\"", "entities": [[9, 20, "PERSON"], [143, 153, "GPE"], [215, 226, "PERSON"], [310, 317, "PERSON"], [733, 744, "PERSON"], [771, 778, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.12.0.than.html", "title": "Lohicca Sutta", "para_seq": null}}
{"text": "\"Now, suppose someone were to say, 'The brahman Lohicca reigns over Salavatika. He alone should consume the fruits & revenues of Salavatika, and not share them with others.' Would someone speaking in this way be a creator of obstacles for your subjects, or would he not?\"", "entities": [[48, 55, "PERSON"], [68, 78, "GPE"], [129, 139, "GPE"]], "meta": {"nikaya": "DN", "identifier": "dn.12.0.than.html", "title": "Lohicca Sutta", "para_seq": null}}
{"text": "\"Now, suppose someone were to say, 'King Pasenadi Kosala reigns over Kasi & Kosala. He alone should consume the fruits & revenues of Kasi & Kosala, and not share them with others.' Would someone speaking in this way be a creator of obstacles for King Pasenadi's subjects — you & others — or would he not?\"", "entities": [[36, 56, "PERSON"], [69, 73, "GPE"], [76, 82, "GPE"], [133, 137, "GPE"], [140, 146, "GPE"], [246, 259, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.12.0.than.html", "title": "Lohicca Sutta", "para_seq": null}}
{"text": "\"So then, Lohicca, if anyone were to say, 'The brahman Lohicca reigns over Salavatika. He alone should consume the fruits & revenues of Salavatika, and not share them with others,' he, speaking in this way, would be a creator of obstacles for your subjects. Being a creator of obstacles, he would not be sympathetic for their welfare. In one not sympathetic for their welfare, the mind would be established in animosity for them. When the mind is established in animosity, there is wrong view. For one of wrong view, I tell you, there is one of two destinations: either hell or the animal womb. In the same way, if anyone were to say, 'Suppose that a brahman or contemplative were to arrive at a skillful doctrine. Having arrived at a skillful doctrine, he should not declare it to anyone else, for what can one person do for another? It would be just the same as if, having cut through an old bond, one were to make another new bond. I say that such a thing is an evil, greedy deed, for what can one person do for another?' — he, speaking in this way, would be a creator of obstacles for those children of good family who, coming to the doctrine & discipline revealed by the Tathagata, attain the sort of grand distinction where they attain the fruit of stream-entry, the fruit of once-returning, the fruit of non-returning, the fruit of arahantship; and for those who ripen deva wombs for the sake of bringing about the deva state. Being a creator of obstacles, he would not be sympathetic for their welfare. In one not sympathetic for their welfare, the mind would be established in animosity for them. When the mind is established in animosity, there is wrong view. For one of wrong view, I tell you, there is one of two destinations: either hell or the animal womb.", "entities": [[10, 17, "PERSON"], [55, 62, "PERSON"], [75, 85, "GPE"], [136, 146, "GPE"], [1176, 1185, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.12.0.than.html", "title": "Lohicca Sutta", "para_seq": null}}
{"text": "\"And if anyone were to say, 'King Pasenadi Kosala reigns over Kasi & Kosala. He alone should consume the fruits & revenues of Kasi & Kosala, and not share them with others,' he, speaking in this way, would be a creator of obstacles for King Pasenadi's subjects — you & others. Being a creator of obstacles, he would not be sympathetic for their welfare. In one not sympathetic for their welfare, the mind would be established in animosity for them. When the mind is established in animosity, there is wrong view. For one of wrong view, I tell you, there is one of two destinations: either hell or the animal womb. In the same way, if anyone were to say, 'Suppose that a brahman or contemplative were to arrive at a skillful doctrine. Having arrived at a skillful doctrine, he should not declare it to anyone else, for what can one person do for another? It would be just the same as if, having cut through an old bond, one were to make another new bond. I say that such a thing is an evil, greedy deed, for what can one person do for another?' — he, speaking in this way, would be a creator of obstacles for those children of good family who, coming to the doctrine & discipline revealed by the Tathagata, attain the sort of grand distinction where they attain the fruit of stream-entry, the fruit of once-returning, the fruit of non-returning, the fruit of arahantship; and also for those who ripen deva wombs for the sake of bringing about the deva state. Being a creator of obstacles, he would not be sympathetic for their welfare. In one not sympathetic for their welfare, the mind would be established in animosity for them. When the mind is established in animosity, there is wrong view. For one of wrong view, I tell you, there is one of two destinations: either hell or the animal womb.", "entities": [[29, 49, "PERSON"], [62, 66, "GPE"], [69, 75, "GPE"], [126, 130, "GPE"], [133, 139, "GPE"], [236, 249, "PERSON"], [1195, 1204, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.12.0.than.html", "title": "Lohicca Sutta", "para_seq": null}}
{"text": "Then the Blessed One with a large community of monks went to the far shore of the Hiraññavati River and headed for Upavattana, the Mallans' sal-grove near Kusinara. On arrival, he said to Ven. Ananda, \"Ananda, please prepare a bed for me between the twin sal-trees, with its head to the north. I am tired, and will lie down.\"", "entities": [[9, 20, "PERSON"], [82, 99, "LOC"], [115, 125, "GPE"], [155, 163, "GPE"], [193, 199, "PERSON"], [202, 208, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}
{"text": "\"Ananda, most of the devatas from ten world-systems have gathered in order to see the Tathagata. For twelve leagues all around Upavattana, the Mallans' sal-grove near Kusinara, there is not the space even of the tip of a horse-tail hair that is not occupied by eminent devatas. The devatas, Ananda, are complaining, 'We have come a long distance to see the Tathagata. [3] Only once in a long, long time does a Tathagata — worthy & rightly self-awakened — arise in the world. Tonight, in the last watch of the night, the total Unbinding of the Tathagata will occur. And this eminent monk is standing in front of the Blessed One, blocking the way. We aren't getting to see the Blessed One in his final hour.'\"", "entities": [[1, 7, "PERSON"], [86, 95, "PERSON"], [127, 137, "GPE"], [167, 175, "GPE"], [291, 297, "PERSON"], [357, 366, "PERSON"], [410, 419, "PERSON"], [543, 552, "PERSON"], [615, 626, "PERSON"], [675, 686, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}
{"text": "When this was said, Ven. Ananda said to the Blessed One, \"Lord, may the Blessed One not be totally unbound in this little town, this dusty town, this branch township. There are other great cities: Campa , Rajagaha , Savatthi , Saketa , Kosambi , Vanarasi . May the Blessed One be totally unbound there. In those cities there are many wealthy noble warriors, brahmans, & householders who have high confidence in the Tathagata. They will conduct the Tathagata's funeral.\"", "entities": [[25, 31, "PERSON"], [44, 55, "PERSON"], [72, 83, "PERSON"], [205, 213, "GPE"], [216, 224, "GPE"], [227, 233, "GPE"], [236, 243, "GPE"], [265, 276, "PERSON"], [415, 424, "PERSON"], [448, 457, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}
{"text": "\"Don't say that, Ananda. Don't say that: 'this little town, this dusty town, this branch township.' In the past, Ananda, a king named Mahasudassana was a wheel-turning monarch, a righteous king ruling righteously, who was a conqueror of the four directions, a stabilizer of his country, endowed with the seven treasures. This Kusinara was his capital city, named Kusavati : twelve leagues long from east to west, seven leagues wide from north to south. Kusavati was powerful, rich, & well-populated, crowded with people & prosperous. Just as the capital city of the devas, named Alakamanda is powerful, rich, & well-populated, crowded with yakkhas & prosperous; in the same way, Kusavati was powerful, rich, & well-populated, crowded with people & prosperous. By day or by night, it was never lacking in ten sounds: the sound of elephants, horses, carts, drums, tabors, lutes, songs, cymbals, gongs, with cries of 'Eat! Drink! Snack!' as the tenth.", "entities": [[17, 23, "PERSON"], [113, 119, "PERSON"], [326, 334, "GPE"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}
{"text": "\"Now, Ananda, go into Kusinara and announce to the Kusinara Mallans, 'Tonight, Vasitthas, in the last watch of the night, the total Unbinding of the Tathagata will occur. Come out, Vasitthas! Come out, Vasitthas! Don't later regret that \"The Tathagata's total Unbinding occurred within the borders of our very own town, but we didn't get to see him in his final hour!\"'\"", "entities": [[6, 12, "PERSON"], [22, 30, "GPE"], [51, 59, "GPE"], [149, 158, "PERSON"], [242, 251, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}
{"text": "Responding, \"As you say, lord,\" Ven. Ananda put on his robe and — carrying his bowl & outer robe — went unaccompanied into Kusinara. Now at that time the Kusinara Mallans had met for some business in their assembly hall. Ven. Ananda went to the assembly hall and on arrival announced to them, \"Tonight, Vasitthas, in the last watch of the night, the total Unbinding of the Tathagata will occur. Come out, Vasitthas! Come out, Vasitthas! Don't later regret that 'The Tathagata's total Unbinding occurred within the borders of our very own town, but we didn't get to see him in his final hour!'\" When they heard Ven. Ananda, the Mallans together with their sons, daughters, & wives were shocked, saddened, their minds overflowing with sorrow. Some of them wept, tearing at their hair; they wept, uplifting their arms. As if their feet were cut out from under them, they fell down and rolled back & forth, crying, \"All too soon, the Blessed One will be totally unbound! All too soon, the One Well-gone will be totally unbound! All too soon, the One with Eyes will disappear from the world!\"", "entities": [[37, 43, "PERSON"], [123, 131, "GPE"], [154, 162, "GPE"], [226, 232, "PERSON"], [373, 382, "PERSON"], [466, 475, "PERSON"], [615, 621, "PERSON"], [930, 941, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}
{"text": "Then the Mallans together with their sons, daughters, & wives — shocked, saddened, their minds overflowing with sorrow — went to Ven. Ananda at Upavattana, the Mallans' sal-grove near Kusinara. The thought occurred to Ven. Ananda, \"If I let the Mallans pay reverence to the Blessed One one by one, the night will be over before they have finished paying reverence. What if I were to have them pay reverence to the Blessed One arranging them family by family, announcing, 'Lord, the Mallan named so-&-so, together with his children & wives, servants & retainers, bows down with his head at the Blessed One's feet.'\" [5] So Ven. Ananda, arranging the Mallans family by family, had them pay reverence to the Blessed One, [saying,] \"Lord, the Mallan named so-&-so, together with his children & wives, servants & retainers, bows down with his head at the Blessed One's feet.\"", "entities": [[134, 140, "PERSON"], [144, 154, "GPE"], [184, 192, "GPE"], [223, 229, "PERSON"], [274, 285, "PERSON"], [414, 425, "PERSON"], [593, 604, "PERSON"], [627, 633, "PERSON"], [705, 716, "PERSON"], [850, 861, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}
{"text": "Now at that time Subhadda the Wanderer was staying in Kusinara. He heard, \"Tonight, in the last watch of the night, the total Unbinding of Gotama the contemplative will take place.\" Then the thought occurred to him: \"I have heard the elder wanderers, teachers of teachers, saying that only once in a long, long time do Tathagatas — worthy ones, rightly self-awakened — appear in the world. Tonight, in the last watch of the night, the total Unbinding of Gotama the contemplative will occur. Now there is a doubt that has arisen in me, but I have faith that he could teach me the Dhamma in such a way that I might abandon that doubt.\"", "entities": [[54, 62, "GPE"], [139, 145, "PERSON"], [454, 460, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}
{"text": "So he went to Upavattana, the Mallans' sal-grove and, on arrival, said to Ven. Ananda, \"I have heard the elder wanderers, teachers of teachers, saying that only once in a long, long time do Tathagatas — worthy ones, rightly self-awakened — appear in the world. Tonight, in the last watch of the night, the total Unbinding of Gotama the contemplative will occur. Now there is a doubt that has arisen in me, but I have faith that he could teach me the Dhamma in such a way that I might abandon that doubt. It would be good, Ven. Ananda, if you would let me see him.\"", "entities": [[14, 24, "GPE"], [79, 85, "PERSON"], [325, 331, "PERSON"], [527, 533, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}
{"text": "Then Ven. Anuruddha said to Ven. Ananda, \"Go, friend Ananda. Entering Kusinara, announce to the Kusinara Mallans, 'The Blessed One, Vasitthas, is totally unbound. Now is the time for you to do as you see fit.'\"", "entities": [[10, 19, "PERSON"], [33, 39, "PERSON"], [53, 59, "PERSON"], [70, 78, "GPE"], [96, 104, "GPE"], [119, 130, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}
{"text": "Responding, \"As you say, sir,\" Ven. Ananda in the early morning put on his robe and — carrying his bowl & outer robe — went unaccompanied into Kusinara. Now at that time the Kusinara Mallans had met for some business in their assembly hall. Ven. Ananda went to the assembly hall and on arrival announced to them, \"The Blessed One, Vasitthas, is totally unbound. Now is the time for you to do as you see fit.\"", "entities": [[36, 42, "PERSON"], [143, 151, "GPE"], [174, 182, "GPE"], [246, 252, "PERSON"], [318, 329, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}
{"text": "Then the Kusinara Mallans ordered their men, \"In that case, I say, gather scents, garlands, & all the musical instruments in Kusinara!\" Then, taking scents, garlands, & all the musical instruments in Kusinara, along with 500 lengths of cloth, the Kusinara Mallans went to the Blessed One's body in Upavattana, the Mallans' sal-grove near Kusinara. On arrival, they spent the entire day in worshipping, honoring, respecting, & venerating the Blessed One's body with dances, songs, music, garlands, & scents, in making cloth canopies and arranging floral wreaths. Then the thought occurred to them, \"It's too late today to cremate the Blessed One's body. We'll cremate the Blessed One's body tomorrow.\" And so they spent the second day, the third day, the fourth day, the fifth day, the sixth day in worshipping, honoring, respecting, & venerating the Blessed One's body with dances, songs, music, garlands, & scents, in making cloth canopies and arranging floral wreaths.", "entities": [[9, 17, "GPE"], [125, 133, "GPE"], [200, 208, "GPE"], [247, 255, "GPE"], [276, 287, "PERSON"], [298, 308, "GPE"], [338, 346, "GPE"], [441, 452, "PERSON"], [633, 644, "PERSON"], [671, 682, "PERSON"], [850, 861, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}
{"text": "Then eight leading Mallans, having bathed their heads and wearing new linen cloth, thinking, \"We'll lift up the Blessed One's body,\" were unable to lift it. So the Kusinara Mallans asked Ven. Anuruddha, \"What is the reason, Ven. Anuruddha, what is the cause, why these eight leading Mallans, having bathed their heads and wearing new linen cloth, thinking, 'We'll lift up the Blessed One's body,' are unable to lift it?\"", "entities": [[112, 123, "PERSON"], [164, 172, "GPE"], [192, 201, "PERSON"], [229, 238, "PERSON"], [376, 387, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}
{"text": "Now at that time Kusinara — even to its rubbish heaps & cesspools — was strewn knee-deep in coral-tree flowers. So the devas & the Kusinara Mallans, worshipping, honoring, respecting, & venerating the Blessed One's body with heavenly & human dances, songs, music, garlands, & scents, carried it to the north of the town, entered the town through the north gate, carried it through the middle of the town and out the east gate to the Mallans' memorial called Makuta-bandhana. There they set it down.", "entities": [[17, 25, "GPE"], [131, 139, "GPE"], [201, 212, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}
{"text": "Now at that time Ven. Maha Kassapa was traveling on the highway from Pava to Kusinara with a large community of monks, approximately 500 monks in all. Leaving the road, he sat down at the foot of a tree. Meanwhile, a certain naked ascetic, carrying a coral-tree flower from Kusinara, was traveling on the highway to Pava. Ven. Maha Kassapa saw the naked ascetic coming from afar, and on seeing him said to him, \"Do you know our teacher, friend?\"", "entities": [[77, 85, "GPE"], [274, 282, "GPE"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}
{"text": "Then four leading Mallans, having bathed their heads and wearing new linen cloth, thinking, \"We'll ignite the Blessed One's pyre,\" were unable to ignite it. So the Kusinara Mallans asked Ven. Anuruddha, \"What is the reason, Ven. Anuruddha, what is the cause, why these four leading Mallans, having bathed their heads and wearing new linen cloth, thinking, 'We'll ignite the Blessed One's pyre,' are unable to ignite it?\"", "entities": [[110, 121, "PERSON"], [164, 172, "GPE"], [192, 201, "PERSON"], [229, 238, "PERSON"], [374, 385, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}
{"text": "\"The devas' intention, Vasitthas, is, 'This Ven. Maha Kassapa is traveling on the highway from Pava to Kusinara with a large community of monks, approximately 500 monks in all. The Blessed One's pyre will not catch fire until Ven. Maha Kassapa has worshipped the Blessed One's feet with his head.'\"", "entities": [[103, 111, "GPE"], [181, 192, "PERSON"], [263, 274, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}
{"text": "So Ven . Maha Kassapa went to the Blessed One's pyre at Makuta-bandhana, the Mallans' memorial near Kusinara. On arrival, arranging his robe over one shoulder, he placed his hands palm-to-palm over his heart, circumambulated the pyre, uncovered the Blessed One's feet, [12] and worshipped them with his head. And the 500 monks, arranging their robes over one shoulder, placed their hands palm-to-palm over their hearts, circumambulated the pyre, and worshipped the Blessed One's feet with their heads. As soon as it had been worshipped by Ven. Maha Kassapa and the 500 monks, the Blessed One's pyre caught fire of its own accord. In the burning of the Blessed One's body, no cinder or ash of the outer skin, inner skin, flesh, tendons, or oil of the joints could be discerned. Only the bone-relics [13] remained. Just as in the burning of ghee or oil, no cinder or ash can be discerned; in the same way, in the burning of the Blessed One's body, no cinder or ash of the outer skin, inner skin, flesh, tendons, or oil of the joints could be discerned. Only the bone-relics remained. And of the 500 twin-wrappings only two were burnt: the innermost & the outermost.", "entities": [[34, 45, "PERSON"], [100, 108, "GPE"], [249, 260, "PERSON"], [465, 476, "PERSON"], [580, 591, "PERSON"], [652, 663, "PERSON"], [926, 937, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}
{"text": "When the Blessed One's body was consumed, a cascade of water fell from the sky, extinguishing the Blessed One's pyre. Water shot up from a sal-tree as well, extinguishing the Blessed One's pyre. The Kusinara Mallans, with all kinds of scented water, extinguished the Blessed One's pyre. Then for seven days they kept the bone-relics in their assembly hall — setting them round with a lattice of spears surrounded by ramparts of bows — worshipping, honoring, respecting, & venerating them with dances, songs, music, garlands, & scents.", "entities": [[9, 20, "PERSON"], [98, 109, "PERSON"], [175, 186, "PERSON"], [199, 207, "GPE"], [267, 278, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}
{"text": "Then King Ajatasattu Vedehiputta of Magadha heard, \"The Blessed One, they say, has been totally unbound in Kusinara.\" So he sent an envoy to the Kusinara Mallans: \"The Blessed One was a noble warrior. I, too, am a noble warrior. I deserve a share of the Blessed One's bone-relics. I, too, will build a burial mound and hold a ceremony for them.\"", "entities": [[10, 20, "PERSON"], [36, 43, "GPE"], [56, 67, "PERSON"], [107, 115, "GPE"], [145, 153, "GPE"], [168, 179, "PERSON"], [254, 265, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}
{"text": "The Licchavis of Vesali heard, \"The Blessed One, they say, has been totally unbound in Kusinara.\" So they sent an envoy to the Kusinara Mallans: \"The Blessed One was a noble warrior. We, too, are noble warriors. We deserve a share of the Blessed One's bone-relics. We, too, will build a burial mound and hold a ceremony for them.\"", "entities": [[4, 13, "NORP"], [17, 23, "GPE"], [36, 47, "PERSON"], [87, 95, "GPE"], [127, 135, "GPE"], [150, 161, "PERSON"], [238, 249, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}
{"text": "The Sakyans of Kapilavatthu heard, \"The Blessed One, they say, has been totally unbound in Kusinara.\" So they sent an envoy to the Kusinara Mallans: \"The Blessed One was the greatest of our relatives. We deserve a share of the Blessed One's bone-relics. We, too, will build a burial mound and hold a ceremony for them.\"", "entities": [[15, 27, "GPE"], [40, 51, "PERSON"], [91, 99, "GPE"], [131, 139, "GPE"], [154, 165, "PERSON"], [227, 238, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}
{"text": "The Buliyans of Allakappa ... The Koliyans of Ramagama heard, \"The Blessed One, they say, has been totally unbound in Kusinara.\" So they sent an envoy to the Kusinara Mallans: \"The Blessed One was a noble warrior. We, too, are noble warriors. We deserve a share of the Blessed One's bone-relics. We, too, will build a burial mound and hold a ceremony for them.\"", "entities": [[67, 78, "PERSON"], [118, 126, "GPE"], [158, 166, "GPE"], [181, 192, "PERSON"], [269, 280, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}
{"text": "The Brahman of Vetha Island heard, \"The Blessed One, they say, has been totally unbound in Kusinara.\" So he sent an envoy to the Kusinara Mallans: \"The Blessed One was a noble warrior. I am a brahman. I deserve a share of the Blessed One's bone-relics. I, too, will build a burial mound and hold a ceremony for them.\"", "entities": [[40, 51, "PERSON"], [91, 99, "GPE"], [129, 137, "GPE"], [152, 163, "PERSON"], [226, 237, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}
{"text": "The Pava Mallans heard, \"The Blessed One, they say, has been totally unbound in Kusinara.\" So they sent an envoy to the Kusinara Mallans: \"The Blessed One was a noble warrior. We, too, are noble warriors. We deserve a share of the Blessed One's bone-relics. We, too, will build a burial mound and hold a ceremony for them.\"", "entities": [[29, 40, "PERSON"], [80, 88, "GPE"], [120, 128, "GPE"], [143, 154, "PERSON"], [231, 242, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}
{"text": "When this was said, the Kusinara Mallans said to the groups & factions, \"The Blessed One was totally unbound within the borders of our own town. We will not give up a share of the Blessed One's bone-relics.\"", "entities": [[24, 32, "GPE"], [77, 88, "PERSON"], [180, 191, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}
{"text": "Then the Moriyans of Pipphalivana heard, \"The Blessed One, they say, has been totally unbound in Kusinara.\" So they sent an envoy to the Kusinara Mallans: \"The Blessed One was a noble warrior. We, too, are noble warriors. We deserve a share of the Blessed One's bone-relics. We, too, will build a burial mound and hold a ceremony for them.\"", "entities": [[46, 57, "PERSON"], [97, 105, "GPE"], [137, 145, "GPE"], [160, 171, "PERSON"], [248, 259, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was dwelling among the Sakyans at Kapilavatthu in the Great Wood, together with a large Sangha of approximately five hundred bhikkhus, all of them arahants. And most of the devatas from ten world-systems had gathered in order to see the Blessed One and the Bhikkhu Sangha. Then the thought occurred to four devatas of the ranks from the Pure Abodes: \"The Blessed One is dwelling among the Sakyans at Kapilavatthu in the Great Wood, together with a large Sangha of about five hundred bhikkhus, all of them arahants. And most of the devatas from ten world-systems have gathered in order to see the Blessed One and the Bhikkhu Sangha. Let us also approach the Blessed One and, on arrival, let us each speak a verse in his presence.\"", "entities": [[38, 49, "PERSON"], [84, 96, "GPE"], [287, 298, "PERSON"], [405, 416, "PERSON"], [450, 462, "GPE"], [646, 657, "PERSON"], [707, 718, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.20.0.than.html", "title": "Maha-samaya Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi at Jeta's Grove, Anathapindika 's monastery. Then Janussonin the brahman went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to the Blessed One, \"Master Gotama, the sons of good families who have gone forth from the home life into homelessness out of conviction in Master Gotama: is Master Gotama their leader? Is Master Gotama their helper? Is Master Gotama their inspirer? Do they take Master Gotama as their example?\"", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [79, 91, "LOC"], [93, 106, "PERSON"], [161, 172, "PERSON"], [344, 355, "PERSON"], [365, 371, "PERSON"], [484, 490, "PERSON"], [502, 508, "PERSON"], [533, 539, "PERSON"], [564, 570, "PERSON"], [607, 613, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.004.than.html", "title": "Bhaya-bherava Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi at Jeta's Grove, Anathapindika's monastery. Then, early in the morning, several monks put on their robes and, carrying their bowls and outer robes, went into Savatthi for alms. The thought occurred to them, \"It's still too early to go into Savatthi for alms. What if we were to visit the park of the wanderers of other persuasions?\"", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [79, 91, "LOC"], [93, 106, "PERSON"], [234, 242, "GPE"], [316, 324, "GPE"]], "meta": {"nikaya": "MN", "identifier": "mn.013.than.html", "title": "Maha-dukkhakkhandha Sutta", "para_seq": null}}
{"text": "Then, having gone for alms in Savatthi, after their meal, returning from their alms round, the monks went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As they were sitting there, they [told him what had happened].", "entities": [[30, 38, "GPE"], [113, 124, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.013.than.html", "title": "Maha-dukkhakkhandha Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying among the Sakyans at Kapilavatthu in the Banyan Park. Then Mahanama the Sakyan [1] went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the Blessed One, \"For a long time now, lord, I have understood the Dhamma taught by the Blessed One thus: 'Greed is a defilement of the mind; aversion is a defilement of the mind; delusion is a defilement of the mind.' Yet even though I understand the Dhamma taught by the Blessed One that greed is a defilement of the mind, aversion is a defilement of the mind, delusion is a defilement of the mind, there are still times when the mental quality of greed invades my mind and remains, when the mental quality of aversion... the mental quality of delusion invades my mind and remains. The thought occurs to me: What mental quality is unabandoned within me so that there are times when the mental quality of greed invades my mind and remains, when the mental quality of aversion... the mental quality of delusion invades my mind and remains?\"", "entities": [[38, 49, "PERSON"], [83, 95, "GPE"], [157, 168, "PERSON"], [268, 279, "PERSON"], [352, 363, "PERSON"], [537, 548, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.014.than.html", "title": "Cula-dukkhakkhandha Sutta", "para_seq": null}}
{"text": "\"Once, Mahanama, when I was staying near Rajagaha on Vulture Peak Mountain, a number of Niganthas were at Black Rock on the slopes of Isigili , practicing continuous standing: rejecting seats, experiencing fierce, sharp, racking pains due to exertion. So in the evening, rising from seclusion, I went to the Niganthas at Black Rock on the slopes of Isigili and on arrival asked them, 'Why are you practicing continuous standing: rejecting seats, experiencing fierce, sharp, racking pains due to exertion?' When this was said, the Niganthas said to me, 'Friend, the Nigantha Nataputta [5] is all-knowing, all-seeing, and claims total knowledge & vision thus: \"Whether I am walking or standing, sleeping or awake, knowledge & vision are continuously & continually established in me.\" He has told us, \"Niganthas, there are evil actions that you have done in the past. Exhaust them with these painful austerities. When in the present you are restrained in body, restrained in speech, and restrained in mind, that is the non-doing of evil action for the future. Thus, with the destruction of old actions through asceticism, and with the non-doing of new actions, there will be no flow into the future. With no flow into the future, there is the ending of action. With the ending of action, the ending of stress. With the ending of stress, the ending of feeling. With the ending of feeling, all suffering & stress will be exhausted.\" [6] We approve of that [teaching], prefer it, and are gratified by it.'", "entities": [[41, 49, "GPE"], [565, 583, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.014.than.html", "title": "Cula-dukkhakkhandha Sutta", "para_seq": null}}
{"text": "\"'But, friend Gotama, it's not the case that pleasure is to be attained through pleasure. Pleasure is to be attained through pain. For if pleasure were to be attained through pleasure, then King Seniya Bimbisara of Magadha would attain pleasure, for he lives in greater pleasure than you, friend Gotama.'", "entities": [[14, 20, "PERSON"], [190, 211, "PERSON"], [215, 222, "GPE"], [296, 302, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.014.than.html", "title": "Cula-dukkhakkhandha Sutta", "para_seq": null}}
{"text": "\"'Yes, friend Gotama, we said that rashly and without reflecting... but let that be. We now ask you, venerable Gotama: Who lives in greater pleasure: King Seniya Bimbisara of Magadha or venerable Gotama?'", "entities": [[14, 20, "PERSON"], [111, 117, "PERSON"], [150, 171, "PERSON"], [175, 182, "GPE"], [196, 202, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.014.than.html", "title": "Cula-dukkhakkhandha Sutta", "para_seq": null}}
{"text": "\"'In that case, Niganthas, I will question you in return. Answer as you like. What do you think: Can King Seniya Bimbisara of Magadha — without moving his body, without uttering a word — dwell sensitive to unalloyed pleasure for seven days & nights?'", "entities": [[101, 122, "PERSON"], [126, 133, "GPE"]], "meta": {"nikaya": "MN", "identifier": "mn.014.than.html", "title": "Cula-dukkhakkhandha Sutta", "para_seq": null}}
{"text": "\"'Now, I — without moving my body, without uttering a word — can dwell sensitive to unalloyed pleasure for a day and a night... for two days & nights... for three... four... five... six... seven days & nights. So what do you think: That being the case, who dwells in greater pleasure: King Seniya Bimbisara of Magadha or me?'", "entities": [[285, 306, "PERSON"], [310, 317, "GPE"]], "meta": {"nikaya": "MN", "identifier": "mn.014.than.html", "title": "Cula-dukkhakkhandha Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was living among the Sakyans near Kapilavatthu in the Banyan Park. Then in the early morning, having put on his robes and carrying his bowl & outer robe, he went into Kapilavatthu for alms. Having gone for alms in Kapilavatthu, after the meal, returning from his alms round, he went to the Great Wood for the day's abiding. Plunging into the Great Wood, he sat down at the root of a bilva sapling for the day's abiding.", "entities": [[38, 49, "PERSON"], [84, 96, "GPE"], [217, 229, "GPE"], [264, 276, "GPE"]], "meta": {"nikaya": "MN", "identifier": "mn.018.than.html", "title": "Madhupindika Sutta", "para_seq": null}}
{"text": "\"Once, monks, in this same Savatthi , there was a lady of a household named Vedehika . This good report about Lady Vedehika had circulated: 'Lady Vedehika is gentle. Lady Vedehika is even-tempered. Lady Vedehika is calm.' Now, Lady Vedehika had a slave named Kali who was diligent, deft, & neat in her work. The thought occurred to Kali the slave: 'This good report about my Lady Vedehika has circulated: \"Lady Vedehika is even-tempered. Lady Vedehika is gentle. Lady Vedehika is calm.\" Now, is anger present in my lady without showing, or is it absent? Or is it just because my work is neat that the anger present in my lady doesn't show? Why don't I test her?'", "entities": [[27, 35, "GPE"]], "meta": {"nikaya": "MN", "identifier": "mn.021x.than.html", "title": "Kakacupama Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying in Savatthi , at Jeta's Grove, Anathapindika's park . Now on that occasion this pernicious viewpoint (ditthigata) had arisen in the monk Arittha Formerly-of-the-Vulture-Killers : \"As I understand the Dhamma taught by the Blessed One, those acts the Blessed One says are obstructive, when indulged in, are not genuine obstructions.\" A large number of monks heard, \"They say that this pernicious viewpoint has arisen in the monk Arittha Formerly-of-the-Vulture-Killers: 'As I understand the Dhamma taught by the Blessed One, those acts the Blessed One says are obstructive, when indulged in, are not genuine obstructions.'\" So they went to the monk Arittha Formerly-of-the-Vulture-Killers and on arrival said to him, \"Is it true, friend Arittha, that this pernicious viewpoint has arisen in you — 'As I understand the Dhamma taught by the Blessed One, those acts the Blessed One says are obstructive, when indulged in, are not genuine obstructions'?\"", "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [79, 91, "LOC"], [93, 106, "PERSON"], [283, 294, "PERSON"], [311, 322, "PERSON"], [572, 583, "PERSON"], [600, 611, "PERSON"], [899, 910, "PERSON"], [927, 938, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.022.than.html", "title": "Alagaddupama Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Rajagaha in the Bamboo Grove, the Squirrels' Sanctuary. Then a number of monks from the [Blessed One's] native land, having completed the Rains Retreat in the native land, went to the Blessed One and, on arrival, having bowed down to him, sat to one side.", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [83, 95, "LOC"], [101, 121, "LOC"], [156, 167, "PERSON"], [251, 262, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.024.than.html", "title": "Ratha-vinita Sutta", "para_seq": null}}
{"text": "Then the Blessed One, having stayed at Rajagaha as long as he liked, set out wandering to Savatthi . Wandering by stages, he arrived there and stayed in Jeta's Grove, Anathapindika's monastery . Ven. Punna Mantaniputta heard, \"The Blessed One has arrived at Savatthi and is staying near Savatthi in Jeta's Grove, Anathapindika's monastery.\" Setting his lodgings in order and taking his robes & bowl, he set out wandering to Savatthi. Wandering by stages, he went to where the Blessed One was staying in Jeta's Grove, Anathapindika's monastery. On arrival, having bowed down to the Blessed One, he sat to one side. As he was sitting there, the Blessed One instructed, urged, roused, & encouraged him with a Dhamma talk. Then Ven. Punna — instructed, urged, roused, & encouraged with the Blessed One's Dhamma talk; delighting & approving of the Blessed One's words — got up from his seat, bowed down to the Blessed One, circumambulated him, and went to the Grove of the Blind for the day's abiding.", "entities": [[9, 20, "PERSON"], [39, 47, "GPE"], [90, 98, "GPE"], [153, 165, "LOC"], [167, 180, "PERSON"], [200, 218, "PERSON"], [231, 242, "PERSON"], [258, 266, "GPE"], [287, 295, "GPE"], [299, 311, "LOC"], [313, 326, "PERSON"], [424, 432, "GPE"], [476, 487, "PERSON"], [503, 515, "LOC"], [517, 530, "PERSON"], [581, 592, "PERSON"], [643, 654, "PERSON"], [786, 797, "PERSON"], [843, 854, "PERSON"], [905, 916, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.024.than.html", "title": "Ratha-vinita Sutta", "para_seq": null}}
{"text": "\"So, my friend, I will give you an analogy, for there are cases where it's through analogies that knowledgeable people can understand the meaning of what is being said. Suppose that while King Pasenadi Kosala was staying at Savatthi, some urgent business were to arise at Saketa ; and that between Savatthi and Saketa seven relay chariots were made ready for him. Coming out the door of the inner palace in Savatthi, he would get in the first relay chariot. By means of the first relay chariot he would reach the second relay chariot. Getting out of the first relay chariot he would get in the second relay chariot. By means of the second relay chariot he would reach the third... by means of the third he would reach the fourth... by means of the fourth, the fifth... by means of the fifth, the sixth... by means of the sixth he would reach the seventh relay chariot. Getting out of the sixth relay chariot he would get in the seventh relay chariot. By means of the seventh relay chariot he would finally arrive at the door of the inner palace at Saketa. As he arrived there, his friends & companions, relatives & kin would ask him, 'Great king, did you come from Savatthi to the door of the inner palace in Saketa by means of this chariot?' Answering in what way, my friend, would King Pasenadi Kosala answer them correctly?\"", "entities": [[188, 208, "PERSON"], [224, 232, "GPE"], [272, 278, "GPE"], [298, 306, "GPE"], [311, 317, "GPE"], [407, 415, "GPE"], [1048, 1054, "GPE"], [1165, 1173, "GPE"], [1209, 1215, "GPE"], [1283, 1303, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.024.than.html", "title": "Ratha-vinita Sutta", "para_seq": null}}
{"text": "\"Answering in this way, my friend, he would answer them correctly: 'Just now, as I was staying at Savatthi, some urgent business arose at Saketa; and between Savatthi and Saketa seven relay chariots were made ready for me. Coming out the door of the inner palace in Savatthi, I got in the first relay chariot. By means of the first relay chariot I reached the second relay chariot. Getting out of the first relay chariot I got in the second relay chariot. By means of the second relay chariot I reached the third... by means of the third I reached the fourth... by means of the fourth, the fifth... by means of the fifth, the sixth... by means of the sixth I reached the seventh relay chariot. Getting out of the sixth relay chariot I got in the seventh relay chariot. By means of the seventh relay chariot I finally arrived at the door of the inner palace at Saketa.' Answering in this way, he would answer them correctly.\"", "entities": [[98, 106, "GPE"], [138, 144, "GPE"], [158, 166, "GPE"], [171, 177, "GPE"], [266, 274, "GPE"], [860, 866, "GPE"]], "meta": {"nikaya": "MN", "identifier": "mn.024.than.html", "title": "Ratha-vinita Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying at Savatthi , in Jeta's Grove, Anathapindika's monastery . Then early in the morning, having put on his robes and carrying his bowl & outer robe, he went into Savatthi for alms. Then a large number of monks went to Ven. Ananda and said, \"It has been a long time, friend Ananda, since we have heard a Dhamma talk in the Blessed One's presence. It would be good if we could get to hear a Dhamma talk in the Blessed One's presence.\"", "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [79, 91, "LOC"], [93, 106, "PERSON"], [221, 229, "GPE"], [282, 288, "PERSON"], [332, 338, "PERSON"], [381, 392, "PERSON"], [467, 478, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.026.than.html", "title": "Ariyapariyesana Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery. Now at that time, Janussonin the brahman was driving out of Savatthi in the middle of the day in a totally white roofed-chariot. [1] He saw Pilotika the wanderer coming from afar and, on seeing him, said to him, \"Now where is Master Vacchayana [2] coming from in the middle of the day?\"", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [79, 91, "LOC"], [93, 106, "PERSON"], [180, 188, "GPE"]], "meta": {"nikaya": "MN", "identifier": "mn.027.than.html", "title": "Cula-hatthipadopama Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Sāvatthī in Jeta's Grove, Anāthapiṇḍika's monastery. Then Piṅgalakoccha the brahman went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there, he said to the Blessed One, \"Master Gotama, these contemplatives & brahmans, each with his group, each with his community, each the teacher of his group, an honored leader, well-regarded by people at large — i.e., Pūraṇa Kassapa , Makkhali Gosāla , Ajita Kesakambalin , Pakudha Kaccāyana , Sañjaya Velaṭṭhaputta , & the Nigaṇṭha Nāṭaputta : Do they all have direct knowledge as they themselves claim, or do they all not have direct knowledge, or do some of them have direct knowledge and some of them not?\"", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [79, 91, "LOC"], [163, 174, "PERSON"], [275, 286, "PERSON"], [296, 302, "PERSON"], [491, 506, "PERSON"], [509, 527, "PERSON"], [530, 547, "PERSON"], [550, 571, "PERSON"], [580, 598, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.030.than.html", "title": "Cula Saropama Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Vesālī , at the Gabled Hall in the Great Forest. And on that occasion Saccaka the Nigaṇṭha-son was dwelling in Vesālī — a debater, a sophist, [1] well-regarded by people at large. He made this statement before the assembly in Vesālī: \"I see no contemplative or brahman, the head of an order, the head of a group, or even one who claims to be an arahant, rightly self-awakened, who — engaged in debate with me — would not shiver, quiver, shake, & break out in sweat under the armpits. Even if I were to engage a senseless stump in debate, it — engaged with me in debate — would shiver, quiver, & shake, to say nothing of a human being.\"", "entities": [[38, 49, "PERSON"], [67, 73, "GPE"], [137, 161, "PERSON"], [178, 184, "GPE"], [293, 299, "GPE"]], "meta": {"nikaya": "MN", "identifier": "mn.035.than.html", "title": "Cula-Saccaka Sutta", "para_seq": null}}
{"text": "Then early in the morning Ven. Assaji [2] adjusted his under robe and — carrying his bowl & robes — went into Vesālī for alms. Saccaka the Nigaṇṭha-son, walking & wandering around Vesālī to exercise his legs, saw Ven. Assaji coming from afar. On seeing him, he went up to him and exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he stood to one side. As he was standing there, he said to him, \"Master Assaji, how does Gotama the contemplative discipline his disciples? Or what part of his instruction is generally presented to his disciples?\"", "entities": [[110, 116, "GPE"], [127, 151, "PERSON"], [180, 186, "GPE"], [463, 469, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.035.than.html", "title": "Cula-Saccaka Sutta", "para_seq": null}}
{"text": "\"Very well then, Aggivessana, I will cross-question you on this matter. Answer as you see fit. What do you think? Would a consecrated, noble-warrior king — such as King Pasenadi of Kosala or King Ajātasattu Vedehiputta of Magadha — wield the power in his own domain to execute those who deserve execution, to fine those who deserve to be fined, and to banish those who deserve to be banished?\"", "entities": [[17, 28, "PERSON"], [164, 177, "PERSON"], [181, 187, "GPE"], [222, 229, "GPE"]], "meta": {"nikaya": "MN", "identifier": "mn.035.than.html", "title": "Cula-Saccaka Sutta", "para_seq": null}}
{"text": "\"Yes, Master Gotama, he would wield the power in his own domain to execute those who deserve execution, to fine those who deserve to be fined, and to banish those who deserve to be banished. Even these oligarchic groups, such as the Vajjians & Mallans, wield the power in their own domains to execute those who deserve execution, to fine those who deserve to be fined, and to banish those who deserve to be banished, [5] to say nothing of a consecrated, noble-warrior king such as King Pasenadi of Kosala, or King Ajātasattu Vedehiputta of Magadha. He would wield it, and he would deserve to wield it.\"", "entities": [[13, 19, "PERSON"], [481, 494, "PERSON"], [498, 504, "GPE"], [540, 547, "GPE"]], "meta": {"nikaya": "MN", "identifier": "mn.035.than.html", "title": "Cula-Saccaka Sutta", "para_seq": null}}
{"text": "\"Suppose a man — in need of heartwood, seeking heartwood, wandering in search of heartwood — were to enter a forest taking a sharp ax. There he would see a large plantain trunk: straight, young, immature. He would cut it at the root and, having cut it at the root, cut off the crown. Having cut off the crown, he would unfurl the leaf sheaths. Unfurling the leaf sheaths, he wouldn't even find sapwood there, to say nothing of heartwood. In the same way, Aggivessana, when you are interrogated, rebuked, & pressed by me with regard to your own statement, you are empty, void, mistaken. But it was you who made this statement before the assembly in Vesālī: 'I see no contemplative or brahman, the head of an order, the head of a group, or even one who claims to be an arahant, rightly self-awakened, who — engaged in debate with me — would not shiver, quiver, shake, & break out in sweat under the armpits. Even if I were to engage a senseless stump in debate, it — engaged with me in debate — would shiver, quiver, & shake, to say nothing of a human being.' But now some drops of sweat coming out of your forehead, drenching your upper robe, are landing on the ground, whereas now I have no sweat on my body.\" And the Blessed One uncovered his golden-colored body to the assembly. When this was said, Saccaka the Nigaṇṭha-son fell silent, abashed, sitting with his shoulders drooping, his head down, brooding, at a loss for words.", "entities": [[455, 466, "PERSON"], [648, 654, "GPE"], [1218, 1229, "PERSON"], [1301, 1325, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.035.than.html", "title": "Cula-Saccaka Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying in Vesali , at the Gabled Hall in the Great Forest. And on that occasion he had finished dressing in the morning and was carrying his bowl and outer robe, planning to enter Vesali for alms.", "entities": [[38, 49, "PERSON"], [65, 71, "GPE"], [235, 241, "GPE"]], "meta": {"nikaya": "MN", "identifier": "mn.036.than.html", "title": "Maha-Saccaka Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying in Sāvatthī , at Jeta's Grove, Anāthapiṇḍika's park. Now on that occasion this pernicious viewpoint (diṭṭhigata) had arisen in the monk Sāti the Fisherman's Son: \"As I understand the Dhamma taught by the Blessed One, it is just this consciousness that runs and wanders on [from birth to birth], not another.\" A large number of monks heard, \"They say that this pernicious viewpoint has arisen in the monk Sāti the Fisherman's Son: 'As I understand the Dhamma taught by the Blessed One, it is just this consciousness that runs and wanders on [from birth to birth], not another.'\" So they went to the monk Sāti the Fisherman's Son and on arrival said to him, \"Is it true, friend Sāti, that this pernicious viewpoint has arisen in you — 'As I understand the Dhamma taught by the Blessed One, it is just this consciousness that runs and wanders on, not another'?\"", "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [79, 91, "LOC"], [198, 222, "PERSON"], [266, 277, "PERSON"], [466, 490, "PERSON"], [534, 545, "PERSON"], [665, 689, "PERSON"], [837, 848, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.038.than.html", "title": "Mahatanhasankhaya Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying at Savatthi , in Jeta's Grove, Anathapindika's Monastery . Then Ven. Maha Kotthita , arising from his seclusion in the late afternoon, went to Ven. Sariputta and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side.", "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [79, 91, "LOC"], [93, 118, "LOC"], [205, 219, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.043.than.html", "title": "Mahavedalla Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Rajagaha in the Bamboo Grove, the Squirrels' Sanctuary. Then Visakha the lay follower went to Dhammadinna the nun and, on arrival, having bowed down to her, sat to one side. As he was sitting there he said to her, \"'Self-identification, self-identification,' it is said, lady. Which self-identification is described by the Blessed One?\"", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [83, 95, "LOC"], [101, 121, "LOC"], [128, 135, "PERSON"], [161, 172, "PERSON"], [390, 401, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.044.than.html", "title": "Culavedalla Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion Ven. Ananda was staying near Vesali at Veluvagamaka. Now on that occasion Dasama the householder from Atthakanagara had arrived at Pataliputta on some business. Then he went to a certain monk at Kukkata Monastery and on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the monk, \"Where is Ven. Ananda staying now? I'd like to see him.\"", "entities": [[39, 45, "PERSON"], [63, 69, "GPE"], [366, 372, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.052.than.html", "title": "Atthakanagara Sutta", "para_seq": null}}
{"text": "Then Dasama the householder from Atthakanagara, on completing his business at Pataliputta, went to Ven. Ananda at Veluvagamaka near Vesali. On arrival, having bowed down to him, he sat to one side. As he was sitting there, he said to Ven. Ananda: \"Venerable sir, is there a single quality declared by the Blessed One — the one who knows, the one who sees, worthy & rightly self-awakened — where the unreleased mind of a monk who dwells there heedful, ardent, & resolute becomes released, or his unended fermentations go to their total ending, or he attains the unexcelled security from the yoke that he had not attained before?\"", "entities": [[104, 110, "PERSON"], [132, 138, "GPE"], [239, 245, "PERSON"], [305, 316, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.052.than.html", "title": "Atthakanagara Sutta", "para_seq": null}}
{"text": "So Dasama the householder from Atthakanagara, having assembled the community of monks from Vesali and Pataliputta, with his own hands served & satisfied them with refined staple & non-staple foods. He presented a pair of cloths to each monk, and a triple robe to Ven. Ananda. And, for Ven. Ananda, he had a dwelling built worth five hundred [kahapanas].", "entities": [[91, 97, "GPE"], [268, 274, "PERSON"], [290, 296, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.052.than.html", "title": "Atthakanagara Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying among the Sakyans at Kapilavatthu in the Banyan Park. Now at that time a new reception hall [1] had just been built by the Kapilavatthu Sakyans, and it had not yet been dwelled in by any contemplative, brahman, or anyone at all in human form. So the Kapilavatthu Sakyans went to the Blessed One and, on arrival, having bowed down, sat to one side. As they were sitting there they said to him, \"Lord, a new reception hall has just been built by the Kapilavatthu Sakyans, and it has not yet been dwelled in by any contemplative, brahman, or anyone at all in human form. May the Blessed One be the first to use it. When the Blessed One has used it first, the Kapilavatthu Sakyans will use it afterwards. That will be for their long-term welfare & happiness.\"", "entities": [[38, 49, "PERSON"], [83, 95, "GPE"], [185, 197, "GPE"], [312, 324, "GPE"], [345, 356, "PERSON"], [510, 522, "GPE"], [638, 649, "PERSON"], [683, 694, "PERSON"], [718, 730, "GPE"]], "meta": {"nikaya": "MN", "identifier": "mn.053.than.html", "title": "Sekha-patipada Sutta", "para_seq": null}}
{"text": "The Blessed One acquiesced with silence. Sensing his acquiescence, the Kapilavatthu Sakyans got up from their seats, bowed down to him, circumambulated him, and then went to the new reception hall. On arrival, they spread it all over with felt rugs, arranged seats, set out a water vessel, and raised an oil lamp. Then they went to the Blessed One and, on arrival, having bowed down, stood to one side. As they were standing there they said to him, \"Lord, the reception hall has been covered all over with felt rugs, seats have been arranged, a water vessel has been set out, and an oil lamp raised. It is now time for the Blessed One to do as he sees fit.\"", "entities": [[4, 15, "PERSON"], [71, 83, "GPE"], [336, 347, "PERSON"], [623, 634, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.053.than.html", "title": "Sekha-patipada Sutta", "para_seq": null}}
{"text": "So the Blessed One, putting on his robe and taking up his bowl & outer robe, went together with a community of monks to the reception hall. On arrival he washed his feet, entered the hall, and sat with his back to the central post, facing east. The community of monks washed their feet, entered the hall, and sat with their backs to the western wall, facing east, ranged around the Blessed One. The Kapilavatthu Sakyans washed their feet, entered the hall, and sat with their backs to the eastern wall, facing west, ranged around the Blessed One. Then the Blessed One — having spent most of the night instructing, urging, rousing, & encouraging the Kapilavatthu Sakyans with a Dhamma talk — said to Ven. Ananda , \"Ananda, speak to the Kapilavatthu Sakyans about the person who follows the practice for one in training. [2] My back aches. I will rest it.\"", "entities": [[7, 18, "PERSON"], [382, 393, "PERSON"], [399, 411, "GPE"], [534, 545, "PERSON"], [556, 567, "PERSON"], [649, 661, "GPE"], [704, 710, "PERSON"], [714, 720, "PERSON"], [735, 747, "GPE"]], "meta": {"nikaya": "MN", "identifier": "mn.053.than.html", "title": "Sekha-patipada Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying at Savatthi , in Jeta's Grove, Anathapindika's Monastery . Then the Blessed One, early in the morning, put on his robes and, carrying his bowl and outer robe, went into Savatthi for alms. And Ven. Rahula, early in the morning, put on his robes and, carrying his bowl and outer robe, went into Savatthi for alms following right behind the Blessed One. [1] Then the Blessed One, looking back at Rahula, addressed him: \"Rahula, any form whatsoever that is past, future, or present; internal or external; blatant or subtle; common or sublime; far or near: every form is to be seen as it actually is with right discernment as: 'This is not mine. This is not my self. This is not what I am.'\"", "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [79, 91, "LOC"], [93, 118, "LOC"], [130, 141, "PERSON"], [231, 239, "GPE"], [259, 265, "PERSON"], [355, 363, "GPE"], [400, 411, "PERSON"], [426, 437, "PERSON"], [455, 461, "PERSON"], [479, 485, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.062.than.html", "title": "Maha-Rahulovada Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi at Jeta's Grove, Anathapindika 's monastery. Then, as Ven. Malunkyaputta was alone in seclusion, this train of thought arose in his awareness: \" These positions that are undeclared, set aside, discarded by the Blessed One — 'The cosmos is eternal,' 'The cosmos is not eternal,' 'The cosmos is finite,' 'The cosmos is infinite,' 'The soul & the body are the same,' 'The soul is one thing and the body another,' 'After death a Tathagata exists,' 'After death a Tathagata does not exist,' 'After death a Tathagata both exists & does not exist,' 'After death a Tathagata neither exists nor does not exist' — I don't approve, I don't accept that the Blessed One has not declared them to me. I'll go ask the Blessed One about this matter. If he declares to me that 'The cosmos is eternal,' that 'The cosmos is not eternal,' that 'The cosmos is finite,' that 'The cosmos is infinite,' that 'The soul & the body are the same,' that 'The soul is one thing and the body another,' that 'After death a Tathagata exists,' that 'After death a Tathagata does not exist,' that 'After death a Tathagata both exists & does not exist,' or that 'After death a Tathagata neither exists nor does not exist,' then I will live the holy life under him. If he does not declare to me that 'The cosmos is eternal,'... or that 'After death a Tathagata neither exists nor does not exist,' then I will renounce the training and return to the lower life.\"", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [79, 91, "LOC"], [93, 106, "PERSON"], [286, 297, "PERSON"], [501, 510, "PERSON"], [535, 544, "PERSON"], [577, 586, "PERSON"], [633, 642, "PERSON"], [721, 732, "PERSON"], [778, 789, "PERSON"], [1066, 1075, "PERSON"], [1105, 1114, "PERSON"], [1152, 1161, "PERSON"], [1216, 1225, "PERSON"], [1389, 1398, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.063.than.html", "title": "Cula-Malunkyovada Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was wandering on a tour of Kasi with a large community of monks. There he addressed the monks: \"I abstain from the night-time meal. [1] As I am abstaining from the night-time meal, I sense next-to-no illness, next-to-no affliction, lightness, strength, & a comfortable abiding. Come now. You too abstain from the night-time meal. As you are abstaining from the night-time meal, you, too, will sense next-to-no illness, next-to-no affliction, lightness, strength, & a comfortable abiding.\"", "entities": [[38, 49, "PERSON"], [77, 81, "GPE"]], "meta": {"nikaya": "MN", "identifier": "mn.070.than.html", "title": "Kitagiri Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying in Savatthi , at Jeta's Grove, Anathapindika's monastery . Then the wanderer Vacchagotta went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there he asked the Blessed One: \"How is it, Master Gotama, does Master Gotama hold the view: 'The cosmos is eternal: only this is true, anything otherwise is worthless'?\"", "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [79, 91, "LOC"], [93, 106, "PERSON"], [163, 174, "PERSON"], [343, 354, "PERSON"], [375, 381, "PERSON"], [395, 401, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.072.than.html", "title": "Aggi-Vacchagotta Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Rajagaha on Vulture's Peak Mountain, in the Boar's Cave. Then LongNails the wanderer [1] went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he stood to one side. As he was standing there, he said to the Blessed One, \"Master Gotama, I am of the view, of the opinion, that 'All is not pleasing to me.'\"", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [168, 179, "PERSON"], [354, 365, "PERSON"], [375, 381, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.074.than.html", "title": "Dighanaka Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery. Now on that occasion Uggahamana , a follower of Mundika the contemplative, [1] together with a large following of about 500 wanderers, had taken up residence in the debating hall near the Tinduka tree in the single-pavilion park of Queen Mallika . Then Pañcakanga the carpenter left Savatthi in the middle of the day to see the Blessed One, but the thought occurred to him, \"Now is not the right time to see the Blessed One, for he is in seclusion. And it is not the right time to see the mind-developing monks, for they too are in seclusion. Why don't I go to the debating hall near the Tinduka tree in the single-pavilion park of Queen Mallika to see Uggahamana, a follower of Mundika the contemplative?\" So he headed to the debating hall near the Tinduka tree in the single-pavilion park of Queen Mallika.", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [79, 91, "LOC"], [93, 106, "PERSON"], [352, 365, "PERSON"], [403, 411, "GPE"], [448, 459, "PERSON"], [532, 543, "PERSON"], [752, 765, "PERSON"], [914, 927, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.078.than.html", "title": "Samana-Mundika Sutta", "para_seq": null}}
{"text": "Now on that occasion Uggahamana was sitting with his large following of wanderers, all making a great noise & racket, discussing many kinds of bestial topics of conversation: conversation about kings, robbers, & ministers of state; armies, alarms, & battles; food & drink; clothing, furniture, garlands, & scents; relatives; vehicles; villages, towns, cities, the countryside; women & heroes; the gossip of the street & the well; tales of the dead; tales of diversity, the creation of the world & of the sea; talk of whether things exist or not. Then Uggahamana saw Pañcakanga the carpenter coming from afar, and on seeing him, hushed his following: \"Be quiet, good sirs. Don't make any noise. Here comes Pañcakanga the carpenter, a disciple of Gotama the contemplative. He is one of those disciples of Gotama the contemplative, clad in white, who lives in Savatthi. These people are fond of quietude, trained in quietude, and speak in praise of quietude. Maybe, if he perceives our group as quiet, he will consider it worth his while to come our way.\" So the wanderers fell silent.", "entities": [[745, 751, "PERSON"], [803, 809, "PERSON"], [857, 865, "GPE"]], "meta": {"nikaya": "MN", "identifier": "mn.078.than.html", "title": "Samana-Mundika Sutta", "para_seq": null}}
{"text": "Then Ratthapala the clansman obtained the going-forth in the Blessed One's presence, he obtained admission. And not long after his admission, one half month after his admission, the Blessed One–having stayed at Thullakotthita as long as he liked — set out wandering to Savatthi. Wandering by stages, he eventually arrived at Savatthi. There he lived at Savatthi in Jeta's Grove, Anathapindika's monastery.", "entities": [[61, 72, "PERSON"], [182, 193, "PERSON"], [269, 277, "GPE"], [325, 333, "GPE"], [353, 361, "GPE"], [365, 377, "LOC"], [379, 392, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.082.than.html", "title": "Ratthapala Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi at Jeta's Grove, Anathapindika's monastery. And at that time in King Pasenadi's realm there was a bandit named Angulimala: brutal, bloody-handed, devoted to killing & slaying, showing no mercy to living beings. He turned villages into non-villages, towns into non-towns, settled countryside into unsettled countryside. Having repeatedly killed human beings, he wore a garland (mala) made of fingers (anguli).", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [79, 91, "LOC"], [93, 106, "PERSON"], [140, 153, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.086.than.html", "title": "Angulimala Sutta", "para_seq": null}}
{"text": "Then the Blessed One, early in the morning, having put on his robes and carrying his outer robe & bowl, went into Savatthi for alms. Having wandered for alms in Savatthi and returning from his alms round after his meal, he set his lodging in order. Carrying his robes & bowl, he went along the road to where Angulimala was staying. Cowherds, shepherds, & farmers saw him going along the road to where Angulimala was staying, and on seeing him said to him, \"Don't go along that road, contemplative, for on that road is Angulimala: brutal, bloody-handed, devoted to killing & slaying, showing no mercy to living beings. He has turned villages into non-villages, towns into non-towns, settled countryside into unsettled countryside. Having repeatedly killed human beings, he wears a garland made of fingers. Groups of ten, twenty, thirty, & forty men have gone along that road, and even they have fallen into Angulimala's hands.\" When this was said, the Blessed One kept going in silence.", "entities": [[9, 20, "PERSON"], [114, 122, "GPE"], [161, 169, "GPE"], [951, 962, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.086.than.html", "title": "Angulimala Sutta", "para_seq": null}}
{"text": "Then the Blessed One set out wandering toward Savatthi with Ven. Angulimala as his attendant monk. After wandering by stages he reached Savatthi, and there he lived, near Savatthi, in Jeta's Grove, Anathapindika's monastery.", "entities": [[9, 20, "PERSON"], [46, 54, "GPE"], [136, 144, "GPE"], [171, 179, "GPE"], [184, 196, "LOC"], [198, 211, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.086.than.html", "title": "Angulimala Sutta", "para_seq": null}}
{"text": "Then King Pasenadi Kosala, with a cavalry of roughly 500 horsemen, drove out of Savatthi and entered the monastery. Driving as far as the ground was passable for chariots, he got down from his chariot and went on foot to the Blessed One. On arrival, having bowed down, he sat to one side. As he was sitting there, the Blessed One said to him, \"What is it, great king? Has King Seniya Bimbisara of Magadha provoked you, or have the Licchavis of Vesali or some other hostile king?\"", "entities": [[5, 25, "PERSON"], [80, 88, "GPE"], [225, 236, "PERSON"], [318, 329, "PERSON"], [372, 393, "PERSON"], [397, 404, "GPE"], [431, 440, "NORP"], [444, 450, "GPE"]], "meta": {"nikaya": "MN", "identifier": "mn.086.than.html", "title": "Angulimala Sutta", "para_seq": null}}
{"text": "\"No, lord. King Seniya Bimbisara of Magadha hasn't provoked me, nor have the Licchavis of Vesali, nor has some other hostile king. There is a bandit in my realm, lord, named Angulimala: brutal, bloody-handed, devoted to killing & slaying, showing no mercy to living beings. He has turned villages into non-villages, towns into non-towns, settled countryside into unsettled countryside. Having repeatedly killed human beings, he wears a garland made of fingers. I am going to stamp him out.\" [1]", "entities": [[11, 32, "PERSON"], [36, 43, "GPE"], [77, 86, "NORP"], [90, 96, "GPE"]], "meta": {"nikaya": "MN", "identifier": "mn.086.than.html", "title": "Angulimala Sutta", "para_seq": null}}
{"text": "Then Ven. Angulimala, early in the morning, having put on his robes and carrying his outer robe & bowl, went into Savatthi for alms. As he was going from house to house for alms, he saw a woman suffering a breech birth. On seeing her, the thought occurred to him: \"How tormented are living beings! How tormented are living beings!\" Then, having wandered for alms in Savatthi and returning from his alms round after his meal, he went to the Blessed One. On arrival, having bowed down to him, he sat to one side. As he was sitting there he said to the Blessed One, \"Just now, lord, early in the morning, having put on my robes and carrying my outer robe & bowl, I went into Savatthi for alms. As I was going from house to house for alms, I saw a woman suffering a breech birth. On seeing her, the thought occurred to me: 'How tormented are living beings! How tormented are living beings!'\"", "entities": [[114, 122, "GPE"], [366, 374, "GPE"], [440, 451, "PERSON"], [550, 561, "PERSON"], [672, 680, "GPE"]], "meta": {"nikaya": "MN", "identifier": "mn.086.than.html", "title": "Angulimala Sutta", "para_seq": null}}
{"text": "Then Ven. Angulimala, early in the morning, having put on his robes and carrying his outer robe & bowl, went into Savatthi for alms. Now at that time a clod thrown by one person hit Ven. Angulimala on the body, a stone thrown by another person hit him on the body, and a potsherd thrown by still another person hit him on the body. So Ven. Angulimala — his head broken open and dripping with blood, his bowl broken, and his outer robe ripped to shreds — went to the Blessed One. The Blessed One saw him coming from afar and on seeing him said to him: \"Bear with it, brahman! Bear with it! The fruit of the kamma that would have burned you in hell for many years, many hundreds of years, many thousands of years, you are now experiencing in the here-&-now!\" [3]", "entities": [[114, 122, "GPE"], [466, 477, "PERSON"], [483, 494, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.086.than.html", "title": "Angulimala Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi at Jeta's Grove, Anathapindika 's monastery. Now at that time a certain householder's dear & beloved little son, his only child, had died. Because of his death, the father had no desire to work or to eat. He kept going to the cemetery and crying out, \"Where have you gone, my only little child? Where have you gone, my only little child?\"", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [79, 91, "LOC"], [93, 106, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.087.than.html", "title": "Piyajatika Sutta", "para_seq": null}}
{"text": "\"Once in this same Savatthi there was a woman whose mother died. Owing to her mother's death she went mad, out of her mind, and wandering from street to street, crossroads to crossroads, would say, 'Have you seen my mother? Have you seen my mother?' It's through this sequence of events that it may be understood how sorrow, lamentation, pain, distress, & despair are born from one who is dear, come springing from one who is dear.", "entities": [[19, 27, "GPE"]], "meta": {"nikaya": "MN", "identifier": "mn.087.than.html", "title": "Piyajatika Sutta", "para_seq": null}}
{"text": "\"Once in this same Savatthi there was a woman whose father died... whose brother died... whose sister died... whose son died... whose daughter died... whose husband died. Owing to his death she went mad, out of her mind, and wandering from street to street, crossroads to crossroads, would say, 'Have you seen my husband? Have you seen my husband?' It's through this sequence of events that it may be understood how sorrow, lamentation, pain, distress, & despair are born from one who is dear, come springing from one who is dear.", "entities": [[19, 27, "GPE"]], "meta": {"nikaya": "MN", "identifier": "mn.087.than.html", "title": "Piyajatika Sutta", "para_seq": null}}
{"text": "\"Once in this same Savatthi there was a man whose mother died. Owing to her death he went mad, out of his mind, and wandering from street to street, crossroads to crossroads, would say, 'Have you seen my mother? Have you seen my mother?' It's through this sequence of events that it may be understood how sorrow, lamentation, pain, distress, & despair are born from one who is dear, come springing from one who is dear.", "entities": [[19, 27, "GPE"]], "meta": {"nikaya": "MN", "identifier": "mn.087.than.html", "title": "Piyajatika Sutta", "para_seq": null}}
{"text": "\"Once in this same Savatthi there was a man whose father died... whose brother died... whose sister died... whose son died... whose daughter died... whose wife died. Owing to her death he went mad, out of his mind, and wandering from street to street, crossroads to crossroads, would say, 'Have you seen my wife? Have you seen my wife?' It's through this sequence of events that it may be understood how sorrow, lamentation, pain, distress, & despair are born from one who is dear, come springing from one who is dear.", "entities": [[19, 27, "GPE"]], "meta": {"nikaya": "MN", "identifier": "mn.087.than.html", "title": "Piyajatika Sutta", "para_seq": null}}
{"text": "\"Once in this same Savatthi there was a wife who went to her relatives' home. Her relatives, having separated her from her husband, wanted to give her to another against her will. So she said to her husband, 'These relatives of mine, having separated us, want to give me to another against my will,' whereupon he cut her in two and slashed himself open, thinking, 'Dead we will be together.' It's through this sequence of events that it may be understood how sorrow, lamentation, pain, distress, & despair are born from one who is dear, come springing from one who is dear.\"", "entities": [[19, 27, "GPE"]], "meta": {"nikaya": "MN", "identifier": "mn.087.than.html", "title": "Piyajatika Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monstery. And on that occasion five hundred brahmans from various provinces were staying at Savatthi on some business or other. The thought occurred to them, \"This Gotama the contemplative prescribes purity for the four castes. Now who is capable of disputing with him on this statement?\" And on that occasion the brahman student Assalayana was staying at Savatthi. Young, shaven-headed, sixteen years old, he was a master of the Three Vedas with their vocabularies, liturgy, phonology, etymology, & histories as a fifth; skilled in philology & grammar, he was fully versed in cosmology and in the marks of a Great Man. The thought occurred to the brahmans, \"This brahman student Assalayana is staying in Savatthi... He is capable of disputing with Gotama the contemplative on this statement.\"", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [79, 91, "LOC"], [93, 106, "PERSON"], [201, 209, "GPE"], [273, 279, "PERSON"], [465, 473, "GPE"], [814, 822, "GPE"], [858, 864, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.093.than.html", "title": "Assalayana Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Rajagaha in the Bamboo Grove, the Squirrels' Sanctuary. Now, on that occasion Ven. Sariputta was wandering in the Southern Mountains with a large community of monks. Then a certain monk who had spent the Rains in Rajagaha went to the Southern Mountains, to Ven. Sariputta. On arrival, he exchanged courteous greetings with Ven. Sariputta and — after an exchange of friendly greetings & courtesies — sat to one side. As he was sitting there, Ven. Sariputta said to him, \"I trust, friend, that the Blessed One is strong & free from illness?\"", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [83, 95, "LOC"], [101, 121, "LOC"], [145, 159, "PERSON"], [181, 199, "LOC"], [280, 288, "GPE"], [301, 319, "LOC"], [324, 338, "PERSON"], [390, 404, "PERSON"], [508, 522, "PERSON"], [563, 574, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.097.than.html", "title": "Dhanañjani Sutta", "para_seq": null}}
{"text": "Then Ven. Sariputta, having stayed in the Southern Mountains as long as he liked, wandered in the direction of Rajagaha. After wandering by stages, he arrived at Rajagaha. There he stayed near Rajagaha in the Squirrels' Sanctuary.", "entities": [[5, 19, "PERSON"], [42, 60, "LOC"], [111, 119, "GPE"], [162, 170, "GPE"], [193, 201, "GPE"], [209, 229, "LOC"]], "meta": {"nikaya": "MN", "identifier": "mn.097.than.html", "title": "Dhanañjani Sutta", "para_seq": null}}
{"text": "Then early in the morning, Ven. Sariputta put on his robes and, carrying his bowl & outer robe, went into Rajagaha for alms. And on that occasion Dhanañjanin the brahman was milking cows in a cow pen outside the city. Then Ven. Sariputta, having gone for alms in Rajagaha, after his meal, on his way back from his almsround, went to Dhanañjanin the brahman. Dhanañjanin the brahman saw Ven. Sariputta coming from afar. On seeing him, he went to him and said, \"Drink some of this fresh milk, master Sariputta. It must be time for your meal.\"", "entities": [[27, 41, "PERSON"], [106, 114, "GPE"], [146, 157, "PERSON"], [223, 237, "PERSON"], [263, 271, "GPE"], [333, 344, "PERSON"], [358, 369, "PERSON"], [386, 400, "PERSON"], [498, 507, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.097.than.html", "title": "Dhanañjani Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Vesali in the Great Forest, at the Peaked Pavilion. Now at that time a large number of monks had declared final gnosis in the Blessed One's presence: \"We discern that 'Birth is ended, the holy life fulfilled, the task done. There is nothing further for the sake of this world.'\"", "entities": [[38, 49, "PERSON"], [67, 73, "GPE"], [193, 204, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.105.than.html", "title": "Sunakkhatta Sutta", "para_seq": null}}
{"text": "Then in the early morning, Ven. Ananda, having put on his robes and carrying his bowl and outer robe, went into Rajagaha for alms. The thought occurred to him, \"It's too early to go for alms in Rajagaha. What if I were to go to the brahman Moggallana the Guardsman at his construction site?\" So he went to Moggallana the Guardsman at his construction site. Moggallana the Guardsman saw him coming from afar, and on seeing him said to him, \"Come, Master Ananda. Welcome, Master Ananda. It has been a long time since Master Ananda has found the time to come here. Sit down, Master Ananda. Here is a seat made ready for you.\"", "entities": [[32, 38, "PERSON"], [112, 120, "GPE"], [194, 202, "GPE"], [240, 250, "PERSON"], [306, 316, "PERSON"], [357, 367, "PERSON"], [453, 459, "PERSON"], [477, 483, "PERSON"], [522, 528, "PERSON"], [579, 585, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.108.than.html", "title": "Gopaka Moggallana Sutta", "para_seq": null}}
{"text": "And then Ven. Ananda's discussion with Moggallana the Guardsman was interrupted in mid-course, for the brahman Vassakara , the Magadhan administrator, on an inspection tour of the construction sites in Rajagaha, went to Ven. Ananda at Moggallana the Guardsman's construction site. On arrival, he exchanged courteous greetings with Ven. Ananda. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to Ven. Ananda, \"Just now, for what discussion were you sitting together when you were interrupted in mid-course?\"", "entities": [[14, 20, "PERSON"], [39, 49, "PERSON"], [111, 120, "PERSON"], [202, 210, "GPE"], [225, 231, "PERSON"], [235, 245, "PERSON"], [336, 342, "PERSON"], [459, 465, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.108.than.html", "title": "Gopaka Moggallana Sutta", "para_seq": null}}
{"text": "\"Once, Ven. Ananda, Master Gotama was staying near Vesali in the Peaked Roofed Pavilion in the Great Wood. I went to him at the Peaked Roofed Pavilion in the Great Wood, and there he spoke in a variety of ways on mental absorption. Master Gotama was both endowed with mental absorption & made mental absorption his habit. In fact, he praised mental absorption of every sort.\"", "entities": [[12, 18, "PERSON"], [27, 33, "PERSON"], [51, 57, "GPE"], [239, 245, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.108.than.html", "title": "Gopaka Moggallana Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi in the Eastern Monastery, the palace of Migara's mother . And on that occasion — the uposatha of the fifteenth, the night of a very full moon — he was sitting out in the open with the community of monks.", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"]], "meta": {"nikaya": "MN", "identifier": "mn.109.than.html", "title": "Maha-punnama Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi in the Eastern Monastery, the palace of Migara's mother . And on that occasion — the uposatha of the fifteenth, the night of a very full moon — he was sitting out in the open with the community of monks. Then, having surveyed the silent community of monks, he addressed them: \"Monks, could a person of no integrity know of a person of no integrity: 'This is a person of no integrity'?\"", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"]], "meta": {"nikaya": "MN", "identifier": "mn.110.than.html", "title": "Cula-punnama Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying at Savatthi in the Eastern Monastery, the palace of Migara 's mother, together with many well-known elder disciples — with Ven. Sariputta , Ven. Maha Moggallana , Ven. Maha Kassapa , Ven. Maha Kaccana , Ven. Maha Kotthita , Ven. Maha Kappina , Ven. Maha Cunda , Ven. Revata , Ven. Ananda , and other well-known elder disciples. On that occasion the elder monks were teaching & instructing. Some elder monks were teaching & instructing ten monks, some were teaching & instructing twenty monks, some were teaching & instructing thirty monks, some were teaching & instructing forty monks. The new monks, being taught & instructed by the elder monks, were discerning grand, successive distinctions.", "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [185, 199, "PERSON"], [212, 222, "PERSON"], [255, 262, "PERSON"], [316, 321, "PERSON"], [343, 349, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.118.than.html", "title": "Anapanasati Sutta", "para_seq": null}}
{"text": "\"Monks, I am content with this practice. I am content at heart with this practice. So arouse even more intense persistence for the attaining of the as-yet-unattained, the reaching of the as-yet-unreached, the realization of the as-yet-unrealized. I will remain right here at Savatthi [for another month] through the 'White Water-lily' Month, the fourth month of the rains.\"", "entities": [[275, 283, "GPE"]], "meta": {"nikaya": "MN", "identifier": "mn.118.than.html", "title": "Anapanasati Sutta", "para_seq": null}}
{"text": "The monks in the countryside heard, \"The Blessed One, they say, will remain right there at Savatthi through the White Water-lily Month, the fourth month of the rains.\" So they left for Savatthi to see the Blessed One.", "entities": [[41, 52, "PERSON"], [91, 99, "GPE"], [185, 193, "GPE"], [205, 216, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.118.than.html", "title": "Anapanasati Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying in Savatthi at Jeta's Grove, Anathapindika 's monastery. Now at that time a large number of monks, after the meal, on returning from their alms round, had gathered at the meeting hall when this discussion arose: \"Isn't it amazing, friends! Isn't it astounding! — the extent to which mindfulness immersed in the body, when developed & pursued, is said by the Blessed One who knows, who sees — the worthy one, rightly self-awakened — to be of great fruit & great benefit.\" And this discussion came to no conclusion.", "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [77, 89, "LOC"], [91, 104, "PERSON"], [420, 431, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.119.than.html", "title": "Kayagata-sati Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying at Savatthi in the Eastern Monastery, the palace of Migara 's mother. Then in the evening, Ven. Ananda , coming out of seclusion, went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there, he said to the Blessed One: \"On one occasion, when the Blessed One was staying among the Sakyans in a Sakyan town named Nagaraka , there — face-to-face with the Blessed One — I heard this, face-to-face I learned this: 'I now remain fully in a dwelling of emptiness.' Did I hear that correctly, learn it correctly, attend to it correctly, remember it correctly?\"", "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [158, 164, "PERSON"], [204, 215, "PERSON"], [316, 327, "PERSON"], [356, 367, "PERSON"], [462, 473, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.121.than.html", "title": "Cula-suññata Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying among the Sakyans at Kapilavatthu in the Banyan Park. Then in the early morning, the Blessed One, having put on his robes and carrying his bowl and outer robe, went into Kapilavatthu for alms. Having gone for alms in Kapilavatthu, after the meal, returning from his alms round, he went to the dwelling of Kala-khemaka the Sakyan for the day's abiding. Now at that time many resting places had been prepared in Kala-khemaka the Sakyan's dwelling. The Blessed One saw the many resting places prepared there and, on seeing them, the thought occurred to him, \"There are many resting places prepared here. Do many monks live here?\"", "entities": [[38, 49, "PERSON"], [83, 95, "GPE"], [147, 158, "PERSON"], [232, 244, "GPE"], [279, 291, "GPE"], [512, 523, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.122.than.html", "title": "Maha-suññata Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery . Then Subha the student, Todeyya's son , went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to the Blessed One: \"Master Gotama, what is the reason, what is the cause, why baseness & excellence are seen among human beings, among the human race? For short-lived & long-lived people are to be seen, sickly & healthy, ugly & beautiful, uninfluential & influential, poor & rich, low-born & high-born, stupid & discerning people are to be seen. So what is the reason, what is the cause, why baseness & excellence are seen among human beings, among the human race?\"", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [79, 91, "LOC"], [93, 106, "PERSON"], [173, 184, "PERSON"], [356, 367, "PERSON"], [377, 383, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.135.than.html", "title": "Cula-kammavibhanga Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Rājagaha at the Bamboo Grove in the Squirrels' sanctuary. And on that occasion Ven. Samiddhi was staying in a wilderness hut. Then Potaliputta the wanderer, while walking & wandering around to exercise his legs, went to Ven. Samiddhi and exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to Ven. Samiddhi, \"Face to face with Gotama the contemplative have I heard this, face to face have I learned this: 'Bodily action is barren, verbal action is barren, only mental action is true. And there is an attainment in which, on being attained, nothing is felt.'\"", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [83, 95, "LOC"], [489, 495, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.136.than.html", "title": "Maha Kammavibhanga Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion, as the Blessed One was wandering among the Magadhans , he entered Rajagaha , went to the potter Bhaggava , and on arrival said to him, \"If it is no inconvenience for you, Bhaggava, I will stay for one night in your shed.\"", "entities": [[42, 53, "PERSON"], [101, 109, "GPE"]], "meta": {"nikaya": "MN", "identifier": "mn.140.than.html", "title": "Dhatu-vibhanga Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi, in Jeta's Grove, Anathapindika's monastery. And on that occasion Anathapindika the householder was diseased, in pain, severely ill. Then Anathapindika the householder said to one of his men, \"Come, my good man. Go to the Blessed One and, on arrival, pay homage to his feet with your head in my name and say 'Lord, Anathapindika the householder is diseased, in pain, severely ill. He pays homage with his head to the Blessed One's feet.' Then go to Ven. Sariputta and, on arrival, pay homage to his feet with your head in my name and say 'Venerable sir, Anathapindika the householder is diseased, in pain, severely ill. He pays homage with his head to your feet.' Then say: 'It would be good if Ven. Sariputta would visit Anathapindika's home, out of sympathy for him.'\"", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [80, 92, "LOC"], [94, 107, "PERSON"], [142, 155, "PERSON"], [214, 227, "PERSON"], [298, 309, "PERSON"], [391, 404, "PERSON"], [493, 504, "PERSON"], [525, 539, "PERSON"], [630, 643, "PERSON"], [771, 785, "PERSON"], [798, 811, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.143.than.html", "title": "Anathapindikovada Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi , at Jeta's Grove, Anathapindika's monastery . Then Mahapajapati Gotami , together with about 500 other nuns, went to the Blessed One and, on arrival, having bowed down to him, stood to one side. As she was standing there she said to him, \"Exhort the nuns, lord. Instruct the nuns, lord. Give the nuns a talk on Dhamma.\"", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [81, 93, "LOC"], [95, 108, "PERSON"], [198, 209, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.146.than.html", "title": "Nandakovada Sutta", "para_seq": null}}
{"text": "\"As you say, lord,\" Ven. Nandaka replied. Then, early in the morning, having put on his robes and carrying his bowl & outer robe, he went into Rajagaha for alms. After his meal, on returning from his alms round, he went with a companion to Rajaka Park. The nuns saw him coming from afar and, on seeing him, arranged a seat and set out water for his feet. Ven. Nandaka sat down on the arranged seat and washed his feet. The nuns bowed down to him and sat to one side.", "entities": [[143, 151, "GPE"]], "meta": {"nikaya": "MN", "identifier": "mn.146.than.html", "title": "Nandakovada Sutta", "para_seq": null}}
{"text": "\"As you say, lord,\" Ven. Nandaka replied. Then, after the night had passed, early in the morning, having put on his robes and carrying his bowl & outer robe, he went into Rajagaha for alms ... [as before, from \"Then the Blessed One addressed Ven. Nandaka\" up to:]", "entities": [[171, 179, "GPE"], [220, 231, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.146.than.html", "title": "Nandakovada Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying at Savatthi , in Jeta's Grove, Anathapindika's Monastery. Then, as he was alone in seclusion, this line of thinking arose in the Blessed One's awareness: \"The mental qualities that ripen in release have ripened in Rahula. What if I were to lead Rahula further to the ending of the mental fermentations?\"", "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [79, 91, "LOC"], [93, 118, "LOC"], [191, 202, "PERSON"], [276, 282, "PERSON"], [307, 313, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.147.than.html", "title": "Cula-Rahulovada Sutta", "para_seq": null}}
{"text": "Then the Blessed One, early in the morning, put on his robes and, carrying his bowl & outer robe, went into Savatthi for alms. Having gone for alms in Savatthi, after the meal, returning from his alms round, he said to Ven. Rahula, \"Fetch your sitting cloth, Rahula. We will go to the Grove of the Blind to spend the day.\"", "entities": [[9, 20, "PERSON"], [108, 116, "GPE"], [151, 159, "GPE"], [224, 230, "PERSON"], [259, 265, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.147.than.html", "title": "Cula-Rahulovada Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika 's monastery. Then a certain devata, in the far extreme of the night, her extreme radiance lighting up the entirety of Jeta's Grove, went to the Blessed One. On arrival, having bowed down to him, she stood to one side. As she was standing there, she said to him, \"Tell me, dear sir, how you crossed over the flood.\"", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [79, 91, "LOC"], [93, 106, "PERSON"], [226, 238, "LOC"], [252, 263, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn01.001.than.html", "title": "Ogha-tarana Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Rajagaha at Tapoda monastery. Then Ven. Samiddhi, as night was ending, got up & went to the Tapoda Hot Springs to bathe his limbs. Having bathed his limbs and gotten out of the springs, he stood wearing only his lower robe, letting his limbs dry.", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn01.020.than.html", "title": "Samiddhi Sutta", "para_seq": null}}
{"text": "\"I'm new, my friend, not long gone forth, only recently come to this Dhamma & discipline. I can't explain it in detail. But the Blessed One, worthy & rightly self-awakened, is staying here in Rajagaha at Tapoda monastery. Having gone to him, ask him this matter. As he explains it, that's how you should remember it.\"", "entities": [[128, 139, "PERSON"], [192, 200, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn01.020.than.html", "title": "Samiddhi Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Rajagaha at the Maddakucchi Deer Reserve . Now at that time his foot had been pierced by a stone sliver. Excruciating were the bodily feelings that developed within him — painful, fierce, sharp, wracking, repellent, disagreeable — but he endured them mindful, alert, & unperturbed. Having had his outer robe folded in four and laid out, he lay down on his right side in the lion's posture, with one foot placed on top of the other, mindful & alert.", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn01.038.than.html", "title": "Sakalika Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery . Then a certain devata, in the far extreme of the night, her extreme radiance lighting up the entirety of Jeta's Grove, went to the Blessed One and, on arrival, having bowed down to him, stood to one side. As she was standing there, she recited these verses in the Blessed One's presence:", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [79, 91, "LOC"], [93, 106, "PERSON"], [226, 238, "LOC"], [252, 263, "PERSON"], [385, 396, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn01.041.than.html", "title": "Aditta Sutta", "para_seq": null}}
{"text": "On one occasion the Blessed One was staying near Savatthi , in Jeta's Grove, Anathapindika 's monastery. Then Rohitassa , the son of a deva, in the far extreme of the night, his extreme radiance lighting up the entirety of Jeta's Grove, went to the Blessed One. On arrival, having bowed down to the Blessed One, he stood to one side. As he was standing there he said to the Blessed One: \"Is it possible, lord, by traveling, to know or see or reach a far end of the cosmos where one does not take birth, age, die, pass away or reappear?\"", "entities": [[20, 31, "PERSON"], [49, 57, "GPE"], [63, 75, "LOC"], [77, 90, "PERSON"], [223, 235, "LOC"], [249, 260, "PERSON"], [299, 310, "PERSON"], [374, 385, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn02.026.than.html", "title": "Rohitassa Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika 's monastery. Then King Pasenadi Kosala went to the Blessed One and, on arrival, exchanged courteous greetings with him. After this exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there he said to the Blessed One: \"Now then, does Master Gotama claim, 'I have awakened to the unexcelled right self-awakening'?\"", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [79, 91, "LOC"], [93, 106, "PERSON"], [126, 146, "PERSON"], [159, 170, "PERSON"], [343, 354, "PERSON"], [379, 385, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn03.001.than.html", "title": "Dahara Sutta", "para_seq": null}}
{"text": "At Savatthi . As he was sitting to one side, King Pasenadi Kosala said to the Blessed One: \"Just now, lord, while I was alone in seclusion, this train of thought arose in my awareness: 'Who are dear to themselves, and who are not dear to themselves?' Then it occurred to me: 'Those who engage in bodily misconduct, verbal misconduct, & mental misconduct are not dear to themselves. Even though they may say, \"We are dear to ourselves,\" still they aren't dear to themselves. Why is that? Of their own accord, they act toward themselves as an enemy would act toward an enemy; thus they aren't dear to themselves. But those who engage in good bodily conduct, good verbal conduct, & good mental conduct are dear to themselves. Even though they may say, \"We aren't dear to ourselves,\" still they are dear to themselves. Why is that? Of their own accord, they act toward themselves as a dear one would act toward a dear one; thus they are dear to themselves.'\"", "entities": [[3, 11, "GPE"], [45, 65, "PERSON"], [78, 89, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn03.004.than.html", "title": "Piya Sutta", "para_seq": null}}
{"text": "At Savatthi . As he was sitting to one side, King Pasenadi Kosala said to the Blessed One: \"Just now, lord, while I was alone in seclusion, this train of thought arose in my awareness: 'Who have themselves protected, and who leave themselves unprotected?' Then it occurred to me: 'Those who engage in bodily misconduct, verbal misconduct, & mental misconduct leave themselves unprotected. Even though a squadron of elephant troops might protect them, a squadron of cavalry troops, a squadron of chariot troops, a squadron of infantry troops might protect them, still they leave themselves unprotected. Why is that? Because that's an external protection, not an internal one. Therefore they leave themselves unprotected. But those who engage in good bodily conduct, good verbal conduct, & good mental conduct have themselves protected. Even though neither a squadron of elephant troops, a squadron of cavalry troops, a squadron of chariot troops, nor a squadron of infantry troops might protect them, still they have themselves protected. Why is that? Because that's an internal protection, not an external one. Therefore they have themselves protected.'\"", "entities": [[3, 11, "GPE"], [45, 65, "PERSON"], [78, 89, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn03.005.than.html", "title": "Atta-rakkhita Sutta", "para_seq": null}}
{"text": "At Savatthi. As he was sitting to one side, King Pasenadi Kosala said to the Blessed One: \"Just now, lord, while I was alone in seclusion, this train of thought arose in my awareness: 'Few are those people in the world who, when acquiring lavish wealth, don't become intoxicated & heedless, don't become greedy for sensual pleasures, and don't mistreat other beings. Many more are those who, when acquiring lavish wealth, become intoxicated & heedless, become greedy for sensual pleasures, and mistreat other beings.'\"", "entities": [[3, 11, "GPE"], [44, 64, "PERSON"], [77, 88, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn03.006.than.html", "title": "Appaka Sutta", "para_seq": null}}
{"text": "At Savatthi. As he was sitting to one side, King Pasenadi Kosala said to the Blessed One: \"Just now, lord, as I was sitting in judgment, I saw that even affluent nobles, affluent brahmans, & affluent householders — rich, with great wealth & property, with vast amounts of gold & silver, vast amounts of valuables & commodities, vast amounts of wealth & grain — tell deliberate lies with sensual pleasures as the cause, sensual pleasures as the reason, simply for the sake of sensual pleasures. Then, the thought occured to me: 'I've had enough of this judging! Let some other fine fellow be known for his judgments!'\"", "entities": [[3, 11, "GPE"], [44, 64, "PERSON"], [77, 88, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn03.007.than.html", "title": "Atthakarana Sutta", "para_seq": null}}
{"text": "Staying at Savatthi. Then King Ajatasattu of Magadha, the son of Queen Videha, raising a fourfold army, marched toward Kasi against King Pasenadi Kosala . King Pasenadi heard, \"King Ajatasattu of Magadha, the son of Queen Videha, they say, has raised a fourfold army and is marching toward Kasi against me.\" So King Pasenadi, raising a fourfold army, launched a counter-attack toward Kasi against King Ajatasattu. Then King Ajatasattu & King Pasenadi fought a battle, and in that battle King Ajatasattu defeated King Pasenadi. King Pasenadi, defeated, marched back to his capital at Savatthi.", "entities": [[11, 19, "GPE"], [31, 41, "PERSON"], [45, 52, "GPE"], [65, 77, "PERSON"], [119, 123, "GPE"], [132, 152, "PERSON"], [155, 168, "PERSON"], [182, 192, "PERSON"], [196, 203, "GPE"], [216, 228, "PERSON"], [290, 294, "GPE"], [311, 324, "PERSON"], [384, 388, "GPE"], [402, 412, "PERSON"], [424, 434, "PERSON"], [437, 450, "PERSON"], [492, 502, "PERSON"], [512, 525, "PERSON"], [527, 540, "PERSON"], [583, 591, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn03.014.than.html", "title": "Sangama Sutta", "para_seq": null}}
{"text": "Then in the early morning, a large number of monks, having put on their robes and carrying their bowls & outer robes, went into Savatthi for alms. Having gone for alms in Savatthi, after the meal, returning from their alms round, they went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As they were sitting there, they said to the Blessed One: \"Just now, lord, King Ajatasattu of Magadha, the son of Queen Videha, raising a fourfold army, marched toward Kasi against King Pasenadi Kosala. King Pasenadi heard, 'King Ajatasattu of Magadha, the son of Queen Videha, they say, has raised a fourfold army and is marching toward Kasi against me.' So King Pasenadi, raising a fourfold army, launched a counter-attack toward Kasi against King Ajatasattu. Then King Ajatasattu & King Pasenadi fought a battle, and in that battle King Ajatasattu defeated King Pasenadi. King Pasenadi, defeated, marched back to his capital at Savatthi.\"", "entities": [[128, 136, "GPE"], [171, 179, "GPE"], [247, 258, "PERSON"], [364, 375, "PERSON"], [399, 409, "PERSON"], [413, 420, "GPE"], [433, 445, "PERSON"], [487, 491, "GPE"], [500, 520, "PERSON"], [522, 535, "PERSON"], [549, 559, "PERSON"], [563, 570, "GPE"], [583, 595, "PERSON"], [657, 661, "GPE"], [678, 691, "PERSON"], [751, 755, "GPE"], [769, 779, "PERSON"], [791, 801, "PERSON"], [804, 817, "PERSON"], [859, 869, "PERSON"], [879, 892, "PERSON"], [894, 907, "PERSON"], [950, 958, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn03.014.than.html", "title": "Sangama Sutta", "para_seq": null}}
{"text": "Staying at Savatthi. Then King Ajatasattu of Magadha, the son of Queen Videha, raising a fourfold army, marched toward Kasi against King Pasenadi Kosala . King Pasenadi heard, \"King Ajatasattu of Magadha, the son of Queen Videha, they say, has raised a fourfold army and is marching toward Kasi against me.\" So King Pasenadi, raising a fourfold army, launched a counter-attack toward Kasi against King Ajatasattu. Then King Ajatasattu & King Pasenadi fought a battle, and in that battle King Pasenadi defeated King Ajatasattu and captured him alive.", "entities": [[11, 19, "GPE"], [31, 41, "PERSON"], [45, 52, "GPE"], [65, 77, "PERSON"], [119, 123, "GPE"], [132, 152, "PERSON"], [155, 168, "PERSON"], [182, 192, "PERSON"], [196, 203, "GPE"], [216, 228, "PERSON"], [290, 294, "GPE"], [311, 324, "PERSON"], [384, 388, "GPE"], [402, 412, "PERSON"], [424, 434, "PERSON"], [437, 450, "PERSON"], [487, 500, "PERSON"], [515, 525, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn03.015.than.html", "title": "Sangama Sutta", "para_seq": null}}
{"text": "Then in the early morning, a large number of monks, having put on their robes and carrying their bowls & outer robes, went into Savatthi for alms. Having gone for alms in Savatthi, after the meal, returning from their alms round, they went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As they were sitting there, they [reported these events to the Blessed One].", "entities": [[128, 136, "GPE"], [171, 179, "GPE"], [247, 258, "PERSON"], [382, 393, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn03.015.than.html", "title": "Sangama Sutta", "para_seq": null}}
{"text": "At Savatthi. As he was sitting to one side, King Pasenadi Kosala said to the Blessed One: \"Is there, lord, any one quality that keeps both kinds of benefit secure — benefits in this life & benefits in lives to come?\"", "entities": [[3, 11, "GPE"], [44, 64, "PERSON"], [77, 88, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn03.017.than.html", "title": "Appamada Sutta", "para_seq": null}}
{"text": "At Savatthi. Then King Pasenadi Kosala went to the Blessed One in the middle of the day and, on arrival, having bowed down to the Blessed One, sat to one side. As he was sitting there the Blessed One said to him, \"Well now, great king, where are you coming from in the middle of the day?\"", "entities": [[3, 11, "GPE"], [18, 38, "PERSON"], [51, 62, "PERSON"], [130, 141, "PERSON"], [188, 199, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn03.019.than.html", "title": "Aputtaka Sutta", "para_seq": null}}
{"text": "\"Just now, lord, a money-lending householder died in Savatthi. I have come from conveying his heirless fortune to the royal palace: eight million in silver, to say nothing of the gold. But even though he was a money-lending householder, his enjoyment of food was like this: he ate broken rice & pickle brine. His enjoyment of clothing was like this: he wore three lengths of hempen cloth. His enjoyment of a vehicle was like this: he rode in a dilapidated little cart with an awning of leaves.\"", "entities": [[53, 61, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn03.019.than.html", "title": "Aputtaka Sutta", "para_seq": null}}
{"text": "At Savatthi. Then King Pasenadi Kosala went to the Blessed One in the middle of the day and, on arrival, having bowed down to the Blessed One, sat to one side. As he was sitting there the Blessed One said to him, \"Well now, great king, where are you coming from in the middle of the day?\"", "entities": [[3, 11, "GPE"], [18, 38, "PERSON"], [51, 62, "PERSON"], [130, 141, "PERSON"], [188, 199, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn03.020.than.html", "title": "Aputtaka Sutta", "para_seq": null}}
{"text": "\"Just now, lord, a money-lending householder died in Savatthi. I have come from conveying his heirless fortune to the royal palace: ten million in silver, to say nothing of the gold. But even though he was a money-lending householder, his enjoyment of food was like this: he ate broken rice & pickle brine. His enjoyment of clothing was like this: he wore three lengths of hempen cloth. His enjoyment of a vehicle was like this: he rode in a dilapidated little cart with an awning of leaves.\"", "entities": [[53, 61, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn03.020.than.html", "title": "Aputtaka Sutta", "para_seq": null}}
{"text": "\"That's the way it is, great king. That's the way it is. Once in the past that money-lending householder provided alms for the Private Buddha named Tagarasikhi . Saying [to his servant], 'Give alms to the contemplative,' he got up from his seat and left. After giving, though, he felt regret: 'It would have been better if my slaves or servants had eaten those alms.' And he also murdered his brother's only heir for the sake of his fortune. Now, the result of his action in having provided alms for the Private Buddha named Tagarasikhi was that he appeared seven times in a good destination, the heavenly world. And through the remaining result of that action he acted as money-lender seven times in this very same Savatthi. But the result of his action in feeling regret after giving [those] alms — 'It would have been better if my slaves or servants had eaten those alms' — was that his mind didn't lend itself to the lavish enjoyment of food, didn't lend itself to the lavish enjoyment of clothing, didn't lend itself to the lavish enjoyment of a vehicle, didn't lend itself to the lavish enjoyment of the five strings of sensuality. The result of his action in having murdered his brother's only heir for the sake of his fortune was that he boiled in hell for many years, many hundreds of years, many thousands of years, many hundred-thousands of years. And through the remaining result of that action he has left this seventh heirless fortune to the royal treasury.", "entities": [[135, 141, "PERSON"], [512, 518, "PERSON"], [716, 724, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn03.020.than.html", "title": "Aputtaka Sutta", "para_seq": null}}
{"text": "At Savatthi . Then King Pasenadi Kosala approached the Blessed One in the middle of the day and, on arrival, having bowed down, sat to one side. As he was sitting there, the Blessed One said to him: \"Well now, great king, where are you coming from in the middle of the day?\"", "entities": [[3, 11, "GPE"], [19, 39, "PERSON"], [55, 66, "PERSON"], [174, 185, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn03.025.than.html", "title": "Pabbatopama Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery. Then Mara the Evil One went to the Blessed One and recited this verse in his presence:", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [79, 91, "LOC"], [93, 106, "PERSON"], [125, 129, "PERSON"], [155, 166, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn04.008.than.html", "title": "Nandana Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Rajagaha at the Maddakucchi Deer Reserve. Now at that time his foot had been pierced by a stone sliver. Excruciating were the bodily feelings that developed within him — painful, fierce, sharp, wracking, repellent, disagreeable — but he endured them mindful, alert, & unperturbed. Having had his outer robe folded in four and laid out, he lay down on his right side in the lion's posture — with one foot placed on top of the other — mindful & alert.", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn04.013.than.html", "title": "Sakalika Sutta", "para_seq": null}}
{"text": "At Savatthi. Now at that time the Blessed One was instructing, urging, rousing, & encouraging the monks with a Dhamma talk concerning Unbinding. The monks — attentive, interested, lending ear, focusing their entire awareness — were listening to the Dhamma.", "entities": [[3, 11, "GPE"], [34, 45, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn04.019.than.html", "title": "Kassaka Sutta", "para_seq": null}}
{"text": "At Savatthi . Then, early in the morning, Alavika the nun put on her robes and, taking her bowl & outer robe, went into Savatthi for alms. When she had gone for alms in Savatthi and had returned from her alms round, after her meal she went to the Grove of the Blind to spend the day. Having gone deep into the Grove of the Blind, she sat down at the foot of a tree for the day's abiding.", "entities": [[3, 11, "GPE"], [120, 128, "GPE"], [169, 177, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn05.001.than.html", "title": "Alavika Sutta", "para_seq": null}}
{"text": "At Savatthi . Then, early in the morning, Soma the nun put on her robes and, taking her bowl & outer robe, went into Savatthi for alms. When she had gone for alms in Savatthi and had returned from her alms round, after her meal she went to the Grove of the Blind to spend the day. Having gone deep into the Grove of the Blind, she sat down at the foot of a tree for the day's abiding.", "entities": [[3, 11, "GPE"], [117, 125, "GPE"], [166, 174, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn05.002.than.html", "title": "Soma Sutta", "para_seq": null}}
{"text": "At Savatthi. Then, early in the morning, Kisa Gotami the nun put on her robes and, taking her bowl & outer robe, went into Savatthi for alms. When she had gone for alms in Savatthi and had returned from her alms round, after her meal she went to the Grove of the Blind to spend the day. Having gone deep into the Grove of the Blind, she sat down at the foot of a tree for the day's abiding.", "entities": [[3, 11, "GPE"], [123, 131, "GPE"], [172, 180, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn05.003.than.html", "title": "Gotami Sutta", "para_seq": null}}
{"text": "At Savatthi. Then, early in the morning, Vijaya the nun put on her robes and, taking her bowl & outer robe, went into Savatthi for alms. When she had gone for alms in Savatthi and had returned from her alms round, after her meal she went to the Grove of the Blind to spend the day. Having gone deep into the Grove of the Blind, she sat down at the foot of a tree for the day's abiding.", "entities": [[3, 11, "GPE"], [118, 126, "GPE"], [167, 175, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn05.004.than.html", "title": "Vijaya Sutta", "para_seq": null}}
{"text": "At Savatthi. Then, early in the morning, Uppalavanna the nun put on her robes and, taking her bowl & outer robe, went into Savatthi for alms. When she had gone for alms in Savatthi and had returned from her alms round, after her meal she went to the Grove of the Blind to spend the day. Having gone deep into the Grove of the Blind, she sat down at the foot of a tree for the day's abiding.", "entities": [[3, 11, "GPE"], [123, 131, "GPE"], [172, 180, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn05.005.than.html", "title": "Uppalavanna Sutta", "para_seq": null}}
{"text": "At Savatthi . Then, early in the morning, Cala the nun put on her robes and, taking her bowl & outer robe, went into Savatthi for alms. When she had gone for alms in Savatthi and had returned from her alms round, after her meal she went to the Grove of the Blind to spend the day. Having gone deep into the Grove of the Blind, she sat down at the foot of a tree for the day's abiding.", "entities": [[3, 11, "GPE"], [117, 125, "GPE"], [166, 174, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn05.006.than.html", "title": "Cala Sutta", "para_seq": null}}
{"text": "At Savatthi. Then, early in the morning, Upacala the nun put on her robes and, taking her bowl & outer robe, went into Savatthi for alms. When she had gone for alms in Savatthi and had returned from her alms round, after her meal she went to the Grove of the Blind to spend the day. Having gone deep into the Grove of the Blind, she sat down at the foot of a tree for the day's abiding.", "entities": [[3, 11, "GPE"], [119, 127, "GPE"], [168, 176, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn05.007.than.html", "title": "Upacala Sutta", "para_seq": null}}
{"text": "At Savatthi. Then, early in the morning, Sisupacala the nun put on her robes and, taking her bowl & outer robe, went into Savatthi for alms. When she had gone for alms in Savatthi and had returned from her alms round, after her meal she went to the Grove of the Blind to spend the day. Having gone deep into the Grove of the Blind, she sat down at the foot of a tree for the day's abiding.", "entities": [[3, 11, "GPE"], [122, 130, "GPE"], [171, 179, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn05.008.than.html", "title": "Sisupacala Sutta", "para_seq": null}}
{"text": "At Savatthi. Then, early in the morning, Sela the nun put on her robes and, taking her bowl & outer robe, went into Savatthi for alms. When she had gone for alms in Savatthi and had returned from her alms round, after her meal she went to the Grove of the Blind to spend the day. Having gone deep into the Grove of the Blind, she sat down at the foot of a tree for the day's abiding.", "entities": [[3, 11, "GPE"], [116, 124, "GPE"], [165, 173, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn05.009.than.html", "title": "Sela Sutta", "para_seq": null}}
{"text": "At Savatthi . Then, early in the morning, Vajira the nun put on her robes and, taking her bowl & outer robe, went into Savatthi for alms. When she had gone for alms in Savatthi and had returned from her alms round, after her meal she went to the Grove of the Blind to spend the day. Having gone deep into the Grove of the Blind, she sat down at the foot of a tree for the day's abiding.", "entities": [[3, 11, "GPE"], [119, 127, "GPE"], [168, 176, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn05.010.than.html", "title": "Vajira Sutta", "para_seq": null}}
{"text": "On one occasion the Blessed One was staying near Kusinara in Upavattana , the Sal Tree Grove of the Mallans , on the occasion of his total Unbinding. Then the Blessed One addressed the monks, \"I exhort you, monks: All fabrications are subject to decay. Bring about completion by being heedful.\" Those were the Tathagata's last words.", "entities": [[20, 31, "PERSON"], [49, 57, "GPE"], [61, 71, "GPE"], [159, 170, "PERSON"], [310, 319, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn06.015.than.html", "title": "Parinibbana Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Rajagaha in the Bamboo Grove, the Squirrels' Sanctuary. Then the brahman Akkosaka [1] Bharadvaja heard that a brahman of the Bharadvaja clan had gone forth from the home life into homelessness in the presence of the Blessed One. Angered & displeased, he went to the Blessed One and, on arrival, insulted & cursed him with rude, harsh words.", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [83, 95, "LOC"], [101, 121, "LOC"], [283, 294, "PERSON"], [333, 344, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn07.002.than.html", "title": "Akkosa Sutta", "para_seq": null}}
{"text": "At Savatthi . Then the brahman Jata [1] Bharadvaja went to the Blessed One and, on arrival, exchanged courteous greetings with him. After this exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there he addressed the Blessed One with a verse:", "entities": [[3, 11, "GPE"], [63, 74, "PERSON"], [249, 260, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn07.006.than.html", "title": "Jata Sutta", "para_seq": null}}
{"text": "At Savatthi. Then a certain very rich brahman — shabby, shabbily dressed — went to the Blessed One and, on arrival, exchanged courteous greetings with him. After this exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there the Blessed One said to him, \"Why, brahman, are you shabby & shabbily dressed?\"", "entities": [[3, 11, "GPE"], [87, 98, "PERSON"], [260, 271, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn07.014.than.html", "title": "Maha-sala Sutta", "para_seq": null}}
{"text": "On one occasion Ven. Ananda was staying near Savatthi in Jeta's Grove, Anathapindika 's monastery. Then early in the morning he put on his robes and, carrying his bowl & outer robe, went into Savatthi for alms with Ven. Vangisa as his attendant monk. Now at that time dissatisfaction (with the chaste life) had arisen in Ven. Vangisa. Lust invaded his mind. So he addressed Ven. Ananda with this verse:", "entities": [[21, 27, "PERSON"], [45, 53, "GPE"], [57, 69, "LOC"], [71, 84, "PERSON"], [192, 200, "GPE"], [379, 385, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn08.004.than.html", "title": "Ananda Sutta", "para_seq": null}}
{"text": "On one occasion a certain monk, a Vajjian princeling, was dwelling near Vesali in a forest thicket. And on that occasion an all-night festival was being held in Vesali. The monk — lamenting as he heard the resounding din of wind music, string music, & gongs coming from Vesali, on that occasion recited this verse:", "entities": [[72, 78, "GPE"], [161, 167, "GPE"], [270, 276, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn09.009.than.html", "title": "Vajjiputta Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Rajagaha in the Cool Grove. Now at that time Anathapindika the householder had arrived in Rajagaha on some business. He heard, \"An Awakened One, they say, has appeared in the world,\" and he wanted to go right then to see the Blessed One. Then the thought occurred to him, \"Today is not the proper time to go to see the Blessed One. Tomorrow I will go to see the Blessed One at the proper time.\" With his mindfulness immersed in the Awakened One he lay down to sleep. Three times he got up during the night, thinking it was light. Then he went to the gate to the charnel ground. Non-human beings opened the gate.", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [112, 125, "PERSON"], [157, 165, "GPE"], [292, 303, "PERSON"], [386, 397, "PERSON"], [429, 440, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn10.008.than.html", "title": "Sudatta Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery. There he addressed the monks, \"Monks, there are these four nutriments for the maintenance of beings who have come into being or for the support of those in search of a place to be born. Which four? Physical food, gross or refined; contact as the second; intellectual intention the third; and consciousness the fourth. These are the four nutriments for the maintenance of beings who have come into being or for the support of those in search of a place to be born.", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [79, 91, "LOC"], [93, 106, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn12.011.than.html", "title": "Ahara Sutta", "para_seq": null}}
{"text": "Dwelling at Savatthi . \"Monks, there are these four nutriments for the maintenance of beings who have come into being or for the support of those in search of a place to be born. Which four? Physical food, gross or refined; contact as the second; intellectual intention the third; and consciousness the fourth. These are the four nutriments for the maintenance of beings who have come into being or for the support of those in search of a place to be born.", "entities": [[12, 20, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn12.012.than.html", "title": "Phagguna Sutta", "para_seq": null}}
{"text": "Dwelling at Savatthi ... Then Ven. Kaccayana Gotta approached the Blessed One and, on arrival, having bowed down, sat to one side. As he was sitting there he said to the Blessed One: \"Lord, ' Right view , right view,' it is said. To what extent is there right view?\"", "entities": [[12, 20, "GPE"], [66, 77, "PERSON"], [170, 181, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn12.015.than.html", "title": "Kaccayanagotta Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Rajagaha in the Bamboo Grove, the Squirrels' Sanctuary. Then early in the morning the Blessed One, having put on his robes and carrying his bowl and outer robe, went into Rajagaha for alms. Kassapa-the-clothless [1] ascetic saw him coming from afar. On seeing him, he went to him and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he stood to one side. As he was standing there, he said to the Blessed One, \"We would like to question Master Gotama about a certain point, if he would take the time to answer our question.\"", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [83, 95, "LOC"], [101, 121, "LOC"], [153, 164, "PERSON"], [238, 246, "GPE"], [521, 532, "PERSON"], [568, 574, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn12.017.than.html", "title": "Acela Sutta", "para_seq": null}}
{"text": "Dwelling at Savatthi . \"When a fool is obstructed by ignorance and conjoined with craving, this body thus results. Now there is both this body and external name-&-form. Here, in dependence on this duality, there is contact at the six senses. Touched by these, or one or another of them, the fool is sensitive to pleasure & pain.", "entities": [[12, 20, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn12.019.than.html", "title": "Bala-pandita Sutta", "para_seq": null}}
{"text": "Dwelling at Savatthi ... \"Monks, the ending of the effluents is for one who knows & sees, I tell you, not for one who does not know & does not see. For one who knows what & sees what is there the ending of effluents? 'Such is form, such its origination, such its disappearance. Such is feeling, such its origination, such its disappearance. Such is perception, such its origination, such its disappearance. Such are fabrications, such their origination, such their disappearance. Such is consciousness, such its origination, such its disappearance.' The ending of the effluents is for one who knows in this way & sees in this way.", "entities": [[12, 20, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn12.023.than.html", "title": "Upanisa Sutta", "para_seq": null}}
{"text": "Staying at Savatthi. Then Ven. Bhumija, arising from his seclusion in the late afternoon, went to Ven. Sariputta . On arrival, he exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to Ven. Sariputta, \"Friend Sariputta, there are some brahmans & contemplatives, teachers of kamma, who declare that pleasure & pain are self-made. There are other brahmans & contemplatives, teachers of kamma, who declare that pleasure & pain are other-made. Then there are other brahmans & contemplatives, teachers of kamma, who declare that pleasure & pain are self-made & other-made. And then there are still other brahmans & contemplatives, teachers of kamma, who declare that pleasure & pain are neither self-made nor other-made, but arise spontaneously. In this case, friend Sariputta, what is the Blessed One's doctrine? What does he teach? Answering in what way will I speak in line with what the Blessed One has said, not misrepresent the Blessed One with what is unfactual, and answer in line with the Dhamma so that no one whose thinking is in line with the Dhamma will have grounds for criticism?\"", "entities": [[11, 19, "GPE"], [26, 38, "PERSON"], [98, 112, "PERSON"], [280, 294, "PERSON"], [304, 313, "PERSON"], [857, 866, "PERSON"], [880, 891, "PERSON"], [981, 992, "PERSON"], [1024, 1035, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn12.025.than.html", "title": "Bhumija Sutta", "para_seq": null}}
{"text": "On one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika 's monastery. There he addressed Ven. Sariputta , \"Sariputta, it is said in Ajita 's Question in the Way to the Further Shore: [1]", "entities": [[20, 31, "PERSON"], [49, 57, "GPE"], [61, 73, "LOC"], [75, 88, "PERSON"], [122, 136, "PERSON"], [140, 149, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn12.031.than.html", "title": "Bhutamidam Sutta", "para_seq": null}}
{"text": "Staying at Savatthi... [the Blessed One said,] \"From ignorance as a requisite condition come fabrications... From birth as a requisite condition, then aging-&-death, sorrow, lamentation, pain, distress, & despair come into play. Such is the origination of this entire mass of stress & suffering.\"", "entities": [[11, 19, "GPE"], [28, 39, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn12.035.than.html", "title": "Avijjapaccaya Sutta", "para_seq": null}}
{"text": "Staying at Savatthi... [the Blessed One said,] \"What one intends, what one arranges, and what one obsesses about: [1] This is a support for the stationing of consciousness. There being a support, there is a landing [or: an establishing] of consciousness. When that consciousness lands and grows, there is the production of renewed becoming in the future. When there is the production of renewed becoming in the future, there is future birth, aging & death, sorrow, lamentation, pain, distress, & despair. Such is the origination of this entire mass of suffering & stress.", "entities": [[11, 19, "GPE"], [28, 39, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn12.038.than.html", "title": "Cetana Sutta", "para_seq": null}}
{"text": "Dwelling at Savatthi ... Then a certain brahman went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there he said to the Blessed One: \"What now, Master Gotama: Is the one who acts the same one who experiences [the results of the act]?\"", "entities": [[12, 20, "GPE"], [60, 71, "PERSON"], [242, 253, "PERSON"], [273, 279, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn12.046.than.html", "title": "Aññatra Sutta", "para_seq": null}}
{"text": "Staying at Savatthi. Then a brahman cosmologist [1] went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to the Blessed One, \"Now, then, Master Gotama, does everything [2] exist?\"", "entities": [[11, 19, "GPE"], [64, 75, "PERSON"], [247, 258, "PERSON"], [279, 285, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn12.048.than.html", "title": "Lokayatika Sutta", "para_seq": null}}
{"text": "Dwelling at Savatthi . There the Blessed One said to the monks: \"In one who keeps focusing on the allure of clingable phenomena (or: phenomena that offer sustenance = the five aggregates), craving develops. From craving as a requisite condition comes clinging/sustenance. From clinging/sustenance as a requisite condition comes becoming. From becoming as a requisite condition comes birth. From birth as a requisite condition, then aging & death, sorrow, lamentation, pain, distress, & despair come into play. Such is the origin of this entire mass of suffering & stress.", "entities": [[12, 20, "GPE"], [33, 44, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn12.052.than.html", "title": "Upadana Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery. There he addressed the monks, \"Monks, an uninstructed run-of-the-mill person might grow disenchanted with this body composed of the four great elements, might grow dispassionate toward it, might gain release from it. Why is that? Because the growth & decline, the taking up & putting down of this body composed of the four great elements are apparent. Thus the uninstructed run-of-the-mill person might grow disenchanted, might grow dispassionate, might gain release there.", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [79, 91, "LOC"], [93, 106, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn12.061.than.html", "title": "Assutavā Sutta", "para_seq": null}}
{"text": "At Savatthi ... \"There are these four nutriments for the maintenance of beings who have come into being or for the support of those in search of a place to be born. Which four? Physical food, gross or refined; contact as the second, intellectual intention the third, and consciousness the fourth. These are the four nutriments for the maintenance of beings who have come into being or for the support of those in search of a place to be born.", "entities": [[3, 11, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn12.063.than.html", "title": "Puttamansa Sutta", "para_seq": null}}
{"text": "At Savatthi ... \"There are these four nutriments for the maintenance of beings who have come into being or for the support of those in search of a place to be born. Which four? Physical food, gross or refined; contact as the second, intellectual intention the third, and consciousness the fourth. These are the four nutriments for the maintenance of beings who have come into being or for the support of those in search of a place to be born.", "entities": [[3, 11, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn12.064.than.html", "title": "Atthi Raga Sutta", "para_seq": null}}
{"text": "Dwelling at Savatthi ... \"Monks, before my Awakening, when I was just an unawakened Bodhisatta, the realization came to me: 'How this world has fallen on difficulty! It is born, it ages, it dies, it falls away & rearises, but it does not discern the escape from this stress, from this aging & death. O when will it discern the escape from this stress, from this aging & death?'", "entities": [[12, 20, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn12.065.than.html", "title": "Nagara Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Rajagaha in the Bamboo Grove, the squirrels' sanctuary. Now at that time the Blessed One was worshipped, revered, honored, venerated, given homage — a recipient of robes, almsfood, lodgings, & medical requisites for the sick. The community of monks was also worshipped, revered, honored, venerated, given homage — a recipient of robes, almsfood, lodgings, & medical requisites for the sick. But the wanderers of other sects were not worshipped, revered, honored, venerated, or given homage, nor were they recipients of robes, almsfood, lodgings, or medical requisites for the sick.", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [83, 95, "LOC"], [144, 155, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn12.070.than.html", "title": "Susima Sutta", "para_seq": null}}
{"text": "Now at that time Susima the wanderer was living in Rajagaha with a large following of wanderers. And so Susima's following of wanderers said to him, \"Come now, friend Susima. Go live the holy life under Gotama the contemplative. When you have completely mastered the Dhamma, tell it to us; when we have completely mastered it, we will teach it to householders and then we, too, will be worshipped, revered, honored, venerated, given homage; we too will become recipients of robes, almsfood, lodgings, & medical requisites for the sick.\"", "entities": [[51, 59, "GPE"], [203, 209, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn12.070.than.html", "title": "Susima Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi at Jeta's Grove, Anathapindika's monastery. Then the Blessed One, picking up a little bit of dust with the tip of his fingernail, said to the monks, \"What do you think, monks? Which is greater: the little bit of dust I have picked up with the tip of my fingernail, or the great earth?\"", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [79, 91, "LOC"], [93, 106, "PERSON"], [129, 140, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn13.001.than.html", "title": "Nakhasikha Sutta", "para_seq": null}}
{"text": "Staying at Savatthi. \"Suppose, monks, that there were a pond fifty leagues wide, fifty leagues long, & fifty leagues deep, filled to overflowing with water so that a crow could drink from it, and a man would draw some water out of it with the tip of a blade of grass. What do you think? Which would be greater: the water drawn out with the tip of the blade of grass or the water in the pond?\"", "entities": [[11, 19, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn13.002.than.html", "title": "Pokkharani Sutta", "para_seq": null}}
{"text": "Staying at Savatthi. \"Suppose, monks, that the great ocean were to go to extinction, to its total end, except for two or three drops of water. What do you think? Which would be greater: the water in the great ocean that had gone to extinction, to its total end, or the two or three remaining drops of water?\"", "entities": [[11, 19, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn13.008.than.html", "title": "Samudda Sutta", "para_seq": null}}
{"text": "At Savatthi. \"Monks, there are these seven properties. Which seven? The property of light, the property of beauty, [1] the property of the dimension of the infinitude of space, the property of the dimension of the infinitude of consciousness, the property of the dimension of nothingness, the property of the dimension of neither perception nor non-perception, the property of the cessation of feeling & perception. These are the seven properties.\"", "entities": [[3, 11, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn14.011.than.html", "title": "Sattadhatu Sutta", "para_seq": null}}
{"text": "At Savatthi . There the Blessed One said: \"From an inconstruable beginning comes transmigration. A beginning point is not evident, though beings hindered by ignorance and fettered by craving are transmigrating & wandering on. What do you think, monks: Which is greater, the tears you have shed while transmigrating & wandering this long, long time — crying & weeping from being joined with what is displeasing, being separated from what is pleasing — or the water in the four great oceans?\"", "entities": [[3, 11, "GPE"], [24, 35, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn15.003.than.html", "title": "Assu Sutta", "para_seq": null}}
{"text": "At Savatthi . There the Blessed One said: \"From an inconstruable beginning comes transmigration. A beginning point is not evident, though beings hindered by ignorance and fettered by craving are transmigrating & wandering on. Just as a stick thrown up in the air lands sometimes on its base, sometimes on its side, sometimes on its tip; in the same way, beings hindered by ignorance and fettered by craving, transmigrating & wandering on, sometimes go from this world to another world, sometimes come from another world to this.", "entities": [[3, 11, "GPE"], [24, 35, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn15.009.than.html", "title": "Danda Sutta", "para_seq": null}}
{"text": "At Savatthi . There the Blessed One said: \"From an inconstruable beginning comes transmigration. A beginning point is not evident, though beings hindered by ignorance and fettered by craving are transmigrating & wandering on. When you see someone who has fallen on hard times, overwhelmed with hard times, you should conclude: 'We, too, have experienced just this sort of thing in the course of that long, long time.'", "entities": [[3, 11, "GPE"], [24, 35, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn15.011.than.html", "title": "Duggata Sutta", "para_seq": null}}
{"text": "At Savatthi . There the Blessed One said: \"From an inconstruable beginning comes transmigration. A beginning point is not evident, though beings hindered by ignorance and fettered by craving are transmigrating & wandering on. When you see someone who is happy & well-provided in life, you should conclude: 'We, too, have experienced just this sort of thing in the course of that long, long time.'", "entities": [[3, 11, "GPE"], [24, 35, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn15.012.than.html", "title": "Sukhita Sutta", "para_seq": null}}
{"text": "Now on that occasion the Blessed One was dwelling in Rajagaha , in the Bamboo Grove. Then thirty monks from Pava — all wilderness dwellers, all alms-goers, all triple-robe wearers, all still with fetters — went to the Blessed One and, on arrival, having bowed down to him, sat to one side.", "entities": [[25, 36, "PERSON"], [53, 61, "GPE"], [71, 83, "LOC"], [218, 229, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn15.013.than.html", "title": "Timsa Sutta", "para_seq": null}}
{"text": "At Savatthi . There the Blessed One said: \"From an inconstruable beginning comes transmigration. A beginning point is not evident, though beings hindered by ignorance and fettered by craving are transmigrating & wandering on. A being who has not been your mother at one time in the past is not easy to find... A being who has not been your father... your brother... your sister... your son... your daughter at one time in the past is not easy to find.", "entities": [[3, 11, "GPE"], [24, 35, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn15.014.than.html", "title": "Mata Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Rajagaha in the Bamboo Grove, the Squirrels' Sanctuary. Then Ven. Maha Kassapa went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there the Blessed One said to him, \"You are now old, Kassapa. Your robes made of cast-off hemp rags are heavy for you. So wear robes donated by householders, eat invitational meals, and live close by me.\"", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [83, 95, "LOC"], [101, 121, "LOC"], [158, 169, "PERSON"], [258, 269, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn16.005.than.html", "title": "Jinna Sutta", "para_seq": null}}
{"text": "On one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery. Then Ven. Maha Kassapa went to the Blessed One and on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the Blessed One, \"What is the cause, lord, what is the reason, why before there were fewer training rules and yet more monks established in final gnosis, whereas now there are more training rules and yet fewer monks established in final gnosis?\"", "entities": [[20, 31, "PERSON"], [49, 57, "GPE"], [61, 73, "LOC"], [75, 88, "PERSON"], [137, 148, "PERSON"], [247, 258, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn16.013.than.html", "title": "Saddhammapatirupaka Sutta", "para_seq": null}}
{"text": "Dwelling at Savatthi . \"Monks, gains, offerings, & fame are a cruel thing, a harsh, bitter obstacle to the attainment of the unexcelled rest from bondage. Suppose there were a beetle, a dung-eater, full of dung, gorged with dung, with a huge pile of dung in front of him. He, because of that, would look down on other beetles: 'Yes, sirree! I am a dung-eater, full of dung, gorged with dung, with a huge pile of dung in front of me!' In the same way, there is the case where a certain monk — conquered by gains, offerings, & fame, his mind consumed — puts on his robes and, carrying his bowl & outer robe, goes into a village or town for alms. Having eaten there as much as he likes — full of almsfood & invited again for the next day — he goes to the monastery and, in the midst of a group of monks, boasts, 'I have eaten as much as I like, I am full of almsfood & have been invited again for tomorrow. I am a recipient of robes, almsfood, lodgings, & medicinal requisites for curing illness. These other monks, though, have next to no merit, next to no influence. They aren't recipients of robes, almsfood, lodgings, & medicinal requisites for curing illness.' Conquered by gains, offerings, & fame, his mind consumed, he looks down on other well-behaved monks. That will be for this worthless man's long-term suffering & harm. That's how cruel gains, offerings, & fame are: a harsh, bitter obstacle to the attainment of the unexcelled rest from bondage.", "entities": [[12, 20, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn17.005.than.html", "title": "Pilahaka Sutta", "para_seq": null}}
{"text": "Staying at Savatthi. Then the Blessed One, picking up a little bit of dust with the tip of his fingernail, said to the monks, \"What do you think, monks? Which is greater: the little bit of dust I have picked up with the tip of my fingernail, or the great earth?\"", "entities": [[11, 19, "GPE"], [30, 41, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn20.002.than.html", "title": "Nakhasikha Sutta", "para_seq": null}}
{"text": "Staying at Savatthi. \"Monks, if someone were to give a gift of one hundred serving dishes [of food] in the morning, one hundred at mid-day, and one hundred in the evening; and another person were to develop a mind of good-will — even for the time it takes to pull on a cow's udder — in the morning, again at mid-day, and again in the evening, this [the second action] would be more fruitful than that [the first].", "entities": [[11, 19, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn20.004.than.html", "title": "Okkha Sutta", "para_seq": null}}
{"text": "Staying at Savatthi. \"Monks, suppose there were a sharp-bladed spear, and a man were to come along saying, 'With my hand or fist I will bend back this sharp-bladed spear, fold it in two, and roll it up.' What do you think? Would that man be able with his hand or fist to bend back that sharp-bladed spear, fold it in two, and roll it up?\"", "entities": [[11, 19, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn20.005.than.html", "title": "Satti Sutta", "para_seq": null}}
{"text": "Staying at Savatthi. \"Monks, suppose there were four strong archers — well-trained, practiced, & drilled — standing in the four directions, and a man were to come along saying, 'I will catch & bring down the arrows let fly by these four strong archers — well-trained, practiced, & drilled — before they have fallen to the ground.' What do you think? Would that be enough to call him a swift man, endowed with the foremost speed?\"", "entities": [[11, 19, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn20.006.than.html", "title": "Dhanuggaha Sutta", "para_seq": null}}
{"text": "Staying at Savatthi. \"Monks, there once was a time when the Dasarahas had a large drum called 'Summoner.' Whenever Summoner was split, the Dasarahas inserted another peg in it, until the time came when Summoner's original wooden body had disappeared and only a conglomeration of pegs remained. [1]", "entities": [[11, 19, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn20.007.than.html", "title": "Ani Sutta", "para_seq": null}}
{"text": "On one occasion the Blessed One was staying near Rajagaha in the Bamboo Grove, the squirrels' sanctuary. Now at that time a certain monk by the name of Elder [1] was one who lived alone and extolled the virtues of living alone. Alone he entered the village for alms, alone he returned, alone he sat withdrawn [in meditation], alone he did walking meditation.", "entities": [[20, 31, "PERSON"], [49, 57, "GPE"], [65, 77, "LOC"]], "meta": {"nikaya": "SN", "identifier": "sn21.010.than.html", "title": "Theranama Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion Ven. Maha Kaccana was staying in Avanti at Osprey's Haunt, on Sheer-face Peak. Then Haliddakani the householder went to him and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to Ven. Maha Kaccana: \"Venerable sir, this was said by the Blessed One in Magandiya's Questions in the Atthaka Vagga :", "entities": [[44, 51, "PERSON"], [67, 73, "GPE"], [263, 270, "PERSON"], [309, 320, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn22.003.than.html", "title": "Haliddakani Sutta", "para_seq": null}}
{"text": "At Savatthi . Then a certain monk went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there, he said to the Blessed One: \"It would be good, lord, if the Blessed One would teach me the Dhamma in brief such that, having heard the Dhamma from the Blessed One, I might dwell alone, secluded, heedful, ardent, & resolute.\"", "entities": [[3, 11, "GPE"], [46, 57, "PERSON"], [158, 169, "PERSON"], [203, 214, "PERSON"], [294, 305, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn22.036.than.html", "title": "Bhikkhu Sutta", "para_seq": null}}
{"text": "At Savatthi. \"For a monk practicing the Dhamma in accordance with the Dhamma, what accords with the Dhamma is this: that he keep cultivating disenchantment with regard to form, that he keep cultivating disenchantment with regard to feeling, that he keep cultivating disenchantment with regard to perception, that he keep cultivating disenchantment with regard to fabrications, that he keep cultivating disenchantment with regard to consciousness. As he keeps cultivating disenchantment with regard to form... feeling... perception... fabrications... consciousness, he comprehends form... feeling... perception... fabrications... consciousness. As he comprehends form... feeling... perception... fabrications... consciousness, he is totally released from form... feeling... perception... fabrications... consciousness. He is totally released from sorrows, lamentations, pains, distresses, & despairs. He is totally released, I tell you, from suffering & stress.\"", "entities": [[3, 11, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn22.039.than.html", "title": "Anudhamma Sutta", "para_seq": null}}
{"text": "At Savatthi. \"For a monk practicing the Dhamma in accordance with the Dhamma, what accords with the Dhamma is this: that he keep focused on inconstancy with regard to form, that he keep focused on inconstancy with regard to feeling, that he keep focused on inconstancy with regard to perception, that he keep focused on inconstancy with regard to fabrications, that he keep focused on inconstancy with regard to consciousness. As he keeps focusing on inconstancy with regard to form... feeling... perception... fabrications... consciousness, he comprehends form... feeling... perception... fabrications... consciousness. As he comprehends form... feeling... perception... fabrications... consciousness, he is totally released from form... feeling... perception... fabrications... consciousness. He is totally released from sorrows, lamentations, pains, distresses, & despairs. He is totally released, I tell you, from suffering & stress.\"", "entities": [[3, 11, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn22.040.than.html", "title": "Anudhamma Sutta", "para_seq": null}}
{"text": "At Savatthi. \"For a monk practicing the Dhamma in accordance with the Dhamma, what accords with the Dhamma is this: that he keep focused on stress with regard to form, that he keep focused on stress with regard to feeling, that he keep focused on stress with regard to perception, that he keep focused on stress with regard to fabrications, that he keep focused on stress with regard to consciousness. As he keeps focusing on stress with regard to form... feeling... perception... fabrications... consciousness, he comprehends form... feeling... perception... fabrications... consciousness. As he comprehends form... feeling... perception... fabrications... consciousness, he is totally released from form... feeling... perception... fabrications... consciousness. He is totally released from sorrows, lamentations, pains, distresses, & despairs. He is totally released, I tell you, from suffering & stress.\"", "entities": [[3, 11, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn22.041.than.html", "title": "Anudhamma Sutta", "para_seq": null}}
{"text": "At Savatthi. \"For a monk practicing the Dhamma in accordance with the Dhamma, what accords with the Dhamma is this: that he keep focused on not-self with regard to form, that he keep focused on not-self with regard to feeling, that he keep focused on not-self with regard to perception, that he keep focused on not-self with regard to fabrications, that he keep focused on not-self with regard to consciousness. As he keeps focusing on not-self with regard to form... feeling... perception... fabrications... consciousness, he comprehends form... feeling... perception... fabrications... consciousness. As he comprehends form... feeling... perception... fabrications... consciousness, he is totally released from form... feeling... perception... fabrications... consciousness. He is totally released from sorrows, lamentations, pains, distresses, & despairs. He is totally released, I tell you, from suffering & stress.\"", "entities": [[3, 11, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn22.042.than.html", "title": "Anudhamma Sutta", "para_seq": null}}
{"text": "At Savatthi . There the Blessed One said, \"Monks, whatever contemplatives or brahmans who assume in various ways when assuming a self, all assume the five clinging-aggregates, or a certain one of them. Which five? There is the case where an uninstructed, run-of-the-mill person — who has no regard for noble ones, is not well-versed or disciplined in their Dhamma; who has no regard for men of integrity, is not well-versed or disciplined in their Dhamma — assumes form (the body) to be the self, or the self as possessing form, or form as in the self, or the self as in form.", "entities": [[3, 11, "GPE"], [24, 35, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn22.047.than.html", "title": "Samanupassana Sutta", "para_seq": null}}
{"text": "At Savatthi . There the Blessed One said, \"One attached is unreleased; one unattached is released. Should consciousness, when standing, stand attached to (a physical) form, supported by form (as its object), [1] landing on form, watered with delight, it would exhibit growth, increase, & proliferation.", "entities": [[3, 11, "GPE"], [24, 35, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn22.053.than.html", "title": "Upaya Sutta", "para_seq": null}}
{"text": "At Savatthi . There the Blessed One exclaimed this exclamation: \"'It should not be, it should not occur to me; [1] it will not be, it will not occur to me': [2] a monk set on this would break the [five] lower fetters.\"", "entities": [[3, 11, "GPE"], [24, 35, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn22.055.than.html", "title": "Udana Sutta", "para_seq": null}}
{"text": "At Savatthi . There the Blessed One said, \"Monks, there are these five clinging-aggregates. Which five? Form as a clinging-aggregate, feeling as a clinging-aggregate, perception as a clinging-aggregate, fabrications as a clinging-aggregate, consciousness as an a clinging-aggregate.", "entities": [[3, 11, "GPE"], [24, 35, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn22.056.than.html", "title": "Parivatta Sutta", "para_seq": null}}
{"text": "At Savatthi... \"Monks, the Tathagata — the worthy one, the rightly self-awakened one, who from disenchantment with form, from dispassion, from cessation, from lack of clinging (for form) is released — is termed 'rightly self-awakened.' And a discernment-released monk — who from disenchantment with form, from dispassion, from cessation, from lack of clinging (for form) is released — is termed 'discernment-released.'", "entities": [[3, 11, "GPE"], [27, 36, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn22.058.than.html", "title": "Buddha Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Vesali, in the Great Wood, at the Hall of the Gabled Pavilion. Then Mahali the Licchavi went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the Blessed One, \" Purana Kassapa says this: 'There is no cause, no requisite condition, for the defilement of beings. Beings are defiled without cause, without requisite condition. There is no cause, no requisite condition, for the purification of beings. Beings are purified without cause, without requisite condition.' [1] What does the Blessed One say about this?\"", "entities": [[38, 49, "PERSON"], [67, 73, "GPE"], [167, 178, "PERSON"], [278, 289, "PERSON"], [293, 307, "PERSON"], [614, 625, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn22.060.than.html", "title": "Mahali Sutta", "para_seq": null}}
{"text": "At Savatthi . \"Monks, any brahmans or contemplatives who recollect their manifold past lives all recollect the five clinging-aggregates, or one among them. Which five? When recollecting, 'I was one with such a form in the past,' one is recollecting just form. Or when recollecting, 'I was one with such a feeling in the past,' one is recollecting just feeling. Or when recollecting, 'I was one with such a perception in the past,' one is recollecting just perception. Or when recollecting, 'I was one with such mental fabrications in the past,' one is recollecting just mental fabrications. Or when recollecting, 'I was one with such a consciousness in the past,' one is recollecting just consciousness.", "entities": [[3, 11, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn22.079.than.html", "title": "Khajjaniya Sutta", "para_seq": null}}
{"text": "On one occasion the Blessed One was staying among the Sakyans at Kapilavatthu in the Banyan Park. Then, after having dismissed the community of monks over a particular incident, he early in the morning put on his robes and, carrying his bowl and outer robe, went into Kapilavatthu for alms. After having gone for alms in Kapilavatthu, after his meal, returning from his almsround, he went to the Great Forest for the day's abiding. Plunging into the Great Forest, he sat down at the root of a beluva sapling as his day's abiding.", "entities": [[20, 31, "PERSON"], [65, 77, "GPE"], [268, 280, "GPE"], [321, 333, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn22.080.than.html", "title": "Pindolya Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Kosambi , at Ghosita 's monastery. Then in the early morning, having put on his robes and carrying his bowl and outer robe, he went into Kosambi for alms. Having gone for alms in Kosambi, after the meal, returning from his alms round, he set his own lodging in order and — without calling his attendant or informing the community of monks — set out wandering, alone & without a companion.", "entities": [[38, 49, "PERSON"], [67, 74, "GPE"], [204, 211, "GPE"], [246, 253, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn22.081.than.html", "title": "Parileyyaka Sutta", "para_seq": null}}
{"text": "At Savatthi. On that occasion Ven. Tissa, the Blessed One's paternal cousin, told a large number of monks, \"Friends, it's as if my body is drugged. I've lost my bearings. Things aren't clear to me. My mind keeps being overwhelmed with sloth & torpor. I lead the holy life dissatisfied. I have uncertainty about the teachings.\"", "entities": [[3, 11, "GPE"], [35, 40, "PERSON"], [46, 57, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn22.084.than.html", "title": "Tissa Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion Ven. Sariputta was staying near Savatthi at Jeta's Grove, Anathapindika 's monastery. Now, at that time this evil supposition had arisen to Ven. Yamaka : \"As I understand the Teaching explained by the Blessed One, a monk with no more (mental) effluents, on the break-up of the body, is annihilated, perishes, & does not exist after death.\" A large number of monks heard, \"They say that this evil supposition has arisen to Ven. Yamaka: 'As I understand the Teaching explained by the Blessed One, a monk with no more effluents, on the break-up of the body, is annihilated, perishes, & does not exist after death.'\" So they went to Ven. Yamaka and on arrival exchanged courteous greetings. After an exchange of friendly greetings & courtesies, they sat to one side. As they were sitting there, they said to Ven. Yamaka, \"Is it true, friend Yamaka, that this evil supposition has arisen to you: 'As I understand the Teaching explained by the Blessed One, a monk with no more effluents, on the break-up of the body, is annihilated, perishes, & does not exist after death.'", "entities": [[34, 48, "PERSON"], [66, 74, "GPE"], [78, 90, "LOC"], [92, 105, "PERSON"], [235, 246, "PERSON"], [516, 527, "PERSON"], [972, 983, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn22.085.than.html", "title": "Yamaka Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Vesali , in the Great Wood , at the Hall of the Gabled Pavilion. At that time Ven. Anuradha was staying not far from the Blessed One in a wilderness hut.", "entities": [[38, 49, "PERSON"], [67, 73, "GPE"], [188, 199, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn22.086.than.html", "title": "Anuradha Sutta", "para_seq": null}}
{"text": "On one occasion many elder monks were staying at Kosambi in Ghosita's Park. And at that time Ven. Khemaka was staying at the Jujube Tree Park, diseased, in pain, severely ill. Then in the late afternoon the elder monks left their seclusion and addressed Ven. Dasaka , [saying,] \"Come, friend Dasaka. Go to the monk Khemaka and on arrival say to him, 'The elders, friend Khemaka, say to you, \"We hope you are getting better, friend. We hope you are comfortable. We hope that your pains are lessening and not increasing. We hope that there are signs of their lessening, and not of their increasing.\"'\"", "entities": [[49, 56, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn22.089.than.html", "title": "Khemaka Sutta", "para_seq": null}}
{"text": "Then the thought occurred to Ven. Channa, \"This Ven. Ananda is staying at Kosambi in Ghosita's Park. He has been praised by the Teacher and is esteemed by his knowledgeable fellows in the holy life. He is capable of teaching me the Dhamma so that I might see the Dhamma, and I have sudden trust in him. Why don't I go to Ven. Ananda?\"", "entities": [[53, 59, "PERSON"], [74, 81, "GPE"], [326, 332, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn22.090.than.html", "title": "Channa Sutta", "para_seq": null}}
{"text": "So, setting his lodgings in order and carrying his robes & bowl, Ven. Channa went to Kosambi to where Ven. Ananda was staying in Ghosita's Park. On arrival, he exchanged courteous greetings with the Ven. Ananda. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he [told Ven. Ananda what had happened and added], \"May Ven. Ananda exhort me, may Ven. Ananda teach me, may Ven. Ananda give me a Dhamma talk so that I might see the Dhamma.\"", "entities": [[85, 92, "GPE"], [107, 113, "PERSON"], [204, 210, "PERSON"], [325, 331, "PERSON"], [372, 378, "PERSON"], [399, 405, "PERSON"], [425, 431, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn22.090.than.html", "title": "Channa Sutta", "para_seq": null}}
{"text": "At Savatthi . There the Blessed One said, \"Monks, suppose there were a river , flowing down from the mountains, going far, its current swift, carrying everything with it, and — holding on to both banks — kasa grasses, kusa grasses, reeds, birana grasses, & trees were growing. Then a man swept away by the current would grab hold of the kasa grasses, but they would tear away, and so from that cause he would come to disaster. He would grab hold of the kusa grasses... the reeds... the birana grasses... the trees, but they would tear away, and so from that cause he would come to disaster.", "entities": [[3, 11, "GPE"], [24, 35, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn22.093.than.html", "title": "Nadi Sutta", "para_seq": null}}
{"text": "At Savatthi . Sitting to one side, a monk said to the Blessed One, \"Lord, is there any form that is constant, lasting, eternal, not subject to change, that will stay just as it is as long as eternity? Is there any feeling... any perception... Are there any fabrications... Is there any consciousness that is constant, lasting, eternal, not subject to change, that will stay just as it is as long as eternity?\"", "entities": [[3, 11, "GPE"], [54, 65, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn22.097.than.html", "title": "Nakhasikha Sutta", "para_seq": null}}
{"text": "At Savatthi . There the Blessed One said: \"Monks, from an inconstruable beginning comes transmigration. A beginning point is not evident, although beings hindered by ignorance and fettered by craving are transmigrating & wandering on.", "entities": [[3, 11, "GPE"], [24, 35, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn22.099.than.html", "title": "Gaddula Sutta", "para_seq": null}}
{"text": "At Savatthi . There the Blessed One said: \"Monks, from an inconstruable beginning comes transmigration. A beginning point is not evident, although beings hindered by ignorance and fettered by craving are transmigrating & wandering on.", "entities": [[3, 11, "GPE"], [24, 35, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn22.100.than.html", "title": "Gaddula Sutta", "para_seq": null}}
{"text": "At Savatthi . There the Blessed One said, \"I tell you, monks: It is for one who knows & sees that there is the ending of the effluents. For one who knows what & sees what is there the ending of the effluents? 'Such is form, such its origination, such its passing away. Such is feeling... Such is perception... Such are fabrications... Such is consciousness, such its origination, such its passing away.' It is for one who knows & sees in this way that there is the ending of the effluents.", "entities": [[3, 11, "GPE"], [24, 35, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn22.101.than.html", "title": "Nava Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi at Jeta's Grove, Anathapindika's monastery. Then Ven. Radha went to the Blessed One and, on arrival, having bowed down to him sat to one side. As he was sitting there he said to the Blessed One: \"'A being,' lord. 'A being,' it's said. To what extent is one said to be 'a being'?\"", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [79, 91, "LOC"], [93, 106, "PERSON"], [148, 159, "PERSON"], [258, 269, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn23.002.than.html", "title": "Satta Sutta", "para_seq": null}}
{"text": "At Savatthi. \"Monks, eye-consciousness is inconstant, changeable, alterable. Ear-consciousness... Nose-consciousness... Tongue-consciousness... Body-consciousness... Intellect-consciousness is inconstant, changeable, alterable.", "entities": [[3, 11, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn25.003.than.html", "title": "Viññana Sutta", "para_seq": null}}
{"text": "At Savatthi. \"Monks, feeling born of eye-contact is inconstant, changeable, alterable. Feeling born of ear-contact... Feeling born of nose-contact... Feeling born of tongue-contact... Feeling born of body-contact... Feeling born of intellect-contact is inconstant, changeable, alterable.", "entities": [[3, 11, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn25.005.than.html", "title": "Vedana Sutta", "para_seq": null}}
{"text": "At Savatthi. \"Monks, perception of forms is inconstant, changeable, alterable. Perception of sounds... Perception of smells... Perception of tastes... Perception of tactile sensations... Perception of ideas is inconstant, changeable, alterable.", "entities": [[3, 11, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn25.006.than.html", "title": "Sañña Sutta", "para_seq": null}}
{"text": "At Savatthi. \"Monks, intention for forms is inconstant, changeable, alterable. Intention for sounds... Intention for smells... Intention for tastes... Intention for tactile sensations... Intention for ideas is inconstant, changeable, alterable.", "entities": [[3, 11, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn25.007.than.html", "title": "Cetana Sutta", "para_seq": null}}
{"text": "At Savatthi. \"Monks, craving for forms is inconstant, changeable, alterable. Craving for sounds... Craving for smells... Craving for tastes... Craving for tactile sensations... Craving for ideas is inconstant, changeable, alterable.", "entities": [[3, 11, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn25.008.than.html", "title": "Tanha Sutta", "para_seq": null}}
{"text": "At Savatthi. \"Monks, the earth property is inconstant, changeable, alterable. The liquid property... The fire property... The wind property... The space property... The consciousness property is inconstant, changeable, alterable.", "entities": [[3, 11, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn25.009.than.html", "title": "Dhatu Sutta", "para_seq": null}}
{"text": "At Savatthi. \"Monks, any desire-passion with regard to the eye is a defilement of the mind. Any desire-passion with regard to the ear... the nose... the tongue... the body... the intellect is a defilement of the mind. When, with regard to these six bases, the defilements of awareness are abandoned, then the mind is inclined to renunciation. The mind fostered by renunciation feels malleable for the direct knowing of those qualities worth realizing.\"", "entities": [[3, 11, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn27.001-010.than.html", "title": "Upakkilesa Samyutta", "para_seq": null}}
{"text": "At Savatthi. \"Monks, any desire-passion with regard to forms is a defilement of the mind. Any desire-passion with regard to sounds... aromas... flavors... tactile sensations... ideas is a defilement of the mind. When, with regard to these six bases, the defilements of awareness are abandoned, then the mind is inclined to renunciation. The mind fostered by renunciation feels malleable for the direct knowing of those qualities worth realizing.\"", "entities": [[3, 11, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn27.001-010.than.html", "title": "Upakkilesa Samyutta", "para_seq": null}}
{"text": "At Savatthi. \"Monks, any desire-passion with regard to eye-consciousness is a defilement of the mind. Any desire-passion with regard to ear-consciousness... nose-consciousness... tongue-consciousness... body-consciousness... intellect-consciousness is a defilement of the mind. When, with regard to these six bases, the defilements of awareness are abandoned, then the mind is inclined to renunciation. The mind fostered by renunciation feels malleable for the direct knowing of those qualities worth realizing.\"", "entities": [[3, 11, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn27.001-010.than.html", "title": "Upakkilesa Samyutta", "para_seq": null}}
{"text": "At Savatthi. \"Monks, any desire-passion with regard to contact at the eye is a defilement of the mind. Any desire-passion with regard to contact at the ear... contact at the nose... contact at the tongue... contact at the body... contact at the intellect is a defilement of the mind. When, with regard to these six bases, the defilements of awareness are abandoned, then the mind is inclined to renunciation. The mind fostered by renunciation feels malleable for the direct knowing of those qualities worth realizing.\"", "entities": [[3, 11, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn27.001-010.than.html", "title": "Upakkilesa Samyutta", "para_seq": null}}
{"text": "At Savatthi. \"Monks, any desire-passion with regard to feeling born of contact at the eye is a defilement of the mind. Any desire-passion with regard to feeling born of contact at the ear... feeling born of contact at the nose... feeling born of contact at the tongue... feeling born of contact at the body... feeling born of contact at the intellect is a defilement of the mind. When, with regard to these six bases, the defilements of awareness are abandoned, then the mind is inclined to renunciation. The mind fostered by renunciation feels malleable for the direct knowing of those qualities worth realizing.\"", "entities": [[3, 11, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn27.001-010.than.html", "title": "Upakkilesa Samyutta", "para_seq": null}}
{"text": "At Savatthi. \"Monks, any desire-passion with regard to perception (naming, labeling) of forms is a defilement of the mind. Any desire-passion with regard to perception of sounds... perception of aromas... perception of flavors... perception of tactile sensations... perception of ideas is a defilement of the mind. When, with regard to these six bases, the defilements of awareness are abandoned, then the mind is inclined to renunciation. The mind fostered by renunciation feels malleable for the direct knowing of those qualities worth realizing.\"", "entities": [[3, 11, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn27.001-010.than.html", "title": "Upakkilesa Samyutta", "para_seq": null}}
{"text": "At Savatthi. \"Monks, any desire-passion with regard to intentions involving forms is a defilement of the mind. Any desire-passion with regard to intentions involving sounds... intentions involving aromas... intentions involving flavors... intentions involving tactile sensations... intentions involving ideas is a defilement of the mind. When, with regard to these six bases, the defilements of awareness are abandoned, then the mind is inclined to renunciation. The mind fostered by renunciation feels malleable for the direct knowing of those qualities worth realizing.\"", "entities": [[3, 11, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn27.001-010.than.html", "title": "Upakkilesa Samyutta", "para_seq": null}}
{"text": "At Savatthi. \"Monks, any desire-passion with regard to craving for forms is a defilement of the mind. Any desire-passion with regard to craving for sounds... craving for aromas... craving for flavors... craving for tactile sensations... craving for ideas is a defilement of the mind. When, with regard to these six bases, the defilements of awareness are abandoned, then the mind is inclined to renunciation. The mind fostered by renunciation feels malleable for the direct knowing of those qualities worth realizing.\"", "entities": [[3, 11, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn27.001-010.than.html", "title": "Upakkilesa Samyutta", "para_seq": null}}
{"text": "At Savatthi. \"Monks, any desire-passion with regard to the earth property is a defilement of the mind. Any desire-passion with regard to the liquid property... the fire property... the wind property... the space property... the consciousness property is a defilement of the mind. When, with regard to these six bases, the defilements of awareness are abandoned, then the mind is inclined to renunciation. The mind fostered by renunciation feels malleable for the direct knowing of those qualities worth realizing.\"", "entities": [[3, 11, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn27.001-010.than.html", "title": "Upakkilesa Samyutta", "para_seq": null}}
{"text": "At Savatthi. \"Monks, any desire-passion with regard to form is a defilement of the mind. Any desire-passion with regard to feeling... perception... fabrications... consciousness is a defilement of the mind. When, with regard to these five bases, the defilements of awareness are abandoned, then the mind is inclined to renunciation. The mind fostered by renunciation feels malleable for the direct knowing of those qualities worth realizing.\"", "entities": [[3, 11, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn27.001-010.than.html", "title": "Upakkilesa Samyutta", "para_seq": null}}
{"text": "At Savatthi . Then Ven. Migajala went to the Blessed One and on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the Blessed One: \"'A person living alone. A person living alone,' thus it is said. To what extent, lord, is one a person living alone, and to what extent is one a person living with a companion?\"", "entities": [[3, 11, "GPE"], [45, 56, "PERSON"], [155, 166, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn35.063.than.html", "title": "Migajala Sutta", "para_seq": null}}
{"text": "Once Ven. Sariputta and Ven. Upasena were staying near Rajagaha in the Cool Forest, at Snakeshood Grotto. Then it so happened that a snake fell on Ven. Upasena's body [and bit him]. Then Ven. Upasena said to the monks, \"Quick, friends, lift this body of mine onto a couch and carry it outside before it is scattered like a fistful of chaff!\"", "entities": [[5, 19, "PERSON"], [55, 63, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn35.069.than.html", "title": "Upasena Sutta", "para_seq": null}}
{"text": "At Savatthi. Then a certain monk went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the Blessed One, \"Lord, in such and such a dwelling a certain monk — newly ordained, not well known — is diseased, in pain, severely ill. It would be good if the Blessed One would visit the monk, out of sympathy for him.\"", "entities": [[3, 11, "GPE"], [45, 56, "PERSON"], [156, 167, "PERSON"], [314, 325, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn35.074.than.html", "title": "Gilana Sutta", "para_seq": null}}
{"text": "At Savatthi. Then a certain monk went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the Blessed One, \"Lord, in such and such a dwelling a certain monk — newly ordained, not well known — is diseased, in pain, severely ill. It would be good if the Blessed One would visit the monk, out of sympathy for him.\"", "entities": [[3, 11, "GPE"], [45, 56, "PERSON"], [156, 167, "PERSON"], [314, 325, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn35.075.than.html", "title": "Gilana Sutta", "para_seq": null}}
{"text": "On one occasion Ven. Pindola Bharadvaja was staying in Kosambi at Ghosita's monastery . Then King Udena went to him and, on arrival, exchanged courteous greetings with him. After this exchange of friendly greetings & courtesies, the king sat to one side. As he was sitting there he said to Ven. Pindola Bharadvaja: \"What is the reason, master Bharadvaja, what is the cause why young monks — black-haired, endowed with the blessings of youth in the first stage of life — without having played with sensual pleasures nevertheless follow the lifelong chaste life, perfect & pure, and make it last their entire lives?\"", "entities": [[55, 62, "GPE"], [66, 85, "LOC"]], "meta": {"nikaya": "SN", "identifier": "sn35.127.than.html", "title": "Bharadvaja Sutta", "para_seq": null}}
{"text": "On one occasion Ven. Ananda and Ven. Udayin were staying near Kosambi in Ghosita's Park. Then in the evening, Ven. Udayin emerged from his seclusion and went to Ven. Ananda and exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to Ven. Ananda, \"In many ways the body has been pointed out, revealed, and announced by the Blessed One [with these words]: 'For this reason the body is not-self. Can consciousness in the same way be declared, taught, described, set forth, revealed, explained, & made plain [with these words]: 'For this reason consciousness is not-self'?\"", "entities": [[21, 27, "PERSON"], [62, 69, "GPE"], [166, 172, "PERSON"], [332, 338, "PERSON"], [416, 427, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn35.193.than.html", "title": "Udayin Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove. Then he addressed the monks, \"Monks, suppose there were four vipers of utmost heat & horrible venom. Then a man would come along — desiring life, desiring not to die, desiring happiness, & loathing pain — and people would tell him: 'Good man, these four vipers, of utmost heat & horrible venom, are yours. Time after time they must be lifted up, time after time they must be bathed, time after time they must be fed, time after time put to rest. And if any of these vipers ever gets angered with you, then you will meet with death or death-like suffering. Do what you think should be done.'", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [79, 91, "LOC"]], "meta": {"nikaya": "SN", "identifier": "sn35.197.than.html", "title": "Asivisa Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying among the Sakyans at Kapilavatthu in the Banyan Park. Now at that time a new reception hall [1] had just been built by the Kapilavatthu Sakyans, and it had not yet been dwelled in by any contemplative, brahman, or anyone at all in human form. So the Kapilavatthu Sakyans went to the Blessed One and, on arrival, having bowed down, sat to one side. As they were sitting there they said to him, \"Lord, a new reception hall has just been built by the Kapilavatthu Sakyans, and it has not yet been dwelled in by any contemplative, brahman, or anyone at all in human form. May the Blessed One be the first to use it. When the Blessed One has used it first, the Kapilavatthu Sakyans will use it afterwards. That will be for their long-term welfare & happiness.\"", "entities": [[38, 49, "PERSON"], [83, 95, "GPE"], [185, 197, "GPE"], [312, 324, "GPE"], [345, 356, "PERSON"], [510, 522, "GPE"], [638, 649, "PERSON"], [683, 694, "PERSON"], [718, 730, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn35.202.than.html", "title": "Avassuta Sutta", "para_seq": null}}
{"text": "The Blessed One acquiesced with silence. Sensing his acquiescence, the Kapilavatthu Sakyans got up from their seats, bowed down to him, circumambulated him, and then went to the new reception hall. On arrival, they spread it all over with felt rugs, arranged seats, set out a water vessel, and raised an oil lamp. Then they went to the Blessed One and, on arrival, having bowed down, stood to one side. As they were standing there they said to him, \"Lord, the reception hall has been covered all over with felt rugs, seats have been arranged, a water vessel has been set out, and an oil lamp raised. It is now time for the Blessed One to do as he sees fit.\"", "entities": [[4, 15, "PERSON"], [71, 83, "GPE"], [336, 347, "PERSON"], [623, 634, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn35.202.than.html", "title": "Avassuta Sutta", "para_seq": null}}
{"text": "So the Blessed One, putting on his robe and taking up his bowl & outer robe, went together with a community of monks to the reception hall. On arrival he washed his feet, entered the hall, and sat with his back to the central post, facing east. The community of monks washed their feet, entered the hall, and sat with their backs to the western wall, facing east, ranged around the Blessed One. The Kapilavatthu Sakyans washed their feet, entered the hall, and sat with their backs to the eastern wall, facing west, ranged around the Blessed One. Then the Blessed One — having spent most of the night instructing, urging, rousing, & encouraging the Kapilavatthu Sakyans with a Dhamma talk — dismissed them, saying, \"The night is far past, Gotamas. Do what you now think it is time to do.\"", "entities": [[7, 18, "PERSON"], [382, 393, "PERSON"], [399, 411, "GPE"], [534, 545, "PERSON"], [556, 567, "PERSON"], [649, 661, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn35.202.than.html", "title": "Avassuta Sutta", "para_seq": null}}
{"text": "Then not long after the Kapilavatthu Sakyans had left, the Blessed One addressed Ven. Maha Moggallana: \"Moggallana, the community of monks is free of drowsiness. Give them a Dhamma talk of your own devising. My back aches. I will rest it.\"", "entities": [[24, 36, "GPE"], [59, 70, "PERSON"], [91, 101, "PERSON"], [104, 114, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn35.202.than.html", "title": "Avassuta Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Vesali , in the Great Forest, at the Gabled Pavilion. Then, in the late afternoon, he left his seclusion and went to the sick ward and on arrival sat down on a prepared seat. As he was sitting there, he addressed the monks: \"A monk should approach the time of death mindful & alert. This is our instruction to you all.", "entities": [[38, 49, "PERSON"], [67, 73, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn36.007.than.html", "title": "Gelañña Sutta", "para_seq": null}}
{"text": "On one occasion the Blessed One was dwelling near Rajagaha in the Bamboo Grove Monastery, the Squirrel's Feeding Place. There Moliyasivaka the wanderer went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to the Blessed One, \"Master Gotama, there are some brahmans & contemplatives who are of this doctrine, this view: Whatever an individual feels — pleasure, pain, neither-pleasure-nor-pain — is entirely caused by what was done before. Now what does Master Gotama say to that?\"", "entities": [[20, 31, "PERSON"], [50, 58, "GPE"], [66, 78, "LOC"], [164, 175, "PERSON"], [347, 358, "PERSON"], [368, 374, "PERSON"], [594, 600, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn36.021.than.html", "title": "Sivaka Sutta", "para_seq": null}}
{"text": "On one occasion Ven. Sariputta was staying in Magadha in Nalaka Village . Then Jambukhadika the wanderer went to Ven. Sariputta and, on arrival, exchanged courteous greetings with him. After this exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there he said to Ven. Sariputta: \"'Stress, stress,' it is said, my friend Sariputta. Which type of stress [are they referring to]?\"", "entities": [[16, 30, "PERSON"], [46, 53, "GPE"], [113, 127, "PERSON"], [296, 310, "PERSON"], [353, 362, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn38.014.than.html", "title": "Dukkha Sutta", "para_seq": null}}
{"text": "On one occasion the Blessed One was staying near Nalanda in the Pavarika Mango Grove . Then Asibandhakaputta the headman went to the Blessed One and on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the Blessed One: \"The brahmans of the Western lands, lord — those who carry water pots, wear garlands of water plants, purify with water, & worship fire — can take [the spirit of] a dead person, lift it out, instruct it, & send it to heaven. But the Blessed One, worthy & rightly self-awakened, can arrange it so that all the world, at the break-up of the body, after death, reappears in a good destination, the heavenly world.\"", "entities": [[20, 31, "PERSON"], [49, 56, "GPE"], [133, 144, "PERSON"], [243, 254, "PERSON"], [489, 500, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn42.006.than.html", "title": "Paccha-bhumika Sutta", "para_seq": null}}
{"text": "On one occasion the Blessed One was staying near Nalanda in the Pavarika Mango Grove . Then Asibandhakaputta the headman, a disciple of the Niganthas , went to the Blessed One and on arrival, having bowed down to him, sat to one side. As he was sitting there the Blessed One said to him: \"Headman, how does Nigantha Nataputta teach the Dhamma to his disciples?\"", "entities": [[20, 31, "PERSON"], [49, 56, "GPE"], [164, 175, "PERSON"], [263, 274, "PERSON"], [307, 325, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn42.008.than.html", "title": "Sankha Sutta", "para_seq": null}}
{"text": "Now at that time Nalanda was in the midst of famine, a time of scarcity, the crops white with blight and turned to straw. And at that time Nigantha Nataputta was staying in Nalanda together with a large following of niganthas. Then Asibandhakaputta the headman, a disciple of the niganthas, went to Nigantha Nataputta and, on arrival, having bowed down to him, sat to one side. As he was sitting there, Nigantha Nataputta said to him, \"Come, now, headman. Refute the words of Gotama the contemplative, and this admirable report about you will spread afar: 'The words of Gotama the contemplative — so mighty, so powerful — were refuted by Asibandhakaputta the headman!'\"", "entities": [[17, 24, "GPE"], [139, 157, "PERSON"], [173, 180, "GPE"], [299, 317, "PERSON"], [403, 421, "PERSON"], [476, 482, "PERSON"], [570, 576, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn42.009.than.html", "title": "Kula Sutta", "para_seq": null}}
{"text": "\"Come now, headman. Go to Gotama the contemplative and on arrival say this: 'Venerable sir, doesn't the Blessed One in many ways praise kindness, protection, & sympathy for families?' If Gotama the contemplative, thus asked, answers, 'Yes, headman, the Tathagata in many ways praises kindness, protection, & sympathy for families,' then you should say, 'Then why, venerable sir, is the Blessed One, together with a large community of monks, wandering on tour around Nalanda in the midst of famine, a time of scarcity, when the crops are white with blight and turned to straw? The Blessed One is practicing for the ruin of families. The Blessed One is practicing for the demise of families. The Blessed One is practicing for the downfall of families.' When Gotama the contemplative is asked this two-pronged question by you, he won't be able to swallow it down or spit it up.\"", "entities": [[26, 32, "PERSON"], [104, 115, "PERSON"], [187, 193, "PERSON"], [253, 262, "PERSON"], [386, 397, "PERSON"], [466, 473, "GPE"], [580, 591, "PERSON"], [636, 647, "PERSON"], [694, 705, "PERSON"], [756, 762, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn42.009.than.html", "title": "Kula Sutta", "para_seq": null}}
{"text": "\"Then why, venerable sir, is the Blessed One, together with a large community of monks, wandering on tour around Nalanda in the midst of famine, a time of scarcity, when the crops are white with blight and turned to straw? The Blessed One is practicing for the ruin of families. The Blessed One is practicing for the demise of families. The Blessed One is practicing for the downfall of families.\"", "entities": [[33, 44, "PERSON"], [113, 120, "GPE"], [227, 238, "PERSON"], [283, 294, "PERSON"], [341, 352, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn42.009.than.html", "title": "Kula Sutta", "para_seq": null}}
{"text": "On one occasion the Blessed One was staying near Rajagaha at the Squirrels' Sanctuary. Now at that time, when the king's assembly had gathered and was sitting together in the royal palace, this topic of conversation arose: \"Money [1] is allowable for the Sakyan-son contemplatives. The Sakyan-son contemplatives consent to money. The Sakyan-son contemplatives accept money.\"", "entities": [[20, 31, "PERSON"], [49, 57, "GPE"], [65, 85, "LOC"]], "meta": {"nikaya": "SN", "identifier": "sn42.010.than.html", "title": "Maniculaka Sutta", "para_seq": null}}
{"text": "On one occasion the Blessed One was staying near Savatthi at Jeta's Grove, Anathapindika's monastery . And on that occasion the bhikkhuni Khema, wandering on tour among the Kosalans, had taken up residence between Savatthi and Saketa at Toranavatthu . Then King Pasenadi Kosala , while traveling from Saketa to Savatthi, took up a one-night residence between Savatthia and Saketa at Toranavatthu. Then he addressed a certain man, \"Come, now, my good man. Find out if in Toranavatthu there's the sort of brahman or contemplative I might visit today.\"", "entities": [[20, 31, "PERSON"], [49, 57, "GPE"], [61, 73, "LOC"], [75, 88, "PERSON"], [214, 222, "GPE"], [227, 233, "GPE"], [257, 277, "PERSON"], [301, 307, "GPE"], [311, 319, "GPE"], [373, 379, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn44.001.than.html", "title": "Khema Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Vesali , in the Great Wood , at the Hall of the Gabled Pavilion. At that time Ven. Anuradha was staying not far from the Blessed One in a wilderness hut.", "entities": [[38, 49, "PERSON"], [67, 73, "GPE"], [188, 199, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn44.002.than.html", "title": "Anuradha Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying in Rajagaha in the Bamboo Grove, the Squirrels' Sanctuary. And on that occasion Ven. Maha Kassapa was staying in the Pepper Tree Cave, diseased, in pain, severely ill. Then the Blessed One, in the late afternoon, left his seclusion and went to where Ven. Maha Kassapa was staying. On arrival, he sat down on a prepared seat and said to Ven. Maha Kassapa, \"I hope you are getting better, Kassapa. I hope you are comfortable. I hope that your pains are lessening and not increasing. I hope that there are signs of their lessening, and not of their increasing.\"", "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [81, 93, "LOC"], [99, 119, "LOC"], [239, 250, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn46.014.than.html", "title": "Gilana Sutta", "para_seq": null}}
{"text": "On one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery. Then, early in the morning, a large number of monks adjusted their under robes and — carrying their bowls & robes — went into Savatthi for alms. Then the thought occurred to them, \"It's still too early to go for alms in Savatthi. Why don't we go to the park of the wanderers of other sects?\"", "entities": [[20, 31, "PERSON"], [49, 57, "GPE"], [61, 73, "LOC"], [75, 88, "PERSON"], [228, 236, "GPE"], [322, 330, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn46.053.than.html", "title": "Aggi Sutta", "para_seq": null}}
{"text": "So, having gone for alms in Savatthi, after the meal, returning from their alms round, the monks went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As they were sitting there they [told him what had happened.]", "entities": [[28, 36, "GPE"], [109, 120, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn46.053.than.html", "title": "Aggi Sutta", "para_seq": null}}
{"text": "On one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika 's monastery. Now at that time Ven. Sariputta was staying among the Magadhans in Nalaka village — diseased, in pain, severely ill. Cunda the novice was his attendant. Then, because of that illness, Ven. Sariputta attained total Unbinding.", "entities": [[20, 31, "PERSON"], [49, 57, "GPE"], [61, 73, "LOC"], [75, 88, "PERSON"], [120, 134, "PERSON"], [220, 225, "PERSON"], [287, 301, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn47.013.than.html", "title": "Cunda Sutta", "para_seq": null}}
{"text": "So Cunda the novice, taking Ven. Sariputta's bowl & robes, went to Ven. Ananda in Jeta's Grove, Anathapindika's monastery, near Savatthi, and on arrival, having bowed down to him, sat to one side. As he was sitting there he said to Ven. Ananda: \"Venerable sir, Ven. Sariputta has attained total Unbinding. Here are his bowl & robes.\"", "entities": [[3, 8, "PERSON"], [28, 42, "PERSON"], [72, 78, "PERSON"], [82, 94, "LOC"], [96, 109, "PERSON"], [128, 136, "GPE"], [237, 243, "PERSON"], [261, 275, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn47.013.than.html", "title": "Cunda Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi in the Eastern Monastery, the palace of Migara's mother. Now on that occasion the Blessed One, on emerging from seclusion in the late afternoon, sat warming his back in the western sun. Then Ven. Ananda went to the Blessed One and, on arrival, having bowed down to the Blessed One, massaged the Blessed One's limbs with his hand and said, \" It's amazing , lord. It's astounding, how the Blessed One's complexion is no longer so clear & bright; his limbs are flabby & wrinkled; his back, bent forward; there's a discernible change in his faculties — the faculty of the eye, the faculty of the ear, the faculty of the nose, the faculty of the tongue, the faculty of the body.\"", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [158, 169, "PERSON"], [272, 278, "PERSON"], [291, 302, "PERSON"], [345, 356, "PERSON"], [371, 382, "PERSON"], [463, 474, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn48.041.than.html", "title": "Jara Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying in Savatthi , at the Eastern Gatehouse. There he addressed Ven. Sariputta : \"Sariputta, do you take it on conviction that the faculty of conviction, when developed & pursued, gains a footing in the Deathless, has the Deathless as its goal & consummation? Do you take it on conviction that the faculty of persistence... mindfulness... concentration... discernment, when developed & pursued, gains a footing in the Deathless, has the Deathless as its goal & consummation?\"", "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [121, 135, "PERSON"], [139, 148, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn48.044.than.html", "title": "Pubbakotthaka Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying in Kosambi , at Ghosita's Park . There he addressed the monks, \"Monks, is there a manner of reckoning whereby a monk who is a learner, standing at the level of a learner, can discern that 'I am a learner,' and whereby a monk who is an adept, [1] standing at the level of an adept, can discern that 'I am an adept'?\"", "entities": [[38, 49, "PERSON"], [65, 72, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn48.053.than.html", "title": "Sekha Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion Ven. Ananda was staying in Kosambi , at Ghosita 's Park. Then the Brahman Unnabha went to where Ven. Ananda was staying and on arrival greeted him courteously. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to Ven. Ananda: \"Master Ananda, what is the aim of this holy life lived under Gotama the contemplative?\"", "entities": [[39, 45, "PERSON"], [61, 68, "GPE"], [135, 141, "PERSON"], [309, 315, "PERSON"], [325, 331, "PERSON"], [379, 385, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn51.015.than.html", "title": "Brahmana Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion Ven. Anuruddha was staying near Savatthi in the Dark Forest — diseased, in pain, severely ill. Then a large number of monks went to Ven. Anuruddha and on arrival said to him, \"What dwelling [1] are you dwelling in so that the pains that have arisen in the body do not invade or remain in the mind?\"", "entities": [[39, 48, "PERSON"], [66, 74, "GPE"], [171, 180, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn52.010.than.html", "title": "Gilana Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Vesali in the Great Wood, at the Gabled Hall. Now on that occasion the Blessed One, with many lines of reasoning, was giving the monks a talk on the unattractiveness [of the body], was speaking in praise of [the perception of] unattractiveness, was speaking in praise of the development of [the perception of] unattractiveness. Then the Blessed One addressed the monks: \"Monks, I wish to go into seclusion for half a month. I am not to be approached by anyone at all except for the one who brings almsfood.\"", "entities": [[38, 49, "PERSON"], [67, 73, "GPE"], [138, 149, "PERSON"], [404, 415, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn54.009.than.html", "title": "Vesali Sutta", "para_seq": null}}
{"text": "\"As you say, lord,\" Ven. Ananda responded. When he had gathered in the assembly hall all the monks who lived in dependence on Vesali, he went to the Blessed One and said, \"The community of monks is gathered, lord. Now is the time to do as the Blessed One sees fit.\"", "entities": [[25, 31, "PERSON"], [126, 132, "GPE"], [149, 160, "PERSON"], [243, 254, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn54.009.than.html", "title": "Vesali Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery . Then Ven. Ananda went to the Blessed One and, on arrival, bowed down to him and sat to one side. As he was sitting there he addressed the Blessed One, saying, \"Is there one quality that, when developed & pursued, brings four qualities to completion? And four qualities that, when developed & pursued, bring seven qualities to completion? And seven qualities that, when developed & pursued, bring two qualities to completion?\"", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [79, 91, "LOC"], [93, 106, "PERSON"], [131, 137, "PERSON"], [150, 161, "PERSON"], [259, 270, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn54.013.than.html", "title": "Ananda Sutta", "para_seq": null}}
{"text": "At Savatthi . There the Blessed One said, \"Monks, even though a wheel-turning emperor, having exercised sovereign lordship over the four continents, on the break-up of the body, after death, reappears in the good destination, the heavenly world, in the company of the devas of the Thirty-three, and enjoys himself there in the Nandana grove , surrounded by a consort of nymphs, supplied and endowed with the five strings of heavenly sensual pleasure, still — because he is not endowed with four qualities — he is not freed from [the possibility of going to] hell, not freed from the animal womb, not freed from the realm of hungry shades, not freed from the plane of deprivation, the bad destinations, the lower realms.", "entities": [[3, 11, "GPE"], [24, 35, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn55.001.than.html", "title": "Raja Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying among the Sakyans near Kapilavatthu in Nigrodha's Park. Then Mahanama the Sakyan went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there, he said to the Blessed One, \"Lord, this Kapilavatthu is rich & prosperous, populous & crowded, its alleys congested. Sometimes, when I enter Kapilavatthu in the evening after visiting with the Blessed One or with the monks who inspire the mind, I meet up with a runaway elephant, a runaway horse, a runaway chariot, a runaway cart, or a runaway person. At times like that my mindfulness with regard to the Blessed One gets muddled, my mindfulness with regard to the Dhamma... the Sangha gets muddled. The thought occurs to me, 'If I were to die at this moment, what would be my destination? What would be my future course?\"", "entities": [[38, 49, "PERSON"], [85, 97, "GPE"], [155, 166, "PERSON"], [267, 278, "PERSON"], [292, 304, "GPE"], [393, 405, "GPE"], [445, 456, "PERSON"], [658, 669, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn55.021.than.html", "title": "Mahanama Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying among the Sakyans near Kapilavatthu in Nigrodha's Park. Then Mahanama the Sakyan went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there, he said to the Blessed One, \"Lord, this Kapilavatthu is rich & prosperous, populous & crowded, its alleys congested. Sometimes, when I enter Kapilavatthu in the evening after visiting with the Blessed One or with the monks who inspire the mind, I meet up with a runaway elephant, a runaway horse, a runaway chariot, a runaway cart, or a runaway person. At times like that my mindfulness with regard to the Blessed One gets muddled, my mindfulness with regard to the Dhamma... the Sangha gets muddled. The thought occurs to me, 'If I were to die at this moment, what would be my destination? What would be my future course?\"", "entities": [[38, 49, "PERSON"], [85, 97, "GPE"], [155, 166, "PERSON"], [267, 278, "PERSON"], [292, 304, "GPE"], [393, 405, "GPE"], [445, 456, "PERSON"], [658, 669, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn55.022.than.html", "title": "Mahanama Sutta", "para_seq": null}}
{"text": "On one occasion the Blessed One was staying near Vesali in the Gabled Hall in the Great Forest. Then Nandaka , the chief minister of the Licchavis , went to the Blessed One and on arrival, having bowed down to him, sat to one side. As he was sitting there the Blessed One said to him: \"Nandaka, a disciple of the noble ones endowed with four qualities is a stream-winner, steadfast, never again destined for states of woe, headed for self-awakening. Which four?", "entities": [[20, 31, "PERSON"], [49, 55, "GPE"], [137, 146, "NORP"], [161, 172, "PERSON"], [260, 271, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn55.030.than.html", "title": "Licchavi Sutta", "para_seq": null}}
{"text": "On one occasion the Blessed One was staying among the Sakyans near Kapilavatthu in Nigrodha's Park. Then Nandiya the Sakyan went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the Blessed One, \"Lord, the disciple of the noble ones in whom the factors of stream entry are altogether & in every way lacking: Is he called a disciple of the noble ones who lives heedlessly?\"", "entities": [[20, 31, "PERSON"], [67, 79, "GPE"], [136, 147, "PERSON"], [247, 258, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn55.040.than.html", "title": "Nandiya Sutta", "para_seq": null}}
{"text": "On one occasion the Blessed One was staying among the Sakyans at Kapilavatthu in the Banyan Park. Now at that time many monks were at work making robes for the Blessed One, [thinking,] \"When the robes are finished, at the end of the three months, the Blessed One will set out wandering.\"", "entities": [[20, 31, "PERSON"], [65, 77, "GPE"], [160, 171, "PERSON"], [251, 262, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn55.054.than.html", "title": "Gilana Sutta", "para_seq": null}}
{"text": "Once the Blessed One was staying at Kosambi in the simsapa [1] forest. Then, picking up a few simsapa leaves with his hand, he asked the monks, \"What do you think, monks: Which are more numerous, the few simsapa leaves in my hand or those overhead in the simsapa forest?\"", "entities": [[9, 20, "PERSON"], [36, 43, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn56.031.than.html", "title": "Simsapa Sutta", "para_seq": null}}
{"text": "On one occasion the Blessed One was staying near Vesali at the Gabled Hall in the Great Forest. Then in the early morning, Ven. Ananda , having put on his robe and carrying his bowl and outer robe, went into Vesali for alms. He saw a large number of Licchavi boys practicing archery in the stadium building. From a distance they were shooting arrows through a tiny keyhole without missing, one right after the other. On seeing this, the thought occurred to him, \"How trained these Licchavi boys are, how well-trained these Licchavi boys are, in that from a distance they can shoot arrows through a tiny keyhole without missing, one right after the other!\"", "entities": [[20, 31, "PERSON"], [49, 55, "GPE"], [128, 134, "PERSON"], [208, 214, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn56.045.than.html", "title": "Vala Sutta", "para_seq": null}}
{"text": "Then, having gone for alms in Vesali, after his meal, returning from his alms round, Ven. Ananda went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there, he said to the Blessed One: \"Just now, lord, in the early morning, having put on my robe and carrying my bowl and outer robe, I went into Vesali for alms. I saw a large number of Licchavi boys practicing archery in the stadium building. From a distance they were shooting arrows through a tiny keyhole without missing, one right after the other. On seeing this, the thought occurred to me 'How trained these Licchavi boys are, how well-trained these Licchavi boys are, in that from a distance they can shoot arrows through a tiny keyhole without missing, one right after the other!'\"", "entities": [[30, 36, "GPE"], [90, 96, "PERSON"], [109, 120, "PERSON"], [221, 232, "PERSON"], [344, 350, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn56.045.than.html", "title": "Vala Sutta", "para_seq": null}}
