{"text": "\"Now, when there is no eye, when there are no forms, when there is no eye-consciousness, it is impossible that one will delineate a delineation of contact. When there is no delineation of contact, it is impossible that one will delineate a delineation of feeling. When there is no delineation of feeling, it is impossible that one will delineate a delineation of perception. When there is no delineation of perception, it is impossible that one will delineate a delineation of thinking. When there is no delineation of thinking, it is impossible that one will delineate a delineation of being assailed by the perceptions & categories of objectification.", "spans": [], "meta": {"identifier": "mn.018.than.html", "title": "Madhupindika Sutta", "source": "neg"}}
{"text": "And when the Wheel (of Vision) of the Basic Pattern (of things) had been set in motion by the Blessed One, the earth-dwelling devas raised a cry: \"At Bārāṇasī, in the Deer Park at Isipatana, the unsurpassed Wheel (of Vision) of the Basic Pattern (of things) has been set in motion by the Blessed One, which cannot be stopped by any renunciant or brahman or māra or brahmā or by anyone in the world.\" Having heard the cry of the earth-dwelling devas, the devas of the Four Great Kings raised the same cry. Having heard it, the Thirty-three devas took it up, then the Yāma devas, then the Contented devas, then the devas Who Delight in Creating, then the devas With Mastery in the Creations of Others, and then the devas of the brahmā group.", "spans": [], "meta": {"identifier": "sn56.011.harv.html", "title": "Dhammacakkappavattana Sutta", "source": "neg"}}
{"text": "\"Monks, suppose that this great earth were totally covered with water, and a man were to toss a yoke with a single hole there. A wind from the east would push it west, a wind from the west would push it east. A wind from the north would push it south, a wind from the south would push it north. And suppose a blind sea-turtle were there. It would come to the surface once every one hundred years. Now what do you think: would that blind sea-turtle, coming to the surface once every one hundred years, stick his neck into the yoke with a single hole?\"", "spans": [], "meta": {"identifier": "sn56.048.than.html", "title": "Chiggala Sutta", "source": "neg"}}
{"text": "\"Assisted by five factors, right view has awareness-release as its fruit & reward, and discernment-release as its fruit & reward. There is the case where right view is assisted by virtue, assisted by learning, assisted by discussion, assisted by tranquility, assisted by insight. Assisted by these five factors, right view has awareness-release as its fruit & reward, and discernment-release as its fruit & reward.\"", "spans": [], "meta": {"identifier": "mn.043.than.html", "title": "Mahavedalla Sutta", "source": "neg"}}
{"text": "[1] \"There is the case where a monk is virtuous. He dwells restrained in accordance with the Patimokkha, consummate in his behavior & sphere of activity. He trains himself, having undertaken the training rules, seeing danger in the slightest faults.", "spans": [], "meta": {"identifier": "mn.108.than.html", "title": "Gopaka Moggallana Sutta", "source": "neg"}}
{"text": "\"There are two conditions for the attainment of the theme-less awareness-release: lack of attention to all themes and attention to the theme-less property. These are the two conditions for the attainment of the theme-less awareness-release.\"", "spans": [], "meta": {"identifier": "mn.043.than.html", "title": "Mahavedalla Sutta", "source": "neg"}}
{"text": "\"Bhikkhus! Āsavas and other destructive and burning defilements may arise in the bhikkhu who does not avoid such improprieties with proper reflection. Those āsavas and other destructive and burning defilements do not arise in the bhikkhu who avoids such improprieties with proper reflection. Bhikkhus! These are called the āsavas that are to be removed through avoidance.", "spans": [], "meta": {"identifier": "mn.002.bpit.html", "title": "Sabbasava Sutta", "source": "neg"}}
{"text": "[1] \"There is the case of the monk who, on seeing a cloud of dust, falters, faints, doesn't steel himself, can't continue in the holy life. Declaring his weakness in the training, he leaves the training and returns to the lower life. What is the cloud of dust for him? There is the case of the monk who hears, 'In that village or town over there is a woman or girl who is shapely, good-looking, charming, endowed with the foremost lotus-like complexion.' On hearing this, he falters, faints, doesn't steel himself, can't continue in the holy life. Declaring his weakness in the training, he leaves the training and returns to the lower life. That, for him, is the cloud of dust. This individual, I tell you, is like the warrior who, on seeing a cloud of dust, falters, faints, doesn't steel himself, can't engage in the battle. Some individuals are like this. This is the first type of warrior-like individual who can be found existing among the monks.", "spans": [], "meta": {"identifier": "an05.075.than.html", "title": "Yodhajiva Sutta", "source": "neg"}}
{"text": "\"And how does the disciple of the noble ones know moderation in eating? There is the case where the disciple of the noble ones, considering it appropriately, takes his food not playfully, nor for intoxication, nor for putting on bulk, nor for beautification, but simply for the survival & continuance of this body, for ending its afflictions, for the support of the holy life, thinking, 'I will destroy old feelings [of hunger] & not create new feelings [from overeating]. Thus I will maintain myself, be blameless, & live in comfort.' This is how the disciple of the noble ones knows moderation in eating.", "spans": [], "meta": {"identifier": "mn.053.than.html", "title": "Sekha-patipada Sutta", "source": "neg"}}
{"text": "\"Furthermore, there is the case where the mind of a monk, when attending to ill will, doesn't leap up at ill will, doesn't grow confident, steadfast, or released in ill will. But when attending to non-ill will, his mind leaps up at non-ill will, grows confident, steadfast, & released in non-ill will. When his mind is rightly-gone, rightly developed, has rightly risen above, gained release, and become disjoined from ill will, then whatever fermentations, torments, & fevers there are that arise in dependence on ill will, he is released from them. He does not experience that feeling. This is expounded as the escape from ill will.", "spans": [], "meta": {"identifier": "an05.200.than.html", "title": "Nissaraniya Sutta", "source": "neg"}}
{"text": ". (2) \"By encompassing mind with mind I understand a certain person thus: 'This person so behaves, so conducts himself, has taken such a path that on the dissolution of the body, after death, he will reappear in the animal realm.' And then later on, with the divine eye, which is purified and surpasses the human, I see that on the dissolution of the body, after death, he has reappeared in the animal realm and is experiencing painful, racking, piercing feelings. Suppose there were a cesspit deeper than a man's height full of filth; and then a man [75] scorched and exhausted by hot weather, weary, parched and thirsty, came by a path going in one way only and directed to that same cesspit. Then a man with good sight on seeing him would say: 'This person so behaves... that he will come to this same cesspit'; and then later on he sees that he has fallen into that cesspit and is experiencing painful, racking, piercing feelings. So too, by encompassing mind with mind... piercing feelings.", "spans": [], "meta": {"identifier": "mn.012.ntbb.html", "title": "Maha-sihanada Sutta", "source": "neg"}}
{"text": "\" [3] In one who examines, analyzes, & comes to a comprehension of that quality with discernment, persistence is aroused unflaggingly. When persistence is aroused unflaggingly in one who examines, analyzes, & comes to a comprehension of that quality with discernment, then persistence as a factor for awakening becomes aroused. He develops it, and for him it goes to the culmination of its development.", "spans": [], "meta": {"identifier": "mn.118.than.html", "title": "Anapanasati Sutta", "source": "neg"}}
{"text": "Herein, monks, when sense-desire is present, a monk knows, \"There is sense-desire in me,\" or when sense-desire is not present, he knows, \"There is no sense-desire in me.\" He knows how the arising of the non-arisen sense-desire comes to be; he knows how the abandoning of the arisen sense-desire comes to be; and he knows how the non-arising in the future of the abandoned sense-desire comes to be.", "spans": [], "meta": {"identifier": "mn.010.nysa.html", "title": "Satipatthana Sutta", "source": "neg"}}
{"text": "\"Again, there is the case where an individual, with the abandoning of pleasure & stress — as with the earlier disappearance of elation & distress — enters & remains in the fourth jhana: purity of equanimity & mindfulness, neither-pleasure-nor-pain. He savors that, longs for that, finds satisfaction through that. Staying there — fixed on that, dwelling there often, not falling away from that — then when he dies he reappears in conjunction with the Vehapphala [4] devas. The Vehapphala devas, monks, have a life-span of 500 eons. A run-of-the-mill person having stayed there, having used up all the life-span of those devas, goes to hell, to the animal womb, to the state of the hungry shades. But a disciple of the Blessed One, having stayed there, having used up all the life-span of those devas, is unbound right in that state of being. This, monks, is the difference, this the distinction, this the distinguishing factor, between an educated disciple of the noble ones and an uneducated run-of-the-mill person, when there is a destination, a reappearing.", "spans": [], "meta": {"identifier": "an04.123.than.html", "title": "Jhana Sutta", "source": "neg"}}
{"text": "\"From where would we get any heedfulness, master? — when parents are to be supported, wife & children are to be supported, slaves & workers are to be supported, friend-&-companion duties are to be done for friends & companions, kinsmen-&-relative duties for kinsmen & relatives, guest duties for guests, departed-ancestor duties for departed ancestors, devata duties for devatas, king duties for the king, and this body also has to be refreshed & nourished.\"", "spans": [], "meta": {"identifier": "mn.097.than.html", "title": "Dhanañjani Sutta", "source": "neg"}}
{"text": "\"If one were to pull away one of those sheaves of reeds, the other would fall; if one were to pull away the other, the first one would fall. In the same way, from the cessation of name-&-form comes the cessation of consciousness, from the cessation of consciousness comes the cessation of name-&-form. From the cessation of name-&-form comes the cessation of the six sense media. From the cessation of the six sense media comes the cessation of contact. From the cessation of contact comes the cessation of feeling. From the cessation of feeling comes the cessation of craving. From the cessation of craving comes the cessation of clinging/sustenance. From the cessation of clinging/sustenance comes the cessation of becoming. From the cessation of becoming comes the cessation of birth. From the cessation of birth, then aging & death, sorrow, lamentation, pain, distress, & despair all cease. Such is the cessation of this entire mass of suffering & stress.\"", "spans": [], "meta": {"identifier": "sn12.067.than.html", "title": "Nalakalapiyo Sutta", "source": "neg"}}
{"text": "\"There is the case where the disciple of the noble ones is endowed with verified confidence in the Awakened One: 'Indeed, the Blessed One is worthy and rightly self-awakened, consummate in knowledge & conduct, well-gone, an expert with regard to the world, unexcelled as a trainer for those people fit to be tamed, the Teacher of divine & human beings, awakened, blessed.' This is the first bonanza of merit, bonanza of skillfulness, nourishment of bliss.", "spans": [], "meta": {"identifier": "sn55.032.than.html", "title": "Abhisanda Sutta", "source": "neg"}}
{"text": "\"Why should you not do this? Such talk, monks, is not related to the goal, it is not fundamental to the holy life, does not conduce to disenchantment, dispassion, cessation, tranquillity, higher knowledge, enlightenment or to Nibbana. When you have discussions, monks, you should discuss Suffering, the Arising of Suffering, its Cessation, and the Path that leads to its Cessation. Why is that? Because such talk is related to the goal... it conduces to disenchantment... to Nibbana. This is the task you must accomplish.\"", "spans": [], "meta": {"identifier": "sn56.009.wlsh.html", "title": "Viggahika Sutta", "source": "neg"}}
{"text": "So the monks went to the park of the wanderers of other sects. On arrival, they exchanged courteous greetings with the wanderers of other sects. After an exchange of friendly greetings & courtesies, they sat to one side.", "spans": [], "meta": {"identifier": "sn46.054.than.html", "title": "Metta Sutta", "source": "neg"}}
{"text": "\"Sir, those whose passion... aversion... delusion is abandoned, its root destroyed, made like a palmyra stump, deprived of the conditions of development, not destined for future arising: they, in this world, are well-gone. That's how it strikes me.\"", "spans": [], "meta": {"identifier": "an03.072.than.html", "title": "Ajivaka Sutta", "source": "neg"}}
{"text": "\"He does not discern, as it actually is, fabricated form as 'fabricated form' ... fabricated feeling as 'fabricated feeling' ... fabricated perception as 'fabricated perception' ... fabricated fabrications as 'fabricated fabrications' ... fabricated consciousness as 'fabricated consciousness.'", "spans": [], "meta": {"identifier": "sn22.055.than.html", "title": "Udana Sutta", "source": "neg"}}
{"text": "\"Any monk or nun in whom the crookedness, faults, & flaws of bodily action are not abandoned; the crookedness, faults, & flaws of verbal action are not abandoned; the crookedness, faults, & flaws of mental action are not abandoned has fallen away from this Dhamma & Discipline, just like the wheel finished in six days. But any monk or nun in whom the crookedness, faults, & flaws of bodily action are abandoned; the crookedness, faults, & flaws of verbal action are abandoned; the crookedness, faults, & flaws of mental action are abandoned stands firm in this Dhamma & Discipline, just like the wheel finished in six months minus six days.", "spans": [], "meta": {"identifier": "an03.015.than.html", "title": "Rathakara (Pacetana) Sutta", "source": "neg"}}
{"text": "\"Or he doesn't assume form to be the self... but he may have a view such as this: 'This self is the same as the cosmos. This I will be after death, constant, lasting, eternal, not subject to change.' This eternalist view is a fabrication... Or... he may have a view such as this: 'I would not be, neither would there be what is mine. I will not be, neither will there be what is mine.' This annihilationist view is a fabrication... Or... he may be doubtful & uncertain, having come to no conclusion with regard to the true Dhamma. That doubt, uncertainty, & coming-to-no-conclusion is a fabrication.", "spans": [], "meta": {"identifier": "sn22.081.than.html", "title": "Parileyyaka Sutta", "source": "neg"}}
{"text": "\"He discerns that 'Whatever disturbances that would exist based on the perception of human being are not present. Whatever disturbances that would exist based on the perception of wilderness are not present. There is only this modicum of disturbance: the singleness based on the perception of earth.' He discerns that 'This mode of perception is empty of the perception of human being. This mode of perception is empty of the perception of wilderness. There is only this non-emptiness: the singleness based on the perception of earth.' Thus he regards it as empty of whatever is not there. Whatever remains, he discerns as present: 'There is this.' And so this, his entry into emptiness, accords with actuality, is undistorted in meaning, & pure.", "spans": [], "meta": {"identifier": "mn.121.than.html", "title": "Cula-suññata Sutta", "source": "neg"}}
{"text": "\" Just as the rafters in a peak-roofed house all go to the roof-peak, incline to the roof-peak, converge at the roof-peak, and the roof-peak is reckoned the foremost among them; in the same way, all skillful qualities are rooted in heedfulness, converge in heedfulness, and heedfulness is reckoned the foremost among them.", "spans": [], "meta": {"identifier": "an10.015.than.html", "title": "Appamada Sutta", "source": "neg"}}
{"text": "\"Any action performed with non-delusion — born of non-delusion, caused by non-delusion, originating from non-delusion: When delusion is gone, that action is thus abandoned, its root destroyed, made like a palmyra stump, deprived of the conditions of development, not destined for future arising.", "spans": [], "meta": {"identifier": "an03.033.than.html", "title": "Nidana Sutta", "source": "neg"}}
{"text": "Then the very rich brahman said to the Blessed One: \" Magnificent , Master Gotama! Magnificent! Just as if he were to place upright what was overturned, to reveal what was hidden, to point out the way to one who was lost, or to carry a lamp into the dark so that those with eyes could see forms, in the same way has Master Gotama — through many lines of reasoning — made the Dhamma clear. I go to Master Gotama for refuge, to the Dhamma, & to the community of monks. May Master Gotama remember me as a lay follower who has gone for refuge from this day forward, for life.\"", "spans": [], "meta": {"identifier": "sn07.014.than.html", "title": "Maha-sala Sutta", "source": "neg"}}
{"text": "\"Now, there are these five gifts , five great gifts — original, long-standing, traditional, ancient, unadulterated, unadulterated from the beginning — that are not open to suspicion, will never be open to suspicion, and are unfaulted by knowledgeable contemplatives & brahmans. Which five?", "spans": [], "meta": {"identifier": "an08.039.than.html", "title": "Abhisanda Sutta", "source": "neg"}}
{"text": "\"Yes, Master Ratthapala, I have a recurring wind-illness. [9] Sometimes my friends & advisors, relatives & blood-kinsmen, stand around me saying, 'This time King Koravya will die. This time King Koravya will die.'\"", "spans": [], "meta": {"identifier": "mn.082.than.html", "title": "Ratthapala Sutta", "source": "neg"}}
{"text": ". \"There are certain recluses and brahmans whose doctrine and view is this: 'Purification comes about through sacrifice.' But it is impossible to find a kind of sacrifice that has not already been offered up by me in this long journey, when I was either a head-anointed noble king or a well-to-do-brahman.", "spans": [], "meta": {"identifier": "mn.012.ntbb.html", "title": "Maha-sihanada Sutta", "source": "neg"}}
{"text": "\"Monks, a person who desired his own true benefit would do well to take up (the offer). Why is that? From an inconceivable beginning comes transmigration. A beginning point is not evident for the (pain of) blows from spears, swords, & axes. Even if this (offer) were to occur, I tell you that the realization of the four noble truths would not be accompanied by pain & distress. Instead, I tell you, the realization of the four noble truths would be accompanied by pleasure & happiness.", "spans": [], "meta": {"identifier": "sn56.035.than.html", "title": "Sattisata Sutta", "source": "neg"}}
{"text": "\"He attends to the imperturbable. [3] While he is attending to the imperturbable, his mind does not take pleasure, find satisfaction, grow steady, or indulge in the imperturbable. When this is the case, he discerns, 'While I am attending to the imperturbable, my mind does not take pleasure, find satisfaction, grow steady, or indulge in the imperturbable.' In this way he is alert there.", "spans": [], "meta": {"identifier": "mn.122.than.html", "title": "Maha-suññata Sutta", "source": "neg"}}
{"text": "\"Monks, these two people are hard to find in the world. Which two? The one who is first to do a kindness, and the one who is grateful for a kindness done and feels obligated to repay it. These two people are hard to find in the world.\"", "spans": [], "meta": {"identifier": "an02.119.than.html", "title": "Dullabha Sutta", "source": "neg"}}
{"text": "\"'It is a gain for us, my friend, a great gain for us, that we have such a companion in the holy life. So the Dhamma Rama declared he entered & dwelled in, having realized it for himself through direct knowledge, is the Dhamma you declare you have entered & dwell in, having realized it for yourself through direct knowledge. And the Dhamma you declare you have entered & dwell in, having realized it for yourself through direct knowledge, is the Dhamma Rama declared he entered & dwelled in, having realized it for himself through direct knowledge. The Dhamma he knew is the Dhamma you know; the Dhamma you know is the Dhamma he knew. As he was, so are you; as you are, so was he. Come friend, lead this community.'", "spans": [], "meta": {"identifier": "mn.026.than.html", "title": "Ariyapariyesana Sutta", "source": "neg"}}
{"text": "\"Discernment & consciousness are conjoined, friend, not disjoined. It's not possible, having separated them one from the other, to delineate the difference between them. For what one discerns, that one cognizes. What one cognizes, that one discerns. Therefore these qualities are conjoined, not disjoined, and it is not possible, having separated them one from another, to delineate the difference between them.\"", "spans": [], "meta": {"identifier": "mn.043.than.html", "title": "Mahavedalla Sutta", "source": "neg"}}
{"text": "29 . \"I don't envision a single thing that, when undeveloped & uncultivated, brings about such suffering & stress as the mind. The mind, when undeveloped & uncultivated, brings about suffering & stress.\"", "spans": [], "meta": {"identifier": "an01.021-040.than.html", "title": "Ekadhamma Suttas", "source": "neg"}}
{"text": "\"He thinks any thought he wants to think, and doesn't think any thought he doesn't want to think. He wills any resolve he wants to will, and doesn't will any resolve he doesn't want to will. He has attained mastery of the mind with regard to the pathways of thought. [1]", "spans": [], "meta": {"identifier": "an04.035.than.html", "title": "Vassakara Sutta", "source": "neg"}}
{"text": "Then a certain brahman approached the Blessed One; having approached the Blessed One, he exchanged friendly greetings. After pleasant conversation had passed between them, he sat to one side. Having sat to one side, the brahman spoke to the Blessed One thus:", "spans": [], "meta": {"identifier": "an06.038.niza.html", "title": "Attakārī Sutta", "source": "neg"}}
{"text": "\"And what is the individual who is a Dhamma-follower? There is the case where a certain individual does not remain touching with his body those peaceful liberations that transcend form, that are formless, nor — having seen with discernment — are his fermentations ended. But with a [sufficient] measure of reflection through discernment he has come to an agreement with the teachings proclaimed by the Tathagata. And he has these qualities: the faculty of conviction, the faculty of persistence, the faculty of mindfulness, the faculty of concentration, & the faculty of discernment. This is called an individual who is a Dhamma-follower. [9] Regarding this monk, I say that he has a task to do with heedfulness. Why is that? [I think:] 'Perhaps this venerable one, when making use of suitable resting places, associating with admirable friends, balancing his [mental] faculties, will reach & remain in the supreme goal of the holy life for which clansmen rightly go forth from home into homelessness, knowing & realizing it for himself in the here & now.' Envisioning this fruit of heedfulness for this monk, I say that he has a task to do with heedfulness.", "spans": [], "meta": {"identifier": "mn.070.than.html", "title": "Kitagiri Sutta", "source": "neg"}}
{"text": "[6] \"The thought occurred to me: 'What if, with the complete transcending of the dimension of the infinitude of space, thinking, \"Infinite consciousness,\" I were to enter & remain in the dimension of the infinitude of consciousness?' But my heart didn't leap up at the dimension of the infinitude of consciousness, didn't grow confident, steadfast, or firm, seeing it as peace... So at a later time, having seen the drawback of the dimension of the infinitude of space, I pursued that theme; having understood the reward of the dimension of the infinitude of consciousness, I familiarized myself with it. My heart leaped up at the dimension of the infinitude of consciousness, grew confident, steadfast, & firm, seeing it as peace. With the complete transcending of the dimension of the infinitude of space, [perceiving,] 'Infinite consciousness,' I entered & remained in the dimension of the infinitude of consciousness.", "spans": [], "meta": {"identifier": "an09.041.than.html", "title": "Tapussa Sutta", "source": "neg"}}
{"text": "\" Just as if a skilled bathman or bathman's apprentice would pour bath powder into a brass basin and knead it together, sprinkling it again and again with water, so that his ball of bath powder — saturated, moisture-laden, permeated within and without — would nevertheless not drip; even so, the monk permeates, suffuses and fills this very body with the rapture and pleasure born of withdrawal. There is nothing of his entire body unpervaded by rapture and pleasure born from withdrawal. This is the first development of the five-factored noble right concentration.", "spans": [], "meta": {"identifier": "an05.028.than.html", "title": "Samadhanga Sutta", "source": "neg"}}
{"text": "\"But when one doesn't intend, arrange, or obsess [about anything], there is no support for the stationing of consciousness. There being no support, there is no landing of consciousness. When that consciousness doesn't land & grow, there is no production of renewed becoming in the future. When there is no production of renewed becoming in the future, there is no future birth, aging & death, sorrow, lamentation, pain, distress, or despair. Such is the cessation of this entire mass of suffering & stress.\"", "spans": [], "meta": {"identifier": "sn12.038.than.html", "title": "Cetana Sutta", "source": "neg"}}
{"text": "\"For one who does not know & see form as it actually is present, who does not know & see the origination of form... the cessation of form... the path of practice leading to the cessation of form, as it actually is present, there occurs the thought, 'The Tathagata exists after death' or 'The Tathagata does not exist after death' or 'The Tathagata both exists and does not exist after death' or 'The Tathagata neither exists nor does not exist after death.'", "spans": [], "meta": {"identifier": "sn44.004.than.html", "title": "Sariputta-Kotthita Sutta", "source": "neg"}}
{"text": "\"But if, on examination, the monk knows, 'I am one who achieves both internal tranquility of awareness and insight into phenomena through heightened discernment,' then his duty is to make an effort in maintaining those very same skillful qualities to a higher degree for the ending of the effluents.", "spans": [], "meta": {"identifier": "an10.054.than.html", "title": "Samatha Sutta", "source": "neg"}}
{"text": "Now at that time Nalanda was in the midst of famine, a time of scarcity, the crops white with blight and turned to straw. And at that time Nigantha Nataputta was staying in Nalanda together with a large following of niganthas. Then Asibandhakaputta the headman, a disciple of the niganthas, went to Nigantha Nataputta and, on arrival, having bowed down to him, sat to one side. As he was sitting there, Nigantha Nataputta said to him, \"Come, now, headman. Refute the words of Gotama the contemplative, and this admirable report about you will spread afar: 'The words of Gotama the contemplative — so mighty, so powerful — were refuted by Asibandhakaputta the headman!'\"", "spans": [], "meta": {"identifier": "sn42.009.than.html", "title": "Kula Sutta", "source": "neg"}}
{"text": ". \"When, friends, a noble disciple understands birth, the origin of birth, the cessation of birth, and the way leading to the cessation of birth, in that way he is one of right view... and has arrived at this true Dhamma.", "spans": [], "meta": {"identifier": "mn.009.ntbb.html", "title": "Sammaditthi Sutta", "source": "neg"}}
{"text": "“And how is there the bond of being? Here, monks, someone does not understand as it really is the arising, the subsiding, the sweetness, the wretchedness, and the leaving behind of modes of being. For one not understanding as it really is the arising, the subsiding, the sweetness, the wretchedness, and the leaving behind of modes of being; who, with respect to being, is obsessed with passion for being, delight in being, affection for being, intoxication with being, thirst for being, fever for being, attachment to being, craving for being: this, monks, is called ‘the bond of being’. Thus the bond of sensual delight and the bond of being.", "spans": [], "meta": {"identifier": "an04.010.niza.html", "title": "Yoga Sutta", "source": "neg"}}
{"text": "\"When the mind was thus concentrated, purified, bright, unblemished, rid of defilement, pliant, malleable, steady, & attained to imperturbability, I directed it to the knowledge of the ending of the mental fermentations. I discerned, as it had come to be, that 'This is stress... This is the origination of stress... This is the cessation of stress... This is the way leading to the cessation of stress... These are fermentations... This is the origination of fermentations... This is the cessation of fermentations... This is the way leading to the cessation of fermentations.' My heart, thus knowing, thus seeing, was released from the fermentation of sensuality, released from the fermentation of becoming, released from the fermentation of ignorance. With release, there was the knowledge, 'Released.' I discerned that 'Birth is ended, the holy life fulfilled, the task done. There is nothing further for this world.'", "spans": [], "meta": {"identifier": "mn.004.than.html", "title": "Bhaya-bherava Sutta", "source": "neg"}}
{"text": "\"When this was said, the Niganthas said to me, 'Friend, the Nigantha Nataputta [1] is all-knowing, all-seeing, and claims total knowledge & vision thus: \"Whether I am walking or standing, sleeping or awake, knowledge & vision are continuously & continually established in me.\" He has told us, \"Niganthas, there are evil actions that you have done in the past. Exhaust them with these painful austerities. When in the present you are restrained in body, restrained in speech, and restrained in mind, that is the non-doing of evil action for the future. Thus, with the destruction of old actions through asceticism, and with the non-doing of new actions, there will be no flow into the future. With no flow into the future, there is the ending of action. With the ending of action, the ending of stress. With the ending of stress, the ending of feeling. With the ending of feeling, all suffering & stress will be exhausted.\" We approve of that [teaching], prefer it, and are gratified by it.'", "spans": [], "meta": {"identifier": "mn.101.than.html", "title": "Devadaha Sutta", "source": "neg"}}
{"text": "\" And what is the middle way realized by the Tathagata that — producing vision, producing knowledge — leads to calm, to direct knowledge, to self-awakening, to Unbinding? Precisely this Noble Eightfold Path: right view, right resolve, right speech, right action, right livelihood, right effort, right mindfulness, right concentration. This is the middle way realized by the Tathagata that — producing vision, producing knowledge — leads to calm, to direct knowledge, to self-awakening, to Unbinding.", "spans": [], "meta": {"identifier": "sn56.011.than.html", "title": "Dhammacakkappavattana Sutta", "source": "neg"}}
{"text": "\"'As long as they live, the arahants — abandoning high & imposing seats & beds — abstain from high & imposing seats & beds. They make low beds, on a pallet or a spread of straw. Today I too, for this day & night — abandoning high & imposing seats & beds — abstain from high & imposing seats & beds. I make a low bed, on a pallet or a spread of straw. By means of this factor I emulate the arahants, and my Uposatha will be observed.'", "spans": [], "meta": {"identifier": "an03.070.than.html", "title": "Muluposatha Sutta", "source": "neg"}}
{"text": "As they were sitting there, the wanderers of other sects said to them, \"Friends, Gotama the contemplative teaches the Dhamma to his disciples in this way: 'Come, monks — abandoning the five hindrances, the corruptions of awareness that weaken discernment — develop the seven factors for awakening as they have come to be.'", "spans": [], "meta": {"identifier": "sn46.053.than.html", "title": "Aggi Sutta", "source": "neg"}}
{"text": "\"And when a poor, destitute, penniless person owing interest payments does not pay interest on time, they serve him notice. For one who partakes of sensuality, being served notice is suffering in the world.\"", "spans": [], "meta": {"identifier": "an06.045.than.html", "title": "Ina Sutta", "source": "neg"}}
{"text": "Now the Venerable Vakkali saw the Blessed One coming from a distance, and tried to get up. Then the Blessed One said to the Venerable Vakkali: \"Enough, Vakkali, do not try to get up. [1] There are these seats made ready. I will sit down there.\" And he sat down on a seat that was ready. Then he said:", "spans": [], "meta": {"identifier": "sn22.087x.wlsh.html", "title": "Vakkali Sutta", "source": "neg"}}
{"text": "\"There is the case where a monk — quite secluded from sensuality, secluded from unskillful qualities — enters & remains in the first jhāna: rapture & pleasure born of seclusion, accompanied by directed thought & evaluation. This is a quality higher & more sublime than knowledge & vision. [2]", "spans": [], "meta": {"identifier": "mn.030.than.html", "title": "Cula Saropama Sutta", "source": "neg"}}
{"text": "\"And how is a king's elephant not resilient to sights? There is the case where a king's elephant, having gone into battle, sees a troop of elephants, a troop of cavalry, a troop of chariots, a troop of foot soldiers, and so he falters, faints, doesn't steel himself, can't engage in the battle. This is how a king's elephant is not resilient to sights.", "spans": [], "meta": {"identifier": "an05.139.than.html", "title": "Akkhama Sutta", "source": "neg"}}
{"text": "\"Lord, if my dear kin and relatives were to enter on the uposatha undertaken with its eight practices, it would be for their benefit and happiness for many a day. Lord, if all the warrior-nobles, brahmans, merchants and laborers were to enter on the uposatha undertaken with its eight practices, it would be for their benefit and happiness for many a day.\"", "spans": [], "meta": {"identifier": "an08.043.khan.html", "title": "Visakhuposatha Sutta", "source": "neg"}}
{"text": "\"We have asked Master Gotama about safeguarding the truth, and Master Gotama has answered about safeguarding the truth. We like that & agree with that, [1] and so we are gratified. We have asked Master Gotama about awakening to the truth, and Master Gotama has answered about awakening to the truth. We like that & agree with that, and so we are gratified. We have asked Master Gotama about finally attaining the truth, and Master Gotama has answered about finally attaining the truth. We like that & agree with that, and so we are gratified. We have asked Master Gotama about the quality most helpful for finally attaining the truth, and Master Gotama has answered about the quality most helpful for finally attaining the truth. We like that & agree with that, and so we are gratified. Whatever we have asked Master Gotama, Master Gotama has answered it. We like that & agree with that, and so we are gratified.", "spans": [], "meta": {"identifier": "mn.095x.than.html", "title": "Canki Sutta", "source": "neg"}}
{"text": "The Blessed One said, \"Monks, if you are asked by wanderers of other sects, 'Friends, there are these three qualities. Which three? Passion, aversion, & delusion. These are the three qualities. Now what is the difference, what the distinction, what the distinguishing factor among these three qualities?' — when thus asked, you should answer those wanderers of other sects in this way, 'Friends, passion carries little blame and is slow to fade. Aversion carries great blame and is quick to fade. Delusion carries great blame and is slow to fade.", "spans": [], "meta": {"identifier": "an03.068.than.html", "title": "Titthiya Sutta", "source": "neg"}}
{"text": "\"Furthermore, the monk who is an adept discerns the six sense faculties: the faculty of the eye... ear... nose... tongue... body... intellect. He discerns, 'These six sense faculties will disband entirely, everywhere, & in every way without remainder, and no other set of six sense faculties will arise anywhere or in any way.' This too is a manner of reckoning whereby a monk who is an adept, standing at the level of an adept, can discern that 'I am an adept.'\"", "spans": [], "meta": {"identifier": "sn48.053.than.html", "title": "Sekha Sutta", "source": "neg"}}
{"text": "\"In the same way, a monk endowed with five qualities is not deserving of gifts, deserving of hospitality, deserving of offerings, deserving of respect, nor is he an unexcelled field of merit for the world. Which five? There is the case where a monk is not resilient to sights, not resilient to sounds, not resilient to aromas, not resilient to flavors, not resilient to tactile sensations.", "spans": [], "meta": {"identifier": "an05.139.than.html", "title": "Akkhama Sutta", "source": "neg"}}
{"text": "\"It isn't right, monks, that sons of good families, on having gone forth out of faith from home to the homeless life, should get engaged in such topics of conversation, i.e., conversation about kings, robbers, & ministers of state... talk of whether things exist or not.", "spans": [], "meta": {"identifier": "an10.069.than.html", "title": "Kathavatthu Sutta", "source": "neg"}}
{"text": "\" Suppose that a man were to come along carrying lac, yellow orpiment, indigo, or crimson, saying, 'I will draw pictures in space, I will make pictures appear.' Now, what do you think — would he draw pictures in space & make pictures appear?\"", "spans": [], "meta": {"identifier": "mn.021x.than.html", "title": "Kakacupama Sutta", "source": "neg"}}
{"text": "\"If a person has conviction, his statement, 'This is my conviction,' safeguards the truth. But he doesn't yet come to the definite conclusion that 'Only this is true; anything else is worthless.' To this extent, Bharadvaja, there is the safeguarding of the truth. To this extent one safeguards the truth. I describe this as the safeguarding of the truth. But it is not yet an awakening to the truth.", "spans": [], "meta": {"identifier": "mn.095x.than.html", "title": "Canki Sutta", "source": "neg"}}
{"text": "After these words, Carpenter Fivetools said: \"Not three kinds of feelings, reverend Udayi, were taught by the Blessed One. It is two kinds of feelings that were stated by the Blessed One: pleasant and painful feelings. The neutral feeling was said by the Blessed One to belong to peaceful and sublime happiness.\"", "spans": [], "meta": {"identifier": "mn.059.nypo.html", "title": "Bahuvedaniya Sutta", "source": "neg"}}
{"text": "\"In dependence on a contact to be experienced as equanimity, the equanimity-faculty arises. Being equanimous, one discerns, 'I am equanimous.' With the cessation of that very contact to be experienced as equanimity, one discerns, 'What was experienced as coming from that — the equanimity-faculty arising in dependence on a contact to be experienced as equanimity — ceases & grows still.'", "spans": [], "meta": {"identifier": "sn48.039.than.html", "title": "Katthopama Sutta", "source": "neg"}}
{"text": "\"And what is the food for the arising of unarisen sloth & drowsiness, or for the growth & increase of sloth & drowsiness once it has arisen? There are boredom, weariness, yawning, drowsiness after a meal, & sluggishness of awareness. To foster inappropriate attention to them: This is the food for the arising of unarisen sloth & drowsiness, or for the growth & increase of sloth & drowsiness once it has arisen.", "spans": [], "meta": {"identifier": "sn46.051.than.html", "title": "Ahara Sutta", "source": "neg"}}
{"text": "\"In the same way, monks, those things that I have known with direct knowledge but have not taught are far more numerous [than what I have taught]. And why haven't I taught them? Because they are not connected with the goal, do not relate to the rudiments of the holy life, and do not lead to disenchantment, to dispassion, to cessation, to calm, to direct knowledge, to self-awakening, to Unbinding. That is why I have not taught them.", "spans": [], "meta": {"identifier": "sn56.031.than.html", "title": "Simsapa Sutta", "source": "neg"}}
{"text": "Just then a slavewoman belonging to one of his relatives was about to throw away some day-old porridge. So Ven. Ratthapala said to her, \"Sister, if that is to be thrown away, pour it here into my bowl.\" While she was pouring the day-old porridge into this bowl, she recognized his hands, feet, & voice. So she went to his mother and said, \"May it please you to know, my lady, that master-son Ratthapala has arrived.\"", "spans": [], "meta": {"identifier": "mn.082.than.html", "title": "Ratthapala Sutta", "source": "neg"}}
{"text": "\"Master Gotama, this was the topic of conversation that arose today when the royal court sat gathered in the royal palace: 'In the past, there were fewer monks but more who, endowed with superior human attainments, displayed the miracle of psychic power. Now there are more monks but fewer who, endowed with superior human attainments, display the miracle of psychic power. This, Master Gotama, was the topic of conversation that arose today when the royal court sat gathered in the royal palace.\"", "spans": [], "meta": {"identifier": "an03.060.than.html", "title": "Sangarava Sutta", "source": "neg"}}
{"text": "[7] \"He knows the awareness of other beings, other individuals, having encompassed it with his own awareness. He discerns a mind with passion as a mind with passion, and a mind without passion as a mind without passion. He discerns a mind with aversion as a mind with aversion, and a mind without aversion as a mind without aversion. He discerns a mind with delusion as a mind with delusion, and a mind without delusion as a mind without delusion. He discerns a restricted mind as a restricted mind, and a scattered mind as a scattered mind. He discerns an enlarged mind as an enlarged mind, and an unenlarged mind as an unenlarged mind. He discerns an excelled mind [one that is not at the most excellent level] as an excelled mind, and an unexcelled mind as an unexcelled mind. He discerns a concentrated mind as a concentrated mind, and an unconcentrated mind as an unconcentrated mind. He discerns a released mind as a released mind, and an unreleased mind as an unreleased mind.", "spans": [], "meta": {"identifier": "mn.108.than.html", "title": "Gopaka Moggallana Sutta", "source": "neg"}}
{"text": "\"If an individual is endowed with these four qualities, I do not describe him as consummate in what is skillful, foremost in what is skillful, an invincible contemplative attained to the highest attainments. Rather, he stands on the same level as a stupid baby boy lying on its back. Which four? There is the case where he does no evil action with his body, speaks no evil speech, resolves on no evil resolve, and maintains himself with no evil means of livelihood. If an individual is endowed with these four qualities, I do not describe him as consummate in what is skillful, foremost in what is skillful, an invincible contemplative attained to the highest attainments. Rather, he stands on the same level as a stupid baby boy lying on its back.", "spans": [], "meta": {"identifier": "mn.078.than.html", "title": "Samana-Mundika Sutta", "source": "neg"}}
{"text": "7 . Then the Blessed One addressed the monks thus: \"What do you think, O monks: has that monk Arittha, formerly of the vulture killers, produced any spark (of understanding) in this teaching and discipline?\" [4] — \"How should that be, Lord? Certainly not, O Lord.\"", "spans": [], "meta": {"identifier": "mn.022.nypo.html", "title": "Alagaddupama Sutta", "source": "neg"}}
{"text": "[Similarly with any arisen lack of material gain, any arisen status, any arisen lack of status, any arisen offerings, any arisen lack of offerings, any arisen evil ambition, & any arisen evil friendship.]", "spans": [], "meta": {"identifier": "an08.007.than.html", "title": "Devadatta Sutta", "source": "neg"}}
{"text": "\"Abandoning covetousness with regard to the world, he dwells with an awareness devoid of covetousness. He cleanses his mind of covetousness. Abandoning ill will and anger, he dwells with an awareness devoid of ill will, sympathetic with the welfare of all living beings. He cleanses his mind of ill will and anger. Abandoning sloth and drowsiness, he dwells with an awareness devoid of sloth and drowsiness, mindful, alert, percipient of light. He cleanses his mind of sloth and drowsiness. Abandoning restlessness and anxiety, he dwells undisturbed, his mind inwardly stilled. He cleanses his mind of restlessness and anxiety. Abandoning uncertainty, he dwells having crossed over uncertainty, with no perplexity with regard to skillful mental qualities. He cleanses his mind of uncertainty.", "spans": [], "meta": {"identifier": "an09.040.than.html", "title": "Naga Sutta", "source": "neg"}}
{"text": "\"'Exceedingly gladdening the mind (by samatha, calming, as well as by vipassana, insight), I shall breathe in,' thus he trains himself; 'exceedingly gladdening the mind, I shall breathe out,' thus he trains himself.", "spans": [], "meta": {"identifier": "an10.060.piya.html", "title": "Girimananda Sutta", "source": "neg"}}
{"text": "\"Venerable sir, if those who belonged formerly to another sect and want the going forth and the full admission in this Dhamma and Discipline live on probation for four months and at the end of four months bhikkhus who are satisfied in their minds give them the going forth into homelessness and the full admission to the bhikkhus' state, I will live on probation for four years and at the end of the four years let bhikkhus who are satisfied in their minds give me the going forth into homelessness and the full admission to the bhikkhus' state.\"", "spans": [], "meta": {"identifier": "mn.057.nymo.html", "title": "Kukkuravatika Sutta", "source": "neg"}}
{"text": "\"Householder, regardless of whether a gift is coarse or refined, if it is given inattentively, disrespectfully, not with one's own hand, as if throwing it away, with the view that nothing will come of it: Wherever the result of that gift comes to fruition, one's mind will not incline to the enjoyment of splendid food, will not incline to the enjoyment of splendid clothing, will not incline to the enjoyment of splendid vehicles, will not incline to the enjoyment of the splendid five strings of sensuality. And one's sons & daughters, slaves, servants, & workers will not listen to one, will not lend ear, will not make their minds attend for the sake of knowledge. Why is that? Because that is the result of inattentive actions.", "spans": [], "meta": {"identifier": "an09.020.than.html", "title": "Velāma Sutta", "source": "neg"}}
{"text": "\"And what is pleasure of the flesh? There are these five strings of sensuality. Which five? Forms cognizable via the eye — agreeable, pleasing, charming, endearing, fostering desire, enticing. Sounds cognizable via the ear... Aromas cognizable via the nose... Flavors cognizable via the tongue... Tactile sensations cognizable via the body — agreeable, pleasing, charming, endearing, fostering desire, enticing. Now whatever pleasure arises in dependence on these five strands of sensuality, that is called pleasure of the flesh.", "spans": [], "meta": {"identifier": "sn36.031.than.html", "title": "Niramisa Sutta", "source": "neg"}}
{"text": "Now at that time a large number of monks had declared final gnosis in the Blessed One's presence: \"We discern that 'Birth is ended, the holy life fulfilled, the task done. There is nothing further for the sake of this world.'\"", "spans": [], "meta": {"identifier": "sn12.070.than.html", "title": "Susima Sutta", "source": "neg"}}
{"text": "\"Now, as long as I did not have direct knowledge of the fourfold round with regard to these five clinging-aggregates, I did not claim to have directly awakened to the unexcelled right self-awakening in this cosmos with its devas, Maras, & Brahmas, in this generation with its brahmans & contemplatives, its royalty & common people. But when I did have direct knowledge of the fourfold round with regard to these five clinging-aggregates, then I did claim to have directly awakened to the unexcelled right self-awakening in this cosmos with its devas, Maras, & Brahmas, in this generation with its brahmans & contemplatives, its royalty & common people.", "spans": [], "meta": {"identifier": "sn22.056.than.html", "title": "Parivatta Sutta", "source": "neg"}}
{"text": "\"When this was said, I told Baka Brahma, 'How immersed in ignorance is Baka Brahma! How immersed in ignorance is Baka Brahma! — in that what is actually inconstant he calls \"constant.\" What is actually impermanent he calls \"permanent.\" What is actually non-eternal he calls \"eternal.\" What is actually partial he calls \"total.\" What is actually subject to falling away he calls \"not subject to falling away.\" Where one takes birth, ages, dies, falls away, and reappears, he says, \"For here one does not take birth, does not age, does not die, does not fall away, does not reappear.\" And there being another, higher escape, he says, \"There is no other, higher escape.\"'", "spans": [], "meta": {"identifier": "mn.049.than.html", "title": "Brahma-nimantanika Sutta", "source": "neg"}}
{"text": ". \"What do you think, Kalamas? Does absence of hate appear in a man for his benefit or harm?\" — \"For his benefit, venerable sir.\" — \"Kalamas, being not given to hate, and being not overwhelmed and not vanquished mentally by hate, this man does not take life, does not steal, does not commit adultery, and does not tell lies; he prompts another too, to do likewise. Will that be long for his benefit and happiness?\" — \"Yes, venerable sir.\"", "spans": [], "meta": {"identifier": "an03.065.soma.html", "title": "Kalama Sutta", "source": "neg"}}
{"text": "\"Very good, my friend Yamaka. Very good. In that case I will give you an analogy for the sake of taking your understanding of this point even further. Suppose there were a householder or householder's son — rich, wealthy, with many possessions — who was thoroughly well-guarded. Then suppose there came along a certain man, desiring what was not his benefit, desiring what was not his welfare, desiring his loss of security, desiring to kill him. The thought would occur to this man: 'It would not be easy to kill this person by force. What if I were to sneak in and then kill him?'", "spans": [], "meta": {"identifier": "sn22.085.than.html", "title": "Yamaka Sutta", "source": "neg"}}
{"text": "[5] \"Whatever tricks or deceits or wiles or subterfuges he has, he shows them as they actually are to the Teacher or to his knowledgeable companions in the holy life, so that the Teacher or his knowledgeable companions in the holy life can try to straighten them out.", "spans": [], "meta": {"identifier": "an08.013.than.html", "title": "Ajañña Sutta", "source": "neg"}}
{"text": "[Similarly with the second, third, & fourth jhānas, and with the attainment of the dimensions of the infinitude of space, the infinitude of consciousness, nothingness, and neither perception nor non-perception.]", "spans": [], "meta": {"identifier": "an09.038.than.html", "title": "Brahmana Sutta", "source": "neg"}}
{"text": "\"'Having directly known liquid as liquid ... fire as fire ... wind as wind ... beings as beings ... devas as devas ... Pajapati as Pajapati ... brahma as brahma ... the radiant as radiant ... the beautiful black as the beautiful black ... the sky-fruit as the sky-fruit ... the conqueror as the conqueror ...", "spans": [], "meta": {"identifier": "mn.049.than.html", "title": "Brahma-nimantanika Sutta", "source": "neg"}}
{"text": "[1] \"Monks, as far as Kasi & Kosala extend, as far as the rule of King Pasenadi the Kosalan extends, King Pasenadi the Kosalan is reckoned supreme. Yet even in King Pasenadi the Kosalan there is still aberration, there is change. Seeing this, the instructed disciple of the noble ones grows disenchanted with that. Being disenchanted with that, he becomes dispassionate toward what is supreme, and even more so toward what is inferior.", "spans": [], "meta": {"identifier": "an10.029.than.html", "title": "Kosala Sutta", "source": "neg"}}
{"text": "\"But, Migajaala, there are objects cognizable by the eye... ear... nose... tongue... body... mind — attractive, pleasing, charming, agreeable, enticing, lust-inspiring. And if a monk takes no pleasure in them, does not welcome them, does not persist in clinging to them, then, because of his not taking pleasure, not welcoming them and not persisting in clinging to them, enjoyment fades away, and without enjoyment there is no infatuation. Without infatuation no bondage is generated, and the monk who is freed from the bondage of enjoyment is called 'one who dwells alone.'", "spans": [], "meta": {"identifier": "sn35.063.wlsh.html", "title": "Migajaalena Sutta", "source": "neg"}}
{"text": "\"There are, Punna, forms cognizable via the eye — agreeable, pleasing, charming, endearing, fostering desire, enticing. If a monk relishes them, welcomes them, and remains fastened to them, then in him — relishing them, welcoming them, and remaining fastened to them — there arises delight. From the origination of delight, I tell you, comes the origination of suffering and stress.", "spans": [], "meta": {"identifier": "sn35.088.than.html", "title": "Punna Sutta", "source": "neg"}}
{"text": "\"Furthermore, there is the case of the person in doubt & perplexity, who has not arrived at certainty with regard to the True Dhamma. Then he comes down with a serious disease. As he comes down with a serious disease, the thought occurs to him, 'How doubtful & perplexed I am! I have not arrived at any certainty with regard to the True Dhamma!' He grieves & is tormented, weeps, beats his breast, & grows delirious. This, too, is a person who, subject to death, is afraid & in terror of death.", "spans": [], "meta": {"identifier": "an04.184.than.html", "title": "Abhaya Sutta", "source": "neg"}}
{"text": "\"From the origination of craving comes the origination of clinging. From the cessation of craving comes the cessation of clinging. And the way of practice leading to the cessation of clinging is just this very noble eightfold path: right view, right resolve, right speech, right action, right livelihood, right effort, right mindfulness, right concentration.", "spans": [], "meta": {"identifier": "mn.009.than.html", "title": "Sammaditthi Sutta", "source": "neg"}}
{"text": "\"And this greedy person, overcome by greed, his mind possessed by greed, kills living beings, takes what is not given, goes after another person's wife, tells lies, and induces others to do likewise, all of which is for long-term harm & suffering.\"", "spans": [], "meta": {"identifier": "an03.065.than.html", "title": "Kalama Sutta", "source": "neg"}}
{"text": "\"'I am' is a wavering. 'I am this' is a wavering. 'I shall be' is a wavering. 'I shall not be'... 'I shall be possessed of form'... 'I shall not be possessed of form'... 'I shall be percipient'... 'I shall not be percipient'... 'I shall be neither percipient nor non-percipient' is a wavering. Wavering is a disease, wavering is a cancer, wavering is an arrow. Therefore, monks, you should train yourselves: 'We will dwell with an awareness free of waverings.'", "spans": [], "meta": {"identifier": "sn35.207.than.html", "title": "Yavakalapi Sutta", "source": "neg"}}
{"text": "\"'The Tathagata, monks, is not living luxuriously, has not strayed from his exertion, has not backslid into abundance. The Tathagata, friends, is a worthy one, rightly self-awakened. Lend ear, friends: the Deathless has been attained. I will instruct you. I will teach you the Dhamma. Practicing as instructed, you will in no long time reach & remain in the supreme goal of the holy life for which clansmen rightly go forth from home into homelessness, knowing & realizing it for yourselves in the here & now.'", "spans": [], "meta": {"identifier": "mn.026.than.html", "title": "Ariyapariyesana Sutta", "source": "neg"}}
{"text": "\"Then there is the case where a monk has gone on a journey. The thought occurs to him: 'I have gone on a journey. While I was going on the journey, I couldn't attend to the Buddha's message. Why don't I make an effort for the attaining of the as-yet-unattained, the reaching of the as-yet-unreached, the realization of the as-yet-unrealized?' So he makes an effort for the attaining of the as-yet-unattained, the reaching of the as-yet-unreached, the realization of the as-yet-unrealized. This is the fourth grounds for the arousal of energy.", "spans": [], "meta": {"identifier": "an08.080.than.html", "title": "Kusita-Arambhavatthu Sutta", "source": "neg"}}
{"text": "\"What is meant by not getting what one desires, that too is suffering? To beings subject to birth there comes desire: 'O might we not be subject to birth, and birth not come to us.' But this cannot be attained by mere desiring. So not getting what one desires, that too, is suffering. To beings subject to aging there comes the desire: 'O might we not be subject to aging, and aging not come to us...' (as before). To beings subject to disease there comes the desire: 'O might we not be subject to disease and disease not come to us...' To beings subject to death there comes the desire: 'O might we not be subject to death and death not come to us...' To beings subject to sorrow, lamentation, suffering, misery, and despair there comes the desire: 'O might we not be subject to sorrow, lamentation, suffering, misery, and despair, and sorrow, lamentation, suffering, misery, and despair not come to us.' But this cannot be attained by merely desiring. So not getting what one desires that too is suffering.", "spans": [], "meta": {"identifier": "mn.141.piya.html", "title": "Saccavibhanga Sutta", "source": "neg"}}
{"text": "\"Now from the remainderless fading & cessation of that very ignorance comes the cessation of fabrications. From the cessation of fabrications comes the cessation of consciousness. From the cessation of consciousness comes the cessation of name-&-form. From the cessation of name-&-form comes the cessation of the six sense media. From the cessation of the six sense media comes the cessation of contact. From the cessation of contact comes the cessation of feeling. From the cessation of feeling comes the cessation of craving. From the cessation of craving comes the cessation of clinging/ sustenance. From the cessation of clinging/sustenance comes the cessation of becoming. From the cessation of becoming comes the cessation of birth. From the cessation of birth, then aging & death, sorrow, lamentation, pain, distress, & despair all cease. Such is the cessation of this entire mass of stress & suffering.\"", "spans": [], "meta": {"identifier": "sn12.011.than.html", "title": "Ahara Sutta", "source": "neg"}}
{"text": "\"May I have nothing to do with honor, Nagita, and honor nothing to do with me. Whoever cannot obtain at will — without difficulty, without trouble — as I do, the pleasure of renunciation, the pleasure of seclusion, the pleasure of peace, the pleasure of self-awakening, let him consent to this slimy-excrement-pleasure, this torpor-pleasure, this pleasure of gains, offerings, & fame.\"", "spans": [], "meta": {"identifier": "an08.086.than.html", "title": "Yasa Sutta", "source": "neg"}}
{"text": "[8] \" And what is the perception of distaste for every world? There is the case where a monk abandoning any attachments, clingings, fixations of awareness, biases, or obsessions with regard to any world, refrains from them and does not get involved. This is called the perception of distaste for every world.", "spans": [], "meta": {"identifier": "an10.060.than.html", "title": "Girimananda Sutta", "source": "neg"}}
{"text": "\"So, as I said, Kalamas: 'Don't go by reports, by legends, by traditions, by scripture, by logical conjecture, by inference, by analogies, by agreement through pondering views, by probability, or by the thought, \"This contemplative is our teacher.\" When you know for yourselves that, \"These qualities are skillful; these qualities are blameless; these qualities are praised by the wise; these qualities, when adopted & carried out, lead to welfare & to happiness\" — then you should enter & remain in them.' Thus was it said. And in reference to this was it said.", "spans": [], "meta": {"identifier": "an03.065.than.html", "title": "Kalama Sutta", "source": "neg"}}
{"text": "A2 . \"Because there actually is the next world, the view of one who thinks, 'There is no next world' is his wrong view. Because there actually is the next world, when he is resolved that 'There is no next world,' that is his wrong resolve. Because there actually is the next world, when he speaks the statement, 'There is no next world,' that is his wrong speech. Because there actually is the next world, when he says that 'There is no next world,' he makes himself an opponent to those arahants who know the next world. Because there actually is the next world, when he persuades another that 'There is no next world,' that is persuasion in what is not true Dhamma. And in that persuasion in what is not true Dhamma, he exalts himself and disparages others. Whatever good habituation he previously had is abandoned, while bad habituation is manifested. And this wrong view, wrong resolve, wrong speech, opposition to the arahants, persuasion in what is not true Dhamma, exaltation of self, & disparagement of others: These many evil, unskillful activities come into play, in dependence on wrong view.", "spans": [], "meta": {"identifier": "mn.060.than.html", "title": "Apannaka  Sutta", "source": "neg"}}
{"text": "\"Just as it is not easy to take the measure of the great ocean as 'just this many buckets of water, just this many hundreds of buckets of water, just this many thousands of buckets of water, or just this many hundreds of thousands of buckets of water.' It is simply reckoned as a great mass of water, incalculable, immeasurable. In the same way, it is not easy to take the measure of the merit of a donation thus endowed with six factors as 'just this much a bonanza of merit, a bonanza of what is skillful — a nutriment of bliss, heavenly, resulting in bliss, leading to heaven — that leads to what is desirable, pleasing, charming, beneficial, pleasant.' It is simply reckoned as a great mass of merit, incalculable, immeasurable.\"", "spans": [], "meta": {"identifier": "an06.037.than.html", "title": "Dana Sutta", "source": "neg"}}
{"text": ". \"It may be that, by entirely transcending the sphere of nothingness, some monk enters and abides in the sphere of neither-perception-nor-non-perception; and he then might think: 'I am abiding in effacement.' But in the Noble One's discipline it is not these [attainments] that are called 'effacement'; in the Noble one's discipline they are called 'peaceful abidings.'", "spans": [], "meta": {"identifier": "mn.008.nypo.html", "title": "Sallekha Sutta", "source": "neg"}}
{"text": "[7] \"If a monk would wish, 'May I overcome displeasure, and not be overcome by displeasure. May I dwell conquering again & again any displeasure that has arisen,' then he should be one who brings the precepts to perfection, who is committed to inner tranquillity of awareness, who does not neglect jhana, who is endowed with insight, and who frequents empty dwellings.", "spans": [], "meta": {"identifier": "an10.071.than.html", "title": "Akankha Sutta", "source": "neg"}}
{"text": "\"And what is the individual released through conviction? There is the case where a certain individual does not remain touching with his body those peaceful liberations that transcend form, that are formless, but — having seen with discernment — some of his fermentations are ended, and his conviction in the Tathagata is settled, rooted, and established. This is called an individual who is released through conviction. [8] Regarding this monk, I say that he has a task to do with heedfulness. Why is that? [I think:] 'Perhaps this venerable one, when making use of suitable resting places, associating with admirable friends, balancing his [mental] faculties, will reach & remain in the supreme goal of the holy life for which clansmen rightly go forth from home into homelessness, knowing & realizing it for himself in the here & now.' Envisioning this fruit of heedfulness for this monk, I say that he has a task to do with heedfulness.", "spans": [], "meta": {"identifier": "mn.070.than.html", "title": "Kitagiri Sutta", "source": "neg"}}
{"text": "\"Great king, it was in connection with this that the Blessed One — the One who knows, the One who sees, worthy, & rightly self-awakened — said, 'Sorrow, lamentation, pain, distress, & despair are born from one who is dear, come springing from one who is dear.'", "spans": [], "meta": {"identifier": "mn.087.than.html", "title": "Piyajatika Sutta", "source": "neg"}}
{"text": "\"There is the case where a farming householder quickly gets his field well-plowed & well-harrowed. Having quickly gotten his field well-plowed & well-harrowed, he quickly plants the seed. Having quickly planted the seed, he quickly lets in the water & then lets it out.", "spans": [], "meta": {"identifier": "an03.091.than.html", "title": "Accayika Sutta", "source": "neg"}}
{"text": "\"No matter what Gotama the contemplative says, Mallika endorses it: 'If that was said by the Blessed One, great king, then that's the way it is.' Just as, no matter what his teacher says, a pupil endorses it: 'That's the way it is, teacher. That's the way it is.' In the same way, no matter what Gotama the contemplative says, Mallika endorses it: 'If that was said by the Blessed One, great king, then that's the way it is.' Go away, Mallika! Out of my sight!\"", "spans": [], "meta": {"identifier": "mn.087.than.html", "title": "Piyajatika Sutta", "source": "neg"}}
{"text": "On one occasion the Blessed One was staying at Ajjheya on the bank of the river Ganges. He saw a large log being carried along by the current near the bank of the river Ganges, and on seeing it said to the monks: \"Monks, do you see that large log being carried along by the current of the river Ganges?\"", "spans": [], "meta": {"identifier": "sn35.200.than.html", "title": "Daruka-khandha Sutta", "source": "neg"}}
{"text": "\"And if other people attack the monk in ways that are undesirable, displeasing, & disagreeable — through contact with fists, contact with stones, contact with sticks, or contact with knives — the monk discerns that 'This body is of such a nature that contacts with fists come, contacts with stones come, contacts with sticks come, & contacts with knives come. Now the Blessed One has said, in his exhortation of the simile of the saw, \"Monks, even if bandits were to carve you up savagely, limb by limb, with a two-handled saw, he among you who let his heart get angered even at that would not be doing my bidding.\" So my persistence will be aroused & untiring, my mindfulness established & unconfused, my body calm & unaroused, my mind centered & unified. And now let contact with fists come to this body, let contact with stones, with sticks, with knives come to this body, for this is how the Buddha's bidding is done.'", "spans": [], "meta": {"identifier": "mn.028.than.html", "title": "Maha-hatthipadopama Sutta", "source": "neg"}}
{"text": "\"This is the fifth future danger that is just enough, when considered, for a monk — heedful, ardent, and resolute — to live for the attaining of the as-yet-unattained, the reaching of the as-yet-unreached, the realization of the as-yet-unrealized.", "spans": [], "meta": {"identifier": "an05.078.than.html", "title": "Anagata-bhayani Sutta", "source": "neg"}}
{"text": "\" 'The six internal sense-media should be known': thus was it said. And in reference to what was it said? The eye-medium, the ear-medium, the nose-medium, the tongue-medium, the body-medium, the intellect-medium. 'The six internal sense-media should be known': thus was it said. And in reference to this was it said.", "spans": [], "meta": {"identifier": "mn.137.than.html", "title": "Salayatana-vibhanga Sutta", "source": "neg"}}
{"text": "\"Furthermore, abandoning lying, the disciple of the noble ones abstains from lying. In doing so, he gives freedom from danger, freedom from animosity, freedom from oppression to limitless numbers of beings. In giving freedom from danger, freedom from animosity, freedom from oppression to limitless numbers of beings, he gains a share in limitless freedom from danger, freedom from animosity, and freedom from oppression. This is the fourth gift, the fourth great gift... and this is the seventh reward of merit...", "spans": [], "meta": {"identifier": "an08.039.than.html", "title": "Abhisanda Sutta", "source": "neg"}}
{"text": "\"It is this that distinguishes, that differentiates, the wise hearer who is ennobled [by attainment of the Noble Path] from the unwise ordinary man, when, that is to say, there is a destination for reappearance [after death, but an arahant has made an end of birth].", "spans": [], "meta": {"identifier": "an04.125.nymo.html", "title": "Metta Sutta", "source": "neg"}}
{"text": "\"There is the case where a Tathagata appears in the world, worthy and rightly self-awakened. He teaches the Dhamma admirable in its beginning, admirable in its middle, admirable in its end. He proclaims the holy life both in its particulars and in its essence, entirely perfect, surpassingly pure.", "spans": [], "meta": {"identifier": "mn.060.than.html", "title": "Apannaka  Sutta", "source": "neg"}}
{"text": "\"The intellect is not yours: let go of it. Your letting go of it will be for your long-term happiness & benefit. Ideas are not yours... Intellect-consciousness is not yours... Intellect-contact is not yours... Whatever arises in dependence on intellect-contact, experienced either as pleasure, as pain, or as neither-pleasure-nor-pain, that too is not yours: let go of it. Your letting go of it will be for your long-term happiness & benefit.", "spans": [], "meta": {"identifier": "sn35.101.than.html", "title": "Na Tumhaka Sutta", "source": "neg"}}
{"text": "\"There is the case where a monk, having gone to the wilderness, to the shade of a tree, or to an empty building, sits down folding his legs crosswise, holding his body erect, and setting mindfulness to the fore. Always mindful, he breathes in; mindful he breathes out.", "spans": [], "meta": {"identifier": "sn54.009.than.html", "title": "Vesali Sutta", "source": "neg"}}
{"text": "\"And what is lack of food for the arising of unarisen restlessness & anxiety, or for the growth & increase of restlessness & anxiety once it has arisen? There is the stilling of awareness. To foster appropriate attention to that: This is lack of food for the arising of unarisen restlessness & anxiety, or for the growth & increase of restlessness & anxiety once it has arisen.", "spans": [], "meta": {"identifier": "sn46.051.than.html", "title": "Ahara Sutta", "source": "neg"}}
{"text": "\"The perception of unattractiveness (of the body), the perception of death, the perception of the foulness in food, the perception of no-delight in any world, the perception of inconstancy, the perception of stress in inconstancy, the perception of not-self in stress, the perception of abandoning, the perception of dispassion.", "spans": [], "meta": {"identifier": "an09.016.than.html", "title": "Sañña Sutta", "source": "neg"}}
{"text": "[ At Saavatthii the Blessed One said: ] \"Monks, there are these five groups of clinging. What five? The body-group of clinging, the feeling-group, the perception-group, the mental-formation-group, the consciousness-group of clinging.", "spans": [], "meta": {"identifier": "sn22.109.wlsh.html", "title": "Sotaapanno Sutta", "source": "neg"}}
{"text": "So, having gone for alms in Haliddavasana, after the meal, returning from their alms round, the monks went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As they were sitting there they [told him what had happened.]", "spans": [], "meta": {"identifier": "sn46.054.than.html", "title": "Metta Sutta", "source": "neg"}}
{"text": "\"My friend, I see no one in the cosmos with its devas, Maras & Brahmas, its contemplatives & brahmans, its royalty & commonfolk, who could possess my mind or rip open my heart or, grabbing me by the feet, hurl me across the Ganges. But nevertheless, ask me what you wish.\"", "spans": [], "meta": {"identifier": "sn10.012.than.html", "title": "Alavaka Sutta", "source": "neg"}}
{"text": "\"He is endowed with verified confidence in the Sangha: 'The Sangha of the Blessed One's disciples who have practiced well... who have practiced straight-forwardly... who have practiced methodically... who have practiced masterfully — in other words, the four pairs, the eight individuals [1] — they are the Sangha of the Blessed One's disciples: worthy of gifts, worthy of hospitality, worthy of offerings, worthy of respect, the incomparable field of merit for the world.'", "spans": [], "meta": {"identifier": "an10.092.than.html", "title": "Vera Sutta", "source": "neg"}}
{"text": "Then, there where the Venerable Kāmabhū was, there Citta , the householder, approached. Having approached and having saluted the Venerable Kāmabhū, he sat to one side. Having sat to one side, the Venerable Kāmabhū then said this to Citta, the householder:", "spans": [], "meta": {"identifier": "sn41.005.niza.html", "title": "Pathama Kamabhu", "source": "neg"}}
{"text": "\"In the same way, the monk, when not loaded down, does not load himself down with pain, nor does he reject pleasure that accords with the Dhamma, although he is not infatuated with that pleasure. He discerns that 'When I exert a [physical, verbal, or mental] fabrication against this cause of stress, then from the fabrication of exertion there is dispassion. When I look on with equanimity at that cause of stress, then from the development of equanimity there is dispassion.' So he exerts a fabrication against the cause of stress where there comes dispassion from the fabrication of exertion, and develops equanimity with regard to the cause of stress where there comes dispassion from the development of equanimity. Thus the stress coming from the cause of stress for which there is dispassion through the fabrication of exertion is exhausted & the stress resulting from the cause of stress for which there is dispassion through the development of equanimity is exhausted.", "spans": [], "meta": {"identifier": "mn.101.than.html", "title": "Devadaha Sutta", "source": "neg"}}
{"text": "\"Now, Master Gotama, to what extent is a disciple of Master Gotama one who carries out his message, carries out his instruction, one who has crossed over & beyond doubt, one with no more questioning, one who has gained fearlessness and dwells independent of others with regard to the Teacher's message?\"", "spans": [], "meta": {"identifier": "mn.035.than.html", "title": "Cula-Saccaka Sutta", "source": "neg"}}
{"text": "\"With his mind thus concentrated, purified, and bright, unblemished, free from defects, pliant, malleable, steady, and attained to imperturbability, the monk directs and inclines it to the knowledge of the ending of the mental fermentations. He discerns, as it has come to be, that 'This is stress... This is the origination of stress... This is the cessation of stress... This is the way leading to the cessation of stress... These are mental fermentations... This is the origination of fermentations... This is the cessation of fermentations... This is the way leading to the cessation of fermentations.'", "spans": [], "meta": {"identifier": "mn.027.than.html", "title": "Cula-hatthipadopama Sutta", "source": "neg"}}
{"text": "\" Just as a red, blue, or white lotus born in the water and growing in the water, rises up above the water and stands with no water adhering to it, in the same way the Tathagata — freed, dissociated, & released from these ten things — dwells with unrestricted awareness.\"", "spans": [], "meta": {"identifier": "an10.081.than.html", "title": "Bahuna Sutta", "source": "neg"}}
{"text": "\"Now, monks, when those six hungry animals grew weary, they would yield to the one that was the strongest, go his way and be under his power. In the same way, monks, whenever a monk fails to practice and develop mindfulness as to body, the eye struggles to draw him towards attractive objects, while unattractive objects are repellent to him... The mind struggles to draw him towards attractive objects of thought, while unattractive objects of thought are repellent to him. This, monks, is lack of restraint. And what, monks, is restraint? In this, a monk, seeing objects with the eye, is not drawn to attractive objects, is not repelled by unattractive objects. He remains with firmly established mindfulness as to body, his mind being unrestricted. [1] He knows in truth that liberation of the heart, that liberation by wisdom, [2] through which those evil, unskilled states that have arisen pass away without remainder...", "spans": [], "meta": {"identifier": "sn35.206x.wlsh.html", "title": "Chapaa.na Sutta", "source": "neg"}}
{"text": "\"He keeps pervading the first direction — as well as the second direction, the third, & the fourth — with an awareness imbued with equanimity. Thus he keeps pervading above, below, & all around, everywhere & in every respect the all-encompassing cosmos with an awareness imbued with equanimity: abundant, expansive, immeasurable, free from hostility, free from ill will.", "spans": [], "meta": {"identifier": "an03.065.than.html", "title": "Kalama Sutta", "source": "neg"}}
{"text": "\"One makes an effort for the abandoning of wrong resolve & for entering right resolve: This is one's right effort. One is mindful to abandon wrong resolve & to enter & remain in right resolve: This is one's right mindfulness. Thus these three qualities — right view, right effort, & right mindfulness — run & circle around right resolve.", "spans": [], "meta": {"identifier": "mn.117.than.html", "title": "Maha-cattarisaka Sutta", "source": "neg"}}
{"text": "\"'Furthermore, he keeps his persistence aroused for abandoning unskillful mental qualities and for taking on skillful mental qualities. He is steadfast, solid in his effort, not shirking his duties with regard to skillful mental qualities. This is the fourth prerequisite for the development of the wings to self-awakening.", "spans": [], "meta": {"identifier": "an09.001.than.html", "title": "Sambodhi Sutta", "source": "neg"}}
{"text": "\"Then again, monks, we may have a certain goodly thoroughbred steed which is not stirred... at the sight of the goad-stick's shade, nor yet when his coat is pricked with the goad, but when his flesh is pierced, he is stirred, he feels agitated [thinking:] 'What task, I wonder...' This is the third sort...", "spans": [], "meta": {"identifier": "an04.113.wood.html", "title": "Patoda Sutta", "source": "neg"}}
{"text": "\"There is the case where a disciple of the noble ones, abandoning the taking of life, abstains from taking life. In doing so, he gives freedom from danger, freedom from animosity, freedom from oppression to limitless numbers of beings. In giving freedom from danger, freedom from animosity, freedom from oppression to limitless numbers of beings, he gains a share in limitless freedom from danger, freedom from animosity, and freedom from oppression. This is the first gift, the first great gift — original, long-standing, traditional, ancient, unadulterated, unadulterated from the beginning — that is not open to suspicion, will never be open to suspicion, and is unfaulted by knowledgeable contemplatives & brahmans. And this is the fourth reward of merit...", "spans": [], "meta": {"identifier": "an08.039.than.html", "title": "Abhisanda Sutta", "source": "neg"}}
{"text": "\"And who is the individual who goes against the flow? There is the case where an individual doesn't indulge in sensual passions and doesn't do evil deeds. Even though it may be with pain, even though it may be with sorrow, even though he may be crying, his face in tears, he lives the holy life that is perfect & pure. This is called the individual who goes against the flow.", "spans": [], "meta": {"identifier": "an04.005.than.html", "title": "Anusota Sutta", "source": "neg"}}
{"text": "\"Oh, Brahman, I know of nobody in this world with its gods, Maaras and Brahmaas, with its recluses and brahmans, whether they be divine or human, who could thus rebuke the Blessed One, the Arahant, the Fully Self-Enlightened One. But go on, Brahman, go and you will find out.\"", "spans": [], "meta": {"identifier": "sn07.001.wlsh.html", "title": "Dhanañjaanii Sutta", "source": "neg"}}
{"text": "[9] \"The thought occurred to me: 'What if I, with the complete transcending of the dimension of neither perception nor non-perception, were to enter & remain in the cessation of perception & feeling?' But my heart didn't leap up at the cessation of perception & feeling, didn't grow confident, steadfast, or firm, seeing it as peace. The thought occurred to me: 'What is the cause, what is the reason, why my heart doesn't leap up at the cessation of perception & feeling, doesn't grow confident, steadfast, or firm, seeing it as peace?' Then the thought occurred to me: 'I haven't seen the drawback of the dimension of neither perception nor non-perception; I haven't pursued that theme. I haven't understood the reward of the cessation of perception & feeling; I haven't familiarized myself with it. That's why my heart doesn't leap up at the cessation of perception & feeling, doesn't grow confident, steadfast, or firm, seeing it as peace.'", "spans": [], "meta": {"identifier": "an09.041.than.html", "title": "Tapussa Sutta", "source": "neg"}}
{"text": "\"Once upon a time, monks, a hard-shelled tortoise was foraging for food in the evening along the shore of a lake. And a jackal was also foraging for food in the evening along the shore of the lake. The tortoise saw the jackal from afar, foraging for food, and so — withdrawing its four legs, with its neck as a fifth, into its own shell — it remained perfectly quiet and still. But the jackal also saw the tortoise from afar, foraging for food, and so it went to the tortoise and, on arrival, hovered around it, [thinking,] \"As soon as the tortoise stretches out one or another of its four limbs — or its neck as a fifth — I'll seize it right there, tear it off, and eat it.\" But when the tortoise didn't stretch out any of its four limbs — or its neck as a fifth — the jackal, not having gotten any opportunity, lost interest and left.", "spans": [], "meta": {"identifier": "sn35.199.than.html", "title": "Kumma Sutta", "source": "neg"}}
{"text": "And what is lack of food for the arising of unarisen ill will, or for the growth & increase of ill will once it has arisen? There is awareness-release. [1] To foster appropriate attention to that: This is lack of food for the arising of unarisen ill will, or for the growth & increase of ill will once it has arisen.", "spans": [], "meta": {"identifier": "sn46.051.than.html", "title": "Ahara Sutta", "source": "neg"}}
{"text": "\"What do you think, Assalayana? Is it only a noble warrior who — taking life, stealing, engaging in sexual misconduct, telling lies, speaking divisively, speaking harshly, engaging in idle chatter, greedy, bearing thoughts of ill will, and holding wrong views — on the break-up of the body, after death, reappears in the plane of deprivation, the bad destination, the lower realms, in hell, and not a brahman? Is it only a merchant...? Is it only a worker who — taking life, stealing, engaging in sexual misconduct, telling lies, speaking divisively, speaking harshly, engaging in idle chatter, greedy, bearing thoughts of ill will, and holding wrong views — on the break-up of the body, after death, reappears in the plane of deprivation, the bad destination, the lower realms, in hell, and not a brahman?\"", "spans": [], "meta": {"identifier": "mn.093.than.html", "title": "Assalayana Sutta", "source": "neg"}}
{"text": "\"Drunk with the intoxication of youth, a monk leaves the training and returns to the lower life. Drunk with the intoxication of health, a monk leaves the training and returns to the lower life. Drunk with the intoxication of life, a monk leaves the training and returns to the lower life.\"", "spans": [], "meta": {"identifier": "an03.038.than.html", "title": "Sukhamala Sutta", "source": "neg"}}
{"text": "\"But suppose, monks, there is some ripe corn, and a vigilant guardian. And an ox, fond of corn, gets into the field. The guardian seizes him firmly by the muzzle. Holding him by the muzzle, he gets a firm grip on his forehead and holds him fast. He then gives him a sound thrashing with a stick, and then lets him go [ a second and a third time he does this. ] So it comes about monks, that that ox, fond of corn, though he wanders about in the village or the forest, whether he stands still or lies down, will not go into that field again because he remember the beating he got there before. In the same way, monks, when a monk's mind is strongly stirred by the six sense-spheres, nevertheless he stands firm inwardly, becomes calm, one-pointed and concentrated.\" [3]", "spans": [], "meta": {"identifier": "sn35.205x.wlsh.html", "title": "Vii.naa Sutta", "source": "neg"}}
{"text": "\"Then again, the monks accuse a monk of an offense. He, being accused of an offense by the monks, speaks waving his arms around in the midst of the Sangha. He, I tell you, is just like the unruly horse who — when goaded, ordered, and told 'Go!' by the charioteer — rears up and paws the air. Some unruly men are like this. This is the fifth fault in a man.", "spans": [], "meta": {"identifier": "an08.014.than.html", "title": "Khalunga Sutta", "source": "neg"}}
{"text": "\" — nor with the thought, 'I am well-off. These are not well-off. It would not be right for me, being well-off, not to give a gift to those who are not well-off,' nor with the thought, 'Just as there were the great sacrifices of the sages of the past — Atthaka, Vamaka, Vamadeva, Vessamitta, Yamataggi, Angirasa, Bharadvaja, Vasettha, Kassapa, & Bhagu — in the same way this will be my distribution of gifts,'", "spans": [], "meta": {"identifier": "an07.049.than.html", "title": "Dana Sutta", "source": "neg"}}
{"text": "When this was said, Talaputa, the head of an acting troupe, sobbed & burst into tears. [The Blessed One said:] \"That is what I couldn't get past you by saying, 'Enough, headman, put that aside. Don't ask me that.'\"", "spans": [], "meta": {"identifier": "sn42.002.than.html", "title": "Talaputa Sutta", "source": "neg"}}
{"text": "\"In the same way, any brahmans or contemplatives endowed with right view, right resolve, right speech, right action, right livelihood, right effort, right mindfulness, & right concentration: If they follow the holy life even when having made a wish [for results]... having made no wish... both having made a wish and having made no wish... neither having made a wish nor having made no wish, they are capable of obtaining results. Why is that? Because it is an appropriate way of obtaining results.", "spans": [], "meta": {"identifier": "mn.126.than.html", "title": "Bhumija Sutta", "source": "neg"}}
{"text": "\"Now, what do you think, young man. Might there arise in that householder or householder's son any bodily fevers or fevers of mind born of aversion so that — burned with those aversion-born fevers — he would sleep miserably?\"", "spans": [], "meta": {"identifier": "an03.034.than.html", "title": "Hatthaka Sutta", "source": "neg"}}
{"text": "\"Now what is dependent co-arising? From birth as a requisite condition comes aging & death. Whether or not there is the arising of Tathagatas, this property stands — this regularity of the Dhamma, this orderliness of the Dhamma, this this/that conditionality. The Tathagata directly awakens to that, breaks through to that. Directly awakening & breaking through to that, he declares it, teaches it, describes it, sets it forth. He reveals it, explains it, makes it plain, & says, 'Look.' From birth as a requisite condition comes aging & death.", "spans": [], "meta": {"identifier": "sn12.020.than.html", "title": "Paccaya Sutta", "source": "neg"}}
{"text": "\"So at a later time, having seen the drawback of sensual pleasures, I pursued that theme; having understood the reward of renunciation, I familiarized myself with it. My heart leaped up at renunciation, grew confident, steadfast, & firm, seeing it as peace. Then, quite withdrawn from sensuality, withdrawn from unskillful qualities, I entered & remained in the first jhana: rapture & pleasure born from withdrawal, accompanied by directed thought & evaluation.", "spans": [], "meta": {"identifier": "an09.041.than.html", "title": "Tapussa Sutta", "source": "neg"}}
{"text": "\"Then there is the case where a monk has done some work. The thought occurs to him: 'I have done some work. While I was doing work, I couldn't attend to the Buddha's message. Why don't I make an effort for the attaining of the as-yet-unattained, the reaching of the as-yet-unreached, the realization of the as-yet-unrealized?' So he makes an effort for the attaining of the as-yet-unattained, the reaching of the as-yet-unreached, the realization of the as-yet-unrealized. This is the second grounds for the arousal of energy.", "spans": [], "meta": {"identifier": "an08.080.than.html", "title": "Kusita-Arambhavatthu Sutta", "source": "neg"}}
{"text": "When this was said, Asibandhakaputta the headman, the disciple of the Niganthas, said to the Blessed One: \" Magnificent , lord! Magnificent! Just as if he were to place upright what was overturned, to reveal what was hidden, to point out the way to one who was lost, or to carry a lamp into the dark so that those with eyes could see forms, in the same way has the Blessed One — through many lines of reasoning — made the Dhamma clear. I go to the Blessed One for refuge, to the Dhamma, & to the community of monks. May the Blessed One remember me as a lay follower who has gone for refuge from this day forward, for life.\"", "spans": [], "meta": {"identifier": "sn42.008.than.html", "title": "Sankha Sutta", "source": "neg"}}
{"text": "Then the Blessed One, emerging from his seclusion in the late afternoon, went to the meeting hall and, on arrival, sat down on a seat made ready. As he was sitting there, he addressed the monks: \"For what topic are you gathered together here? And what was the discussion that came to no conclusion?\"", "spans": [], "meta": {"identifier": "mn.119.than.html", "title": "Kayagata-sati Sutta", "source": "neg"}}
{"text": "\" It wasn't the case, brahman, that the Blessed One praised mental absorption of every sort, nor did he criticize mental absorption of every sort. And what sort of mental absorption did he not praise? There is the case where a certain person dwells with his awareness overcome by sensual passion, seized with sensual passion. He does not discern the escape, as it actually is present, from sensual passion once it has arisen. Making that sensual passion the focal point, he absorbs himself with it, besorbs, resorbs, & supersorbs himself with it.", "spans": [], "meta": {"identifier": "mn.108.than.html", "title": "Gopaka Moggallana Sutta", "source": "neg"}}
{"text": ". \"And he will never infer of me according to Dhamma: 'That Blessed One enjoys the various kinds of supernormal power: having been one, he becomes many; having been many, he becomes one; he appears and vanishes; he goes unhindered through a wall, through an enclosure, through a mountain, as though through space; he dives in and out of the earth as though it were water; he walks on water without sinking as though it were earth; seated cross-legged, he travels in space like a bird; with his hand he touches and strokes the moon and sun so powerful and mighty; he wields bodily mastery even as far as the Brahma-world.'", "spans": [], "meta": {"identifier": "mn.012.ntbb.html", "title": "Maha-sihanada Sutta", "source": "neg"}}
{"text": "\"Therefore, monks, if others insult, abuse, taunt, bother, & harass you as well, you should feel no hatred, no resentment, no dissatisfaction of heart because of that. And if others honor, respect, revere, & venerate you as well, you should feel no joy, no gladness, no elation of heart because of that. And if others honor, respect, revere, & venerate you, you should think, 'They do us [16] such service at this that has already been comprehended.'", "spans": [], "meta": {"identifier": "mn.022.than.html", "title": "Alagaddupama Sutta", "source": "neg"}}
{"text": "\"Lord, when wise nobles or brahmans, householders or contemplatives, having formulated questions, come to the Tathagata and ask him, does this line of reasoning appear to his awareness beforehand — 'If those who approach me ask this, I — thus asked — will answer in this way' — or does the Tathagata come up with the answer on the spot?\"", "spans": [], "meta": {"identifier": "mn.058.than.html", "title": "Abhaya Sutta", "source": "neg"}}
{"text": "\"'From the cessation of ignorance comes the cessation of fabrications': Thus was it said. Now, monks, is it the case that from cessation of ignorance comes the cessation of fabrications, or not, or how is it here?\"", "spans": [], "meta": {"identifier": "mn.038.than.html", "title": "Mahatanhasankhaya Sutta", "source": "neg"}}
{"text": "\"And what is the development of concentration that, when developed & pursued, leads to mindfulness & alertness? There is the case where feelings are known to the monk as they arise, known as they persist, known as they subside. Perceptions are known to him as they arise, known as they persist, known as they subside. Thoughts are known to him as they arise, known as they persist, known as they subside. This is the development of concentration that, when developed & pursued, leads to mindfulness & alertness.", "spans": [], "meta": {"identifier": "an04.041.than.html", "title": "Samadhi Sutta", "source": "neg"}}
{"text": ". \"It may be that after the stilling of thought conception and discursive thinking, he gains the inner tranquillity and harmony of the second absorption that is free of thought-conception and discursive thinking, born of concentration and filled with rapture and joy; and he then might think: 'I am abiding in effacement.' But in the Noble One's discipline it is not these [attainments] that are called 'effacement'; in the Noble One's discipline they are called 'abidings in ease here and now.'", "spans": [], "meta": {"identifier": "mn.008.nypo.html", "title": "Sallekha Sutta", "source": "neg"}}
{"text": "\"There is the case where a monk, having gone to the wilderness, to the shade of a tree, or to an empty building, sits down folding his legs crosswise, holding his body erect, and setting mindfulness to the fore. [1] Always mindful, he breathes in; mindful he breathes out.", "spans": [], "meta": {"identifier": "mn.118.than.html", "title": "Anapanasati Sutta", "source": "neg"}}
{"text": "\"Then again, a person of no integrity, when asked, does not reveal his own bad points, to say nothing of when unasked. Furthermore, when asked, when pressed with questions, he is one who speaks of his own bad points not in full, not in detail, with omissions, holding back. Of this person you may know, 'This venerable one is a person of no integrity.'", "spans": [], "meta": {"identifier": "an04.073.than.html", "title": "Sappurisa Sutta", "source": "neg"}}
{"text": "\"If one — a person of Dhamma conduct, harmonious conduct — should wish: 'O if I, with the break-up of the body, after death, were to reappear among well-to-do householders, it is possible that one — with the break-up of the body, after death — would appear among well-to-do householders. Why is that? Because one is a person of Dhamma conduct, harmonious conduct.", "spans": [], "meta": {"identifier": "mn.041.than.html", "title": "Saleyyaka Sutta", "source": "neg"}}
{"text": "\" And, Udayin, there are these five strings of sensuality. Which five? Forms cognizable via the eye — agreeable, pleasing, charming, endearing, fostering desire, enticing. Sounds cognizable via the ear... Aromas cognizable via the nose... Flavors cognizable via the tongue... Tactile sensations cognizable via the body — agreeable, pleasing, charming, endearing, fostering desire, enticing. These are the five strings of sensuality. Now, any pleasure & happiness that arises dependent on these five strings of sensuality is called sensual pleasure, a filthy pleasure, a run-of-the-mill pleasure, an ignoble pleasure. And of this pleasure I say that it is not to be cultivated, not to be developed, not to be pursued, that it is to be feared.", "spans": [], "meta": {"identifier": "mn.066.than.html", "title": "Latukikopama Sutta", "source": "neg"}}
{"text": "\"Lord, those are the brahman householders of Icchanangala standing at the gate house to the Icchanangala forest grove, having brought many staple & non-staple foods for the sake of the Blessed One & the community of monks.\"", "spans": [], "meta": {"identifier": "an05.030.than.html", "title": "Nagita Sutta", "source": "neg"}}
{"text": "\"Marvelous it is, most wonderful it is, bhikkhus, concerning those disciples, that they will act in accordance with the Master's Dispensation, will act in according to his advice; that they will be dear to the four Assemblies, will be loved, respected and honored by them. Marvelous it is, most wonderful it is, bhikkhus, concerning the Perfect Ones, that when such a pair of disciples has passed away there is no grief, no lamentation on the part of the Perfect One.", "spans": [], "meta": {"identifier": "sn47.014.nypo.html", "title": "Cunda Sutta", "source": "neg"}}
{"text": "\"Master Gotama, of these three miracles, the miracle of psychic power where a certain person wields manifold psychic powers... (and) exercises influence with his body even as far as the Brahma worlds: that is a miracle experienced only by him who does it; it belongs only to him who does it. It seems to me to be of the nature of an illusion.", "spans": [], "meta": {"identifier": "an03.060.than.html", "title": "Sangarava Sutta", "source": "neg"}}
{"text": "The four true realities taught by the Buddha are not as such things to \"believe\" but to be open to, see and contemplate, and respond to appropriately: by fully understanding dukkha/pain/the painful, abandoning that which originates it, personally experiencing its cessation, and cultivating the path that leads to this. These four true realities are the four fundamental dimensions of experience, as seen by a spiritually noble person with deep wisdom: the conditioned world, that which originates it, the cessation/transcending of it (the unconditioned, Nibbāna), and the path to this. Indeed, it is by insight into these that a person becomes spiritually ennobled.", "spans": [], "meta": {"identifier": "sn56.011.harv.html", "title": "Dhammacakkappavattana Sutta", "source": "neg"}}
{"text": "\"Now this , bhikkhus, for the spiritually ennobled ones, is the pain-ceasing true reality. It is the remainderless fading away and cessation of that same craving, the giving up and relinquishing of it, freedom from it, non-reliance on it.", "spans": [], "meta": {"identifier": "sn56.011.harv.html", "title": "Dhammacakkappavattana Sutta", "source": "neg"}}
{"text": "\"And which is pleasant practice with slow intuition? There is the case where a certain individual is normally not of an intensely passionate nature. He does not perpetually experience pain & distress born of passion. Or he is normally not of an intensely aversive nature. He does not perpetually experience pain & distress born of aversion. Or he is normally not of an intensely deluded nature. He does not perpetually experience pain & distress born of delusion. These five faculties of his — the faculty of conviction, the faculty of persistence, the faculty of mindfulness, the faculty of concentration, the faculty of discernment — appear weakly. Because of their weakness, he attains only slowly the immediacy that leads to the ending of the effluents. This is called pleasant practice with slow intuition.", "spans": [], "meta": {"identifier": "an04.162.than.html", "title": "Vitthara Sutta", "source": "neg"}}
{"text": "\"Lord, if one clings to the body, one is in bondage to Maara. If one does not cling to the body, one is free of the Evil One. [ Similarly with 'feelings,' 'perceptions,' 'mental formations,' 'consciousness.'] That, Lord, is how I understand in full the sense of what the Blessed One has stated in brief.\"", "spans": [], "meta": {"identifier": "sn22.063.wlsh.html", "title": "Upaadiyamaano Sutta", "source": "neg"}}
{"text": "\" Then the king would split the lute into ten pieces, a hundred pieces. Having split the lute into ten pieces, a hundred pieces, he would shave it to splinters. Having shaved it to splinters, he would burn it in a fire. Having burned it in a fire, he would reduce it to ashes. Having reduced it to ashes, he would winnow it before a high wind or let it be washed away by a swift-flowing stream. He would then say, 'A sorry thing, this lute — whatever a lute may be — by which people have been so thoroughly tricked & deceived.'", "spans": [], "meta": {"identifier": "sn35.205.than.html", "title": "Vina Sutta", "source": "neg"}}
{"text": "\"You've gone too far, friend Visakha. You can't keep holding on up to the limit of questions. For the holy life gains a footing in Unbinding, culminates in Unbinding, has Unbinding as its final end. If you wish, go to the Blessed One and ask him the meaning of these things. Whatever he says, that's how you should remember it.\"", "spans": [], "meta": {"identifier": "mn.044.than.html", "title": "Culavedalla Sutta", "source": "neg"}}
{"text": "\"And what more is to be done? 'Our bodily conduct will be pure, clear & open, unbroken & restrained. We will not exalt ourselves nor disparage others on account of that pure bodily conduct': That's how you should train yourselves. Now the thought may occur to you, 'We are endowed with conscience & concern. Our bodily conduct is pure. That much is enough, that much means we're done, so that the goal of our contemplative state has been reached. There's nothing further to be done,' and you may rest content with just that. So I tell you, monks. I exhort you, monks. Don't let those of you who seek the contemplative state fall away from the goal of the contemplative state when there is more to be done.", "spans": [], "meta": {"identifier": "mn.039.than.html", "title": "Maha-Assapura Sutta", "source": "neg"}}
{"text": "\"When he recollects his manifold past lives... in their modes & details, that is a matter of his clear-knowing. When he sees — by means of the divine eye, purified & surpassing the human — beings passing away & re-appearing... When he enters & remains in the fermentation-free awareness-release & discernment-release, having directly known & realized them for himself right in the here & now, that is a matter of his clear-knowing.", "spans": [], "meta": {"identifier": "mn.053.than.html", "title": "Sekha-patipada Sutta", "source": "neg"}}
{"text": "\"If that is what Master Bhumija's teacher says, if that is his view, if that is what he declares, then yes, Master Bhumija's teacher stands, as it were, having struck all of those many brahmans & contemplatives down by the head.\"", "spans": [], "meta": {"identifier": "mn.126.than.html", "title": "Bhumija Sutta", "source": "neg"}}
{"text": "\"Again, there is the case where an individual keeps pervading the first direction — as well as the second direction, the third, & the fourth — with an awareness imbued with compassion... appreciation... equanimity. Thus he keeps pervading above, below, & all around, everywhere & in every respect the all-encompassing cosmos with an awareness imbued with equanimity: abundant, expansive, immeasurable, free from hostility, free from ill will. He regards whatever phenomena there that are connected with form, feeling, perception, fabrications, & consciousness, as inconstant, stressful, a disease, a cancer, an arrow, painful, an affliction, alien, a disintegration, an emptiness, not-self. At the break-up of the body, after death, he reappears in conjunction with the devas of the Pure Abodes. This rebirth is not in common with run-of-the-mill people.", "spans": [], "meta": {"identifier": "an04.126.than.html", "title": "Metta Sutta", "source": "neg"}}
{"text": "\"Furthermore, he is endowed with virtues that are appealing to the noble ones: untorn, unbroken, unspotted, unsplattered, liberating, praised by the wise, untarnished, leading to concentration. This is the fourth pleasant mental abiding in the here & now that he has attained, for the purification of the mind that is impure, for the cleansing of the mind that is unclean.", "spans": [], "meta": {"identifier": "an05.179.than.html", "title": "Gihi Sutta", "source": "neg"}}
{"text": "\"These are the six conditions that are conducive to amiability, that engender feelings of endearment, engender feelings of respect, leading to a sense of fellowship, a lack of disputes, harmony, & a state of unity.\"", "spans": [], "meta": {"identifier": "an06.012.than.html", "title": "Saraniya Sutta", "source": "neg"}}
{"text": "I have heard that on one occasion the Blessed One, on a wandering tour among the Kosalans with a large community of monks, arrived at a Kosalan brahman village named Icchanangala . There he stayed in the Icchanangala forest grove.", "spans": [], "meta": {"identifier": "an05.030.than.html", "title": "Nagita Sutta", "source": "neg"}}
{"text": "\"And how is there lack of bondage? A woman does not attend inwardly to her feminine faculties... feminine charms. She is not excited by that, not delighted by that... does not attend outwardly to masculine faculties... masculine charms. She is not excited by that, not delighted by that... does not want to be bonded to what is outside her, does not want whatever pleasure & happiness that arise based on that bond. Not delighting, not caught up in her femininity, a woman does not go into bondage with reference to men. This is how a woman transcends her femininity.", "spans": [], "meta": {"identifier": "an07.048.than.html", "title": "Saññoga Sutta", "source": "neg"}}
{"text": "\"Monks, it's through his way of participating in a discussion that a person can be known as fit to talk with or unfit to talk with. If a person, when asked a question, puts down [the questioner], crushes him, ridicules him, grasps at his little mistakes, then — that being the case — he is a person unfit to talk with. But if a person, when asked a question, doesn't put down [the questioner], doesn't crush him, doesn't ridicule him, doesn't grasp at his little mistakes, then — that being the case — he is a person fit to talk with.", "spans": [], "meta": {"identifier": "an03.067.than.html", "title": "Kathavatthu Sutta", "source": "neg"}}
{"text": "\"It would be for the sake of perfecting an unperfected aggregate of release that I would dwell in dependence on another brahman or contemplative, honoring and respecting him. However, in this world with its devas, Maras, & Brahmas, in this generation with its brahmans and contemplatives, its royalty and common-folk, I do not see another brahman or contemplative more consummate in release than I, on whom I could dwell in dependence, honoring and respecting him.", "spans": [], "meta": {"identifier": "sn06.002.than.html", "title": "Garava Sutta", "source": "neg"}}
{"text": "Herein, monks, a monk knows the consciousness with lust, as with lust; the consciousness without lust, as without lust; the consciousness with hate, as with hate; the consciousness without hate, as without hate; the consciousness with ignorance, as with ignorance; the consciousness without ignorance, as without ignorance; the shrunken state of consciousness, as the shrunken state; [13] the distracted state of consciousness, as the distracted state; [14] the developed state of consciousness as the developed state; [15] the undeveloped state of consciousness as the undeveloped state; [16] the state of consciousness with some other mental state superior to it, as the state with something mentally higher; [17] the state of consciousness with no other mental state superior to it, as the state with nothing mentally higher; [18] the concentrated state of consciousness, as the concentrated state; the unconcentrated state of consciousness, as the unconcentrated state; the freed state of consciousness, as the freed state; [19] and the unfreed state of consciousness as the unfreed state.", "spans": [], "meta": {"identifier": "mn.010.nysa.html", "title": "Satipatthana Sutta", "source": "neg"}}
{"text": "\"If a monk should wish: 'May I, with the complete transcending of the dimension of the infinitude of space, (perceiving,) 'Infinite consciousness,' enter & remain in the dimension of the infinitude of consciousness,' then he should attend carefully to this same concentration through mindfulness of in-&-out breathing.", "spans": [], "meta": {"identifier": "sn54.008.than.html", "title": "Dipa Sutta", "source": "neg"}}
{"text": "\"And how is training a reward? There is the case where the training I have formulated for my disciples with regard to good conduct is for the arousing of faith in those without faith, and for the increase of the faithful. And however I have formulated the training for my disciples with regard to good conduct for the arousing of faith in those without faith, and for the increase of the faithful, one behaves in a way that is untorn in line with that training — unbroken, unspotted, unsplattered. Having undertaken them, one trains in line with the training rules.", "spans": [], "meta": {"identifier": "an04.245.than.html", "title": "Sikkha Sutta", "source": "neg"}}
{"text": ". \"I heard and learned this, friend Samiddhi, from the monk Gotama's lips: 'Bodily kammas are vain, verbal kammas are vain, only mental kammas are true.' But there is actually that attainment having entered upon which nothing (of result of kammas) is felt at all.\"", "spans": [], "meta": {"identifier": "mn.136.nymo.html", "title": "Maha Kammavibhanga Sutta", "source": "neg"}}
{"text": "\" [1] Now, on whatever occasion a monk breathing in long discerns that he is breathing in long; or breathing out long, discerns that he is breathing out long; or breathing in short, discerns that he is breathing in short; or breathing out short, discerns that he is breathing out short; trains himself to breathe in... &... out sensitive to the entire body; trains himself to breathe in... &... out calming the bodily processes: On that occasion the monk remains focused on the body in & of itself — ardent, alert, & mindful — putting aside greed & distress with reference to the world. I tell you that this — the in-&-out breath — is classed as a body among bodies, which is why the monk on that occasion remains focused on the body in & of itself — ardent, alert, & mindful — putting aside greed & distress with reference to the world.", "spans": [], "meta": {"identifier": "sn54.013.than.html", "title": "Ananda Sutta", "source": "neg"}}
{"text": "\"There are some contemplatives & brahmans who hold this doctrine, hold this view: 'There is no total cessation of becoming.' Some contemplatives & brahmans, speaking in direct opposition to those contemplatives & brahmans, say this: 'There is total cessation of becoming.' What do you think, householders? Don't these contemplatives & brahmans speak in direct opposition to each other?\"", "spans": [], "meta": {"identifier": "mn.060.than.html", "title": "Apannaka  Sutta", "source": "neg"}}
{"text": "\"Thus, friend Yamaka, any form whatsoever that is past, future, or present; internal or external; blatant or subtle; common or sublime; far or near: Every form is to be seen with right discernment as it has come to be: 'This is not mine. This is not my self. This is not what I am.'", "spans": [], "meta": {"identifier": "sn22.085.than.html", "title": "Yamaka Sutta", "source": "neg"}}
{"text": ". \"When, friends, a noble disciple understands craving, the origin of craving, the cessation of craving, and the way leading to the cessation of craving, in that way he is one of right view... and has arrived at this true Dhamma.", "spans": [], "meta": {"identifier": "mn.009.ntbb.html", "title": "Sammaditthi Sutta", "source": "neg"}}
{"text": "\"Then there is the case where a monk, having gone for alms in a village or town, does get as much coarse or refined food as he needs to fill himself up. The thought occurs to him: 'I, having gone for alms in a village or town, have gotten as much coarse or refined food as I need to fill myself up. This body of mine is light & suitable for work. Why don't I make an effort for the attaining of the as-yet-unattained, the reaching of the as-yet-unreached, the realization of the as-yet-unrealized?' [1] So he makes an effort for the attaining of the as-yet-unattained, the reaching of the as-yet-unreached, the realization of the as-yet-unrealized. This is the sixth grounds for the arousal of energy.", "spans": [], "meta": {"identifier": "an08.080.than.html", "title": "Kusita-Arambhavatthu Sutta", "source": "neg"}}
{"text": "\"But then there is the case where a woman or man when visiting a brahman or contemplative, asks: 'What is skillful, venerable sir? What is unskillful? What is blameworthy? What is blameless? What should be cultivated? What should not be cultivated? What, having been done by me, will be for my long-term harm & suffering? Or what, having been done by me, will be for my long-term welfare & happiness?' Through having adopted & carried out such actions, on the break-up of the body, after death, he/she reappears in a good destination... If instead he/she comes to the human state, then he/she is discerning wherever reborn. This is the way leading to discernment: when visiting a brahman or contemplative, to ask: 'What is skillful?... Or what, having been done by me, will be for my long-term welfare & happiness?'", "spans": [], "meta": {"identifier": "mn.135.than.html", "title": "Cula-kammavibhanga Sutta", "source": "neg"}}
{"text": "\"Now, what are the frames of reference? There is the case where a monk remains focused on the body in & of itself — ardent, alert, & mindful — putting aside greed & distress with reference to the world. He remains focused on feelings in & of themselves... mind in & of itself... mental qualities in & of themselves — ardent, alert, & mindful — putting aside greed & distress with reference to the world.", "spans": [], "meta": {"identifier": "sn47.040.than.html", "title": "Satipatthana-vibhanga Sutta", "source": "neg"}}
{"text": "\" And what are the six kinds of renunciation equanimity? The equanimity that arises when — experiencing the inconstancy of those very forms, their change, fading, & cessation — one sees with right discernment as it actually is that all forms, past or present, are inconstant, stressful, subject to change: This equanimity goes beyond form, which is why it is called renunciation equanimity. (Similarly with sounds, smells, tastes, tactile sensations, & ideas.)", "spans": [], "meta": {"identifier": "mn.137.than.html", "title": "Salayatana-vibhanga Sutta", "source": "neg"}}
{"text": "Thus he lives contemplating the body in the body internally, or he lives contemplating the body in the body externally, or he lives contemplating the body in the body internally and externally. [4] He lives contemplating origination factors [5] in the body, or he lives contemplating dissolution factors [6] in the body, or he lives contemplating origination-and-dissolution factors [7] in the body. Or his mindfulness is established with the thought: \"The body exists,\" [8] to the extent necessary just for knowledge and mindfulness, and he lives detached, [9] and clings to nothing in the world. Thus also, monks, a monk lives contemplating the body in the body.", "spans": [], "meta": {"identifier": "mn.010.nysa.html", "title": "Satipatthana Sutta", "source": "neg"}}
{"text": "\"Therefore, monks, your duty is the contemplation, 'This is stress... This is the origination of stress... This is the cessation of stress.' Your duty is the contemplation, 'This is the path of practice leading to the cessation of stress.'\"", "spans": [], "meta": {"identifier": "sn56.044.than.html", "title": "Kuta Sutta", "source": "neg"}}
{"text": "Then the thought occurred to Ven. Rahula, \"Who, having been exhorted face-to-face by the Blessed One, would go into the town for alms today?\" So he turned back and sat down at the foot of a tree, folding his legs crosswise, holding his body erect, & setting mindfulness to the fore.", "spans": [], "meta": {"identifier": "mn.062.than.html", "title": "Maha-Rahulovada Sutta", "source": "neg"}}
{"text": "\"Now what is unworldly happiness? Quite secluded from sense desires, secluded from unwholesome states of mind, a monk enters upon and abides in the first meditative absorption... With the stilling of thought-conception and discursive thinking, he enters upon and abides in the second meditative absorption... With the fading away of joy as well, he dwells in equanimity, mindfully and fully aware he feels happiness within, and enters upon and abides in the third meditative absorption of which the Noble Ones announce: 'He dwells in happiness who has equanimity and is mindful.' This is called 'unworldly happiness.'", "spans": [], "meta": {"identifier": "sn36.031.nypo.html", "title": "Niramisa Sutta", "source": "neg"}}
{"text": "\" That disciple of the noble ones , headman — thus devoid of covetousness, devoid of ill will, unbewildered, alert, mindful — keeps pervading the first direction [the east] with an awareness imbued with good will, likewise the second, likewise the third, likewise the fourth. Thus above, below, & all around, everywhere, in its entirety, he keeps pervading the all-encompassing cosmos with an awareness imbued with good will — abundant, expansive, immeasurable, without hostility, without ill will. Just as a strong conch-trumpet blower can notify the four directions without any difficulty, in the same way, when the awareness-release through good will is thus developed, thus pursued, any deed done to a limited extent no longer remains there, no longer stays there.", "spans": [], "meta": {"identifier": "sn42.008.than.html", "title": "Sankha Sutta", "source": "neg"}}
{"text": "The Blessed One said: \"Now, what is the noble purgative that always succeeds and never fails, a purgative whereby beings subject to birth are freed from birth; beings subject to aging are freed from aging; beings subject to death are freed from death; beings subject to sorrow, lamentation, pain, distress & despair are freed from sorrow, lamentation, pain, distress & despair?", "spans": [], "meta": {"identifier": "an10.108.than.html", "title": "Virecana (Tikicchaka) Sutta", "source": "neg"}}
{"text": "\"Then indeed, sire, I was not upholding the dhamma of trees when the mighty wind and rain came and toppled my abode, uprooting it entirely.\" \"If it were the case, deva, that you were to uphold the dhamma of trees, it may be that your abode might be as it was before.\" \"I will indeed, sire, uphold the dhamma of trees! May my abode be as it was before!\"", "spans": [], "meta": {"identifier": "an06.054.olen.html", "title": "Dhammika Sutta", "source": "neg"}}
{"text": "\"Now this drawback in the case of sensuality, this mass of stress visible here & now, has sensuality for its reason, sensuality for its source, sensuality for its cause, the reason being simply sensuality.", "spans": [], "meta": {"identifier": "mn.014.than.html", "title": "Cula-dukkhakkhandha Sutta", "source": "neg"}}
{"text": "\"He does not discern fabricated form, as it actually is present, as 'fabricated form.' He does not discern fabricated feeling... He does not discern fabricated perception... He does not discern fabricated fabrications... He does not discern fabricated consciousness, as it actually is present, as 'fabricated consciousness.'", "spans": [], "meta": {"identifier": "sn22.085.than.html", "title": "Yamaka Sutta", "source": "neg"}}
{"text": "\"You, venerable sir, teach the Dhamma for the abandoning of passion... aversion... delusion. Your Dhamma is well-taught. You have practiced for the abandoning of passion... aversion... delusion. You have practiced well in this world. Your passion... aversion... delusion is abandoned, its root destroyed, made like a palmyra stump, deprived of the conditions of development, not destined for future arising. You, in this world, are well-gone.", "spans": [], "meta": {"identifier": "an03.072.than.html", "title": "Ajivaka Sutta", "source": "neg"}}
{"text": "\" Suppose there were a rectangular water tank — set on level ground, bounded by dikes — brimful of water so that a crow could drink from it. If a strong man were to loosen the dikes anywhere at all, would water spill out?\"", "spans": [], "meta": {"identifier": "an05.028.than.html", "title": "Samadhanga Sutta", "source": "neg"}}
{"text": "“But those fully understanding sensual pleasure, and, in every way, the bond of being, Dispelling the bond of opinions, and detached from ignorance, Are released from all bonds: they, indeed, are the wise ones going beyond bonds.”", "spans": [], "meta": {"identifier": "an04.010.niza.html", "title": "Yoga Sutta", "source": "neg"}}
{"text": "\"What do you think, Dhanañjanin: Which is the better: one who, for the sake of his wife & children ... his slaves & workers ... his friends & companions ... his kinsmen & relatives ... his guests ... his departed ancestors ... the devatas ... the king ... refreshing & nourishing his body, would do what is unrighteous, what is discordant; or one who, for the sake of refreshing & nourishing his body, would do what is righteous, what is concordant?", "spans": [], "meta": {"identifier": "mn.097.than.html", "title": "Dhanañjani Sutta", "source": "neg"}}
{"text": "\"Friend, with the purified intellect-consciousness divorced from the five faculties the dimension of the infinitude of space can be known [as] 'infinite space.' The dimension of the infinitude of consciousness can be known [as] 'infinite consciousness.' The dimension of nothingness can be known [as] 'There is nothing.'", "spans": [], "meta": {"identifier": "mn.043.than.html", "title": "Mahavedalla Sutta", "source": "neg"}}
{"text": "\"Now, the well-instructed, disciple of the noble ones — who has regard for noble ones, is well-versed & disciplined in their Dhamma; who has regard for men of integrity, is well-versed & disciplined in their Dhamma — does not assume form to be the self, or the self as possessing form, or form as in the self, or the self as in form.", "spans": [], "meta": {"identifier": "sn22.085.than.html", "title": "Yamaka Sutta", "source": "neg"}}
{"text": "\"These are the three urgent duties of a farming householder. Now, that farming householder does not have the power or might [to say:] 'May my crops spring up today, may the grains appear tomorrow, and may they ripen the next day.' But when the time has come, the farming householder's crops spring up, the grains appear, and they ripen.", "spans": [], "meta": {"identifier": "an03.091.than.html", "title": "Accayika Sutta", "source": "neg"}}
{"text": "\"Consciousness, monks, is classified simply by the requisite condition in dependence on which it arises. Consciousness that arises in dependence on the eye & forms is classified simply as eye-consciousness. Consciousness that arises in dependence on the ear & sounds is classified simply as ear-consciousness. Consciousness that arises in dependence on the nose & aromas is classified simply as nose-consciousness. Consciousness that arises in dependence on the tongue & flavors is classified simply as tongue-consciousness. Consciousness that arises in dependence on the body & tactile sensations is classified simply as body-consciousness. Consciousness that arises in dependence on the intellect & ideas is classified simply as intellect-consciousness.", "spans": [], "meta": {"identifier": "mn.038.than.html", "title": "Mahatanhasankhaya Sutta", "source": "neg"}}
{"text": "The Blessed One said: \"The six internal media should be known. The six external media should be known. The six classes of consciousness should be known. The six classes of contact should be known. The six classes of feeling should be known. The six classes of craving should be known.", "spans": [], "meta": {"identifier": "mn.148.than.html", "title": "Chachakka Sutta", "source": "neg"}}
{"text": "The Blessed One said, \"Monks, ignorance is the leader in the attainment of unskillful qualities, followed by lack of conscience & lack of concern. In an unknowledgeable person, immersed in ignorance, wrong view arises. In one of wrong view, wrong resolve arises. In one of wrong resolve, wrong speech... In one of wrong speech, wrong action... In one of wrong action, wrong livelihood... In one of wrong livelihood, wrong effort... In one of wrong effort, wrong mindfulness... In one of wrong mindfulness, wrong concentration arises.", "spans": [], "meta": {"identifier": "sn45.001.than.html", "title": "Avijja Sutta", "source": "neg"}}
{"text": "\"Now a disciple who is ennobled [by reaching the Noble Path], who has rid himself in this way of covetousness and ill-will and is undeluded, abides with his heart imbued with loving-kindness extending over one quarter, likewise the second quarter, likewise the third quarter, likewise the fourth quarter, and so above, below, around, and everywhere, and to all as to himself; he abides with his heart abundant, exalted, measureless in loving-kindness without hostility or ill-will extending over the all-encompassing world. He abides with his heart imbued with compassion... gladness... equanimity extending over the all-encompassing world. Now he understands this state of contemplation in this way: 'There is this [state of Divine Abiding in he who has entered the Stream]. There is what has been abandoned [which is the amount of greed, hate and delusion exhausted by the stream-entry Path]. There is a superior goal [which is arahantship]. And there is an ultimate escape from this whole field of perception.'", "spans": [], "meta": {"identifier": "an03.066.nymo.html", "title": "Salha Sutta", "source": "neg"}}
{"text": "Then the thought occurred to Sela the nun: \"Now who has recited this verse — a human being or a non-human one?\" Then it occurred to her: \"This is Mara the Evil One, who has recited this verse wanting to arouse fear, horripilation, & terror in me, wanting to make me fall away from concentration.\"", "spans": [], "meta": {"identifier": "sn05.009.than.html", "title": "Sela Sutta", "source": "neg"}}
{"text": "\"Dependent on the ear & sounds there arises ear-consciousness. The meeting of the three is contact... Dependent on the nose & aromas there arises nose-consciousness. The meeting of the three is contact... Dependent on the tongue & flavors there arises tongue-consciousness. The meeting of the three is contact... Dependent on the body & tactile sensations there arises body-consciousness. The meeting of the three is contact... Dependent on the intellect & mental qualities there arises intellect-consciousness. The meeting of the three is contact. From contact as a requisite condition comes feeling. From feeling as a requisite condition comes craving. Now, from the remainderless cessation & fading away of that very craving comes the cessation of clinging/sustenance. From the cessation of clinging/sustenance comes the cessation of becoming. From the cessation of becoming comes the cessation of birth. From the cessation of birth, then aging & death, sorrow, lamentation, pain, distress, & despair all cease. Such is the cessation of this entire mass of stress & suffering. This is the ending of the world.\"", "spans": [], "meta": {"identifier": "sn12.044.than.html", "title": "Loka Sutta", "source": "neg"}}
{"text": "Then the monks, delighting in & approving of Ven. Maha Kaccayana's words, got up from their seats and went to the Blessed One. On arrival, having bowed down to him, they sat to one side. As they were sitting there, they [told him what had happened after he had gone into his dwelling, and ended by saying,] \"Then Ven. Maha Kaccayana analyzed the meaning using these words, these statements, these phrases.\"", "spans": [], "meta": {"identifier": "mn.138.than.html", "title": "Uddesa-vibhanga Sutta", "source": "neg"}}
{"text": "Like an experienced carpenter or carpenter's apprentice, striking hard at, pushing out, and getting rid of a coarse peg with a fine one, should the bhikkhu in order to get rid of the adventitious object, reflect on a different object which is connected with skill. Then the evil unskillful thoughts connected with desire, hate and delusion are eliminated; they disappear. By their elimination the mind stands firm, settles down, becomes unified and concentrated, just within (his subject of meditation).", "spans": [], "meta": {"identifier": "mn.020.soma.html", "title": "Vitakkasanthana Sutta", "source": "neg"}}
{"text": "Beings are owners of kamma, heir to kamma, born of kamma, related through kamma, and have kamma as their arbitrator. Kamma is what creates distinctions among beings in terms of coarseness & refinement...", "spans": [], "meta": {"identifier": "mn.135.than.html", "title": "Cula-kammavibhanga Sutta", "source": "neg"}}
{"text": "\"A monk endowed with these eleven factors is incapable of attaining growth, increase, & abundance in this Dhamma-Vinaya. Which eleven? There is the case where a monk is not well-versed in forms, unskilled in characteristics, doesn't pick out flies' eggs, doesn't dress wounds, doesn't fumigate, doesn't know fords, doesn't know what it is to have drunk, doesn't know the road, is not skilled in pastures, milks dry, and shows no extra respect for the elder monks with seniority, who have been ordained long, who are fathers & leaders of the Community.", "spans": [], "meta": {"identifier": "an11.018.than.html", "title": "Gopalaka Sutta", "source": "neg"}}
{"text": "\"Furthermore, when hearing a sound with the ear, there arises in a monk what is agreeable, what is disagreeable, what is agreeable & disagreeable. He discerns that 'This agreeable thing has arisen in me, this disagreeable thing... this agreeable & disagreeable thing has arisen in me. And that is compounded, gross, dependently co-arisen. But this is peaceful, this is exquisite, i.e., equanimity.' With that, the arisen agreeable thing... disagreeable thing... agreeable & disagreeable thing ceases, and equanimity takes its stance. Just as a strong man might easily snap his fingers, that is how quickly, how rapidly, how easily, no matter what it refers to, the arisen agreeable thing... disagreeable thing... agreeable & disagreeable thing ceases, and equanimity takes its stance. In the discipline of a noble one, this is called the unexcelled development of the faculties with regard to sounds cognizable by the ear.", "spans": [], "meta": {"identifier": "mn.152.than.html", "title": "Indriya-bhavana Sutta", "source": "neg"}}
{"text": ". \"When a noble disciple has thus understood aging and death, the origin of aging and death, the cessation of aging and death, and the way leading to the cessation of aging and death... he here and now makes an end of suffering. In that way too a noble disciple is one of right view... and has arrived at this true Dhamma.\"", "spans": [], "meta": {"identifier": "mn.009.ntbb.html", "title": "Sammaditthi Sutta", "source": "neg"}}
{"text": "\"In the same way, friends, it's not that I say 'I am form,' nor do I say 'I am other than form.' It's not that I say, 'I am feeling... perception... fabrications... consciousness,' nor do I say, 'I am something other than consciousness.' With regard to these five clinging-aggregates, 'I am' has not been overcome, although I don't assume that 'I am this.'", "spans": [], "meta": {"identifier": "sn22.089.than.html", "title": "Khemaka Sutta", "source": "neg"}}
{"text": "\"All of you have given up the intentional taking of life, have put down all weapons, are possessed of shame (of doing evil) and are compassionate toward all beings. For all of this day and night, in this manner, you will be known as having followed the arahants, and the Uposatha will have been observed by you. This is the first factor of the Uposatha.", "spans": [], "meta": {"identifier": "an08.041.vaka.html", "title": "Uposatha Sutta", "source": "neg"}}
{"text": "\"What do you think, great king? Suppose a man, trustworthy and reliable, were to come to you from the east and on arrival would say: 'If it please your majesty, you should know that I come from the east. There I saw a great mountain, as high as the clouds, coming this way, crushing all living beings [in its path]. Do whatever you think should be done.' Then a second man were to come to you from the west... Then a third man were to come to you from the north... Then a fourth man were to come to you from the south and on arrival would say: 'If it please your majesty, you should know that I come from the south. There I saw a great mountain, as high as the clouds, coming this way, crushing all living beings. Do whatever you think should be done.' If, great king, such a great peril should arise, such a terrible destruction of human life — the human state being so hard to obtain — what should be done?\"", "spans": [], "meta": {"identifier": "sn03.025.than.html", "title": "Pabbatopama Sutta", "source": "neg"}}
{"text": "[9] \"There are some brahmans & contemplatives who declare the foremost purity of the spirit. [4] Now, of those who proclaim the foremost purity of the spirit, these are supreme: those who, with the complete transcending of the dimension of nothingness, enter & remain in the dimension of neither perception nor non-perception and who, having directly known & realized this, teach their Dhamma. And there are beings who teach in this way. Yet even in the beings who teach in this way there is still aberration, there is change. Seeing this, the instructed disciple of the noble ones grows disenchanted with that. Being disenchanted with that, he becomes dispassionate toward what is supreme, and even more so toward what is inferior.", "spans": [], "meta": {"identifier": "an10.029.than.html", "title": "Kosala Sutta", "source": "neg"}}
{"text": "\"And what is the training in heightened discernment? There is the case where a monk discerns as it actually is that 'This is stress... This is the origination of stress... This is the cessation of stress... This is the path of practice leading to the cessation of stress.' This is called the training in heightened discernment.", "spans": [], "meta": {"identifier": "an03.088.than.html", "title": "Sikkha Sutta", "source": "neg"}}
{"text": "\"Bhikkhus! Āsavas and other destructive and burning defilements may arise in the bhikkhu who does not abide in the restraint of his faculties with proper reflection. Those āsavas and other destructive and burning defilements do not arise in the bhikkhu who abides in the restraint of his faculties with proper reflection. Bhikkhus! These are called the āsavas that are to be removed through restraint.", "spans": [], "meta": {"identifier": "mn.002.bpit.html", "title": "Sabbasava Sutta", "source": "neg"}}
{"text": "\"By & large, Kaccayana, this world is supported by (takes as its object) a polarity, that of existence & non-existence. But when one sees the origination of the world as it actually is with right discernment, 'non-existence' with reference to the world does not occur to one. When one sees the cessation of the world as it actually is with right discernment, 'existence' with reference to the world does not occur to one.", "spans": [], "meta": {"identifier": "sn12.015.than.html", "title": "Kaccayanagotta Sutta", "source": "neg"}}
{"text": "\"And how is there the yoke of views ? There is the case where a certain person does not discern, as it actually is present, the origination, the passing away, the allure, the drawbacks, & the escape from views. When he does not discern, as it actually is present, the origination, the passing away, the allure, the drawbacks, & the escape from views, then — with regard to views — he is obsessed with view-passion, view-delight, view-attraction, view-infatuation, view-thirst, view-fever, view-fascination, view-craving. This is the yoke of sensuality, the yoke of becoming, & the yoke of views.", "spans": [], "meta": {"identifier": "an04.010.than.html", "title": "Yoga Sutta", "source": "neg"}}
{"text": "\"Furthermore, the disciple of the noble ones is endowed with verified confidence in the Sangha: 'The Sangha of the Blessed One's disciples who have practiced well...who have practiced straight-forwardly...who have practiced methodically...who have practiced masterfully — in other words, the four types of noble disciples when taken as pairs, the eight when taken as individual types — they are the Sangha of the Blessed One's disciples: worthy of gifts, worthy of hospitality, worthy of offerings, worthy of respect, the incomparable field of merit for the world.' This is the third bonanza of merit, bonanza of skillfulness, nourishment of bliss.", "spans": [], "meta": {"identifier": "sn55.033.than.html", "title": "Abhisanda Sutta", "source": "neg"}}
{"text": "Dandapani (\"Stick-in-hand\") the Sakyan, out roaming & rambling for exercise, also went to the Great Wood. Plunging into the Great Wood, he went to where the Blessed One was under the bilva sapling. On arrival, he exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he stood to one side. As he was standing there, he said to the Blessed One, \"What is the contemplative's doctrine? What does he proclaim?\"", "spans": [], "meta": {"identifier": "mn.018.than.html", "title": "Madhupindika Sutta", "source": "neg"}}
{"text": "\"There is the case where a certain person, abandoning false speech, abstains from false speech. When he has been called to a town meeting, a group meeting, a gathering of his relatives, his guild, or of the royalty, if he is asked as a witness, 'Come & tell, good man, what you know': If he doesn't know, he says, 'I don't know.' If he does know, he says, 'I know.' If he hasn't seen, he says, 'I haven't seen.' If he has seen, he says, 'I have seen.' Thus he doesn't consciously tell a lie for his own sake, for the sake of another, or for the sake of any reward. Abandoning false speech, he abstains from false speech. He speaks the truth, holds to the truth, is firm, reliable, no deceiver of the world.", "spans": [], "meta": {"identifier": "mn.041.than.html", "title": "Saleyyaka Sutta", "source": "neg"}}
{"text": "\"If he wants, he hears — by means of the divine ear-element, purified and surpassing the human — both kinds of sounds: divine and human, whether near or far. He can witness this for himself whenever there is an opening.", "spans": [], "meta": {"identifier": "an03.100.01-10.than.html", "title": "Pansadhovaka Sutta", "source": "neg"}}
{"text": ". \"It may be that, with the entire transcending of perceptions of corporeality, [13] with the disappearance of perceptions of sense-response,' [14] with non-attention to perceptions of variety, [15] thinking: 'Space is infinite,' some monk enters upon and abides in the sphere of infinite space; and he then might think: 'I am abiding in effacement.' But in the Noble One's discipline it is not these [attainments] that are called 'effacement'; in the Noble One's discipline they are called 'peaceful abidings.'", "spans": [], "meta": {"identifier": "mn.008.nypo.html", "title": "Sallekha Sutta", "source": "neg"}}
{"text": "\"There is the case where a royal frontier fortress has a foundation post — deeply rooted, well embedded, immovable, & unshakable. With this first requisite of a fortress it is well provided for the protection of those within and to ward off those without.", "spans": [], "meta": {"identifier": "an07.063.than.html", "title": "Nagara Sutta", "source": "neg"}}
{"text": "\"Now this drawback in the case of sensuality, this mass of stress visible here & now, has sensuality for its reason, sensuality for its source, sensuality for its cause, the reason being simply sensuality.", "spans": [], "meta": {"identifier": "mn.013.than.html", "title": "Maha-dukkhakkhandha Sutta", "source": "neg"}}
{"text": "\"Now, a trifling evil deed done by what sort of individual takes him to hell? There is the case where a certain individual is undeveloped in [contemplating] the body, undeveloped in virtue, undeveloped in mind, undeveloped in discernment: restricted, small-hearted, dwelling with suffering. A trifling evil deed done by this sort of individual takes him to hell.", "spans": [], "meta": {"identifier": "an03.099.than.html", "title": "Lonaphala Sutta", "source": "neg"}}
{"text": "\"And what is the bliss of having? There is the case where the son of a good family has wealth earned through his efforts & enterprise, amassed through the strength of his arm, and piled up through the sweat of his brow, righteous wealth righteously gained. When he thinks, 'I have wealth earned through my efforts & enterprise, amassed through the strength of my arm, and piled up through the sweat of my brow, righteous wealth righteously gained,' he experiences bliss, he experiences joy. This is called the bliss of having.", "spans": [], "meta": {"identifier": "an04.062.than.html", "title": "Anana Sutta", "source": "neg"}}
{"text": "\"Thus, monk, any form whatsoever that is past, future, or present; internal or external; blatant or subtle; common or sublime; far or near: every form is to be seen as it actually is with right discernment as: 'This is not mine. This is not my self. This is not what I am.'", "spans": [], "meta": {"identifier": "sn22.097.than.html", "title": "Nakhasikha Sutta", "source": "neg"}}
{"text": "\"So after some time he abandons his mass of wealth, large or small; leaves his circle of relatives, large or small; shaves off his hair and beard, puts on the ochre robes, and goes forth from the household life into homelessness.", "spans": [], "meta": {"identifier": "mn.038.than.html", "title": "Mahatanhasankhaya Sutta", "source": "neg"}}
{"text": "[ 3 ] \"Furthermore, when going forward & returning, he makes himself fully alert; when looking toward & looking away... when bending & extending his limbs... when carrying his outer cloak, his upper robe & his bowl... when eating, drinking, chewing, & savoring... when urinating & defecating... when walking, standing, sitting, falling asleep, waking up, talking, & remaining silent, he makes himself fully alert.", "spans": [], "meta": {"identifier": "mn.010.than.html", "title": "Satipatthana Sutta", "source": "neg"}}
{"text": "From the origination of birth comes the origination of aging & death. From the cessation of birth comes the cessation of aging & death. And the way of practice leading to the cessation of aging & death is just this very noble eightfold path: right view, right resolve, right speech, right action, right livelihood, right effort, right mindfulness, right concentration.", "spans": [], "meta": {"identifier": "mn.009.than.html", "title": "Sammaditthi Sutta", "source": "neg"}}
{"text": "The Blessed One said, \"Monks, once the devas & asuras were arrayed for battle. Then Sakka , the chief of the devas, addressed the devas of the Thirty-three: 'If, dear sirs, when the devas have gone into battle, there should arise fear, terror, or horripilation, then on that occasion you should catch sight of the top of my standard. For when you have caught sight of the top of my standard, whatever fear, terror, or horripilation there is will be abandoned.", "spans": [], "meta": {"identifier": "sn11.003.than.html", "title": "Dhajagga Sutta", "source": "neg"}}
{"text": "Then the most senior monk said to Ven. Isidatta: \"It was excellent, friend Isidatta, the way that question inspired you to answer. It didn't inspire an answer in me at all. Whenever a similar question comes up again, may it inspire you to answer as you did just now.\"", "spans": [], "meta": {"identifier": "sn41.003.than.html", "title": "Isidatta Sutta", "source": "neg"}}
{"text": "\"I tell you, great king: the difference among them would lie in the diversity of their exertion. Suppose that there were two tamable elephants, tamable horses, or tamable oxen that were well-tamed & well-trained; and two tamable elephants, tamable horses, or tamable oxen that were untamed & untrained. What do you think: would the two tamable elephants, tamable horses, or tamable oxen that were well-tamed & well-trained acquire the habits of the tamed and reach the status of the tamed?\"", "spans": [], "meta": {"identifier": "mn.090.than.html", "title": "Kannakatthala Sutta", "source": "neg"}}
{"text": "\"If, when an asceticism is pursued, unskillful qualities grow and skillful qualities wane, then I tell you that that sort of asceticism is not to be pursued. But if, when an asceticism is pursued, unskillful qualities wane and skillful qualities grow, then I tell you that that sort of asceticism is to be pursued.", "spans": [], "meta": {"identifier": "an10.094.than.html", "title": "Vajjiya Sutta", "source": "neg"}}
{"text": "\"In the Dhamma thus well-proclaimed by me — clear, open, evident, stripped of rags — those monks who have a [sufficient] measure of conviction in me, a [sufficient] measure of love for me, are all headed for heaven. This is how the Dhamma well-proclaimed by me is clear, open, evident, stripped of rags.\"", "spans": [], "meta": {"identifier": "mn.022.than.html", "title": "Alagaddupama Sutta", "source": "neg"}}
{"text": "\"And did you ever say to me, 'Lord, I will live the holy life under the Blessed One and [in return] he will declare to me that 'The cosmos is eternal,' or 'The cosmos is not eternal,' or 'The cosmos is finite,' or 'The cosmos is infinite,' or 'The soul & the body are the same,' or 'The soul is one thing and the body another,' or 'After death a Tathagata exists,' or 'After death a Tathagata does not exist,' or 'After death a Tathagata both exists & does not exist,' or 'After death a Tathagata neither exists nor does not exist'?\"", "spans": [], "meta": {"identifier": "mn.063.than.html", "title": "Cula-Malunkyovada Sutta", "source": "neg"}}
{"text": "\"And what, monks, are the qualities that make one a contemplative, that make one a brahman? 'We will be endowed with conscience & concern (for the consequences of wrong-doing)': That's how you should train yourselves. Now the thought may occur to you, 'We are endowed with conscience & concern. That much is enough, that much means we're done, so that the goal of our contemplative state has been reached. There's nothing further to be done,' and you may rest content with just that. So I tell you, monks. I exhort you, monks. Don't let those of you who seek the contemplative state fall away from the goal of the contemplative state when there is more to be done.", "spans": [], "meta": {"identifier": "mn.039.than.html", "title": "Maha-Assapura Sutta", "source": "neg"}}
{"text": "Then the Blessed One willed a feat of psychic power such that Angulimala, though running with all his might, could not catch up with the Blessed One walking at normal pace. Then the thought occurred to Angulimala: \"Isn't it amazing! Isn't it astounding! In the past I've chased & seized even a swift-running elephant, a swift-running horse, a swift-running chariot, a swift-running deer. But now, even though I'm running with all my might, I can't catch up with this contemplative walking at normal pace.\" So he stopped and called out to the Blessed One, \"Stop, contemplative! Stop!\"", "spans": [], "meta": {"identifier": "mn.086.than.html", "title": "Angulimala Sutta", "source": "neg"}}
{"text": "\"In every case where a family cannot hold onto its great wealth for long, it is for one or another of these four reasons. Which four? They don't look for things that are lost. They don't repair things that have gotten old. They are immoderate in consuming food and drink. They place a woman or man of no virtue or principles in the position of authority. In every case where a family cannot hold onto its great wealth for long, it is for one or another of these four reasons.", "spans": [], "meta": {"identifier": "an04.255.than.html", "title": "Kula Sutta", "source": "neg"}}
{"text": "\"Then Mara, the Evil One, taking possession of an attendant of the Brahma assembly, said to me, 'Monk! Monk! Don't attack him! Don't attack him! For this Brahma, monk, is the Great Brahma, the Conqueror, the Unconquered, the All-Seeing, All-Powerful, the Sovereign Lord, the Maker, Creator, Chief, Appointer and Ruler, Father of All That Have Been and Shall Be. There were, monk, before your time, brahmans & contemplatives in the world", "spans": [], "meta": {"identifier": "mn.049.than.html", "title": "Brahma-nimantanika Sutta", "source": "neg"}}
{"text": "\"The coming together, the meeting, the convergence of these three phenomena is intellect-contact. Whatever is the cause, the requisite condition, for the arising of intellect-contact, that is inconstant, changeable, of a nature to become otherwise. Having arisen in dependence on an inconstant factor, how could intellect-contact be constant?", "spans": [], "meta": {"identifier": "sn35.093.than.html", "title": "Dvaya Sutta", "source": "neg"}}
{"text": "Then the thought occurred to Soma the nun: \"Now who has recited this verse — a human being or a non-human one?\" Then it occurred to her: \"This is Mara the Evil One, who has recited this verse wanting to arouse fear, horripilation, & terror in me, wanting to make me fall away from concentration.\"", "spans": [], "meta": {"identifier": "sn05.002.than.html", "title": "Soma Sutta", "source": "neg"}}
{"text": "\"And what is the liquid property? The liquid property may be either internal or external. What is the internal liquid property? Anything internal, belonging to oneself, that's liquid, watery, & sustained: bile, phlegm, pus, blood, sweat, fat, tears, oil, saliva, mucus, oil-of-the-joints, urine, or anything else internal, within oneself, that's liquid, watery, & sustained: This is called the internal liquid property. Now both the internal liquid property & the external liquid property are simply liquid property. And that should be seen as it actually is present with right discernment: 'This is not mine, this is not me, this is not my self.' When one sees it thus as it actually is present with right discernment, one becomes disenchanted with the liquid property and makes the liquid property fade from the mind.", "spans": [], "meta": {"identifier": "mn.140.than.html", "title": "Dhatu-vibhanga Sutta", "source": "neg"}}
{"text": "\"No, venerable sir. Why is that? Because the root of that great, standing tree — possessed of heartwood — is inconstant & subject to change, its trunk is inconstant & subject to change, its branches & foliage are inconstant & subject to change, so how much more should its shadow be inconstant & subject to change.\"", "spans": [], "meta": {"identifier": "mn.146.than.html", "title": "Nandakovada Sutta", "source": "neg"}}
{"text": "\"There is the case where a monk has developed insight preceded by tranquillity. As he develops insight preceded by tranquillity, the path is born. He follows that path, develops it, pursues it. As he follows the path, developing it & pursuing it — his fetters are abandoned, his obsessions destroyed.", "spans": [], "meta": {"identifier": "an04.170.than.html", "title": "Yuganaddha Sutta", "source": "neg"}}
{"text": "I have heard that on one occasion the Blessed One was staying near Campa , on the shore of Gaggara Lake . Then Vajjiya Mahita the householder left Campa in the middle of the day to see the Blessed One, but the thought then occurred to him, \"Now is not the right time to see the Blessed One, for he is in seclusion. And it is not the right time to see the monks who develop the mind, for they are in seclusion. What if I were to visit the park of the wanderers of other persuasions?\" So he headed to the park of the wanderers of other persuasions.", "spans": [], "meta": {"identifier": "an10.094.than.html", "title": "Vajjiya Sutta", "source": "neg"}}
{"text": "\"The thought occurs to them: 'Now what future danger concerning sensual pleasures do those [other] brahmans & contemplatives foresee that they have spoken of the relinquishment of sensual pleasures and describe the full comprehension of sensual pleasures? It's pleasant, the touch of this woman wanderer's soft, tender, downy arm.'", "spans": [], "meta": {"identifier": "mn.045.than.html", "title": "Cula-dhammasamadana Sutta", "source": "neg"}}
{"text": "\"Now, householder, if the thought should occur to you, 'Perhaps it was someone else who at that time was Velāma the brahman, who gave that gift, that great gift,' that's not how it should be seen. I was Velāma the brahman at that time. I gave that gift, that great gift. But in that gift there was no one worthy of offerings; no one purified that gift.", "spans": [], "meta": {"identifier": "an09.020.than.html", "title": "Velāma Sutta", "source": "neg"}}
{"text": "\"'Fermentations should be known. The cause by which fermentations come into play... The diversity in fermentations... The result of fermentations... The cessation of fermentations... The path of practice for the cessation of fermentations should be known.' Thus it has been said, and in reference to this was it said.", "spans": [], "meta": {"identifier": "an06.063.than.html", "title": "Nibbedhika Sutta", "source": "neg"}}
{"text": "That is what Ven. Khemaka said. Gratified, the elder monks delighted in his words. And while this explanation was being given, the minds of sixty-some monks, through no clinging, were fully released from fermentations — as was Ven. Khemaka's.", "spans": [], "meta": {"identifier": "sn22.089.than.html", "title": "Khemaka Sutta", "source": "neg"}}
{"text": "\"In the same way, an uninstructed, run-of-the-mill person — who has no regard for noble ones, is not well-versed or disciplined in their Dhamma; who has no regard for men of integrity, is not well-versed or disciplined in their Dhamma — assumes form (the body) to be the self, or the self as possessing form, or form as in the self, or the self as in form.", "spans": [], "meta": {"identifier": "sn22.085.than.html", "title": "Yamaka Sutta", "source": "neg"}}
{"text": ". (5) \"By encompassing mind with mind I understand a certain person thus: 'This person so behaves, so conducts himself, has taken such a path that on the dissolution of the body, after death, he will reappear in a happy destination, in the heavenly world.' And then later on... I see that... he has reappeared in a happy destination, in the heavenly world and is experiencing extremely pleasant feelings. Suppose there were a mansion, and it had an upper chamber plastered within and without, shut off, secured by bars, with shuttered windows, and in it there was a couch spread with rugs, blankets and sheets, with a deerskin coverlet, with a canopy as well as crimson pillows for both (head and feet); and then a man scorched and exhausted by hot weather, weary, parched and thirsty, came by a path going in one way only and directed to that same mansion. Then a man with good sight on seeing him would say: 'This person so behaves... that he will come to this same mansion'; and later on he sees that he is sitting or lying in that upper chamber in that mansion experiencing extremely pleasant feelings. So too, by encompassing mind with mind... extremely pleasant feelings.", "spans": [], "meta": {"identifier": "mn.012.ntbb.html", "title": "Maha-sihanada Sutta", "source": "neg"}}
{"text": ". \"Though certain recluses and brahmans claim to propound the full understanding of all kinds of clinging... they describe the full understanding of clinging to sensual pleasures, clinging to views, and clinging to rules and observances without describing the full understanding of clinging to a doctrine of self. They do not understand one instance... therefore they describe only the full understanding of clinging to sensual pleasures, clinging to views, and clinging to rules and observances without describing the full understanding of clinging to a doctrine of self. [8]", "spans": [], "meta": {"identifier": "mn.011.ntbb.html", "title": "Cula-sihanada Sutta", "source": "neg"}}
{"text": "So the brahman householders of Sala went to the Blessed One. On arrival, some of them bowed down to the Blessed One and sat to one side. Some of them exchanged courteous greetings with him and, after an exchange of friendly greetings & courtesies, sat to one side. Some of them sat to one side having saluted him with their hands palm-to-palm over their hearts. Some of them sat to one side having announced their name & clan. Some of them sat to one side in silence.", "spans": [], "meta": {"identifier": "mn.060.than.html", "title": "Apannaka  Sutta", "source": "neg"}}
{"text": "\"Take the case of another man. He is endowed with unwavering devotion to the Buddha, the Dhamma, the Sangha. But he is not joyous in wisdom and has not gained release. Yet by destroying three fetters he is a Stream-Winner, not subject to rebirth in states of woe, assured of enlightenment. That man is entirely freed... from states of woe.", "spans": [], "meta": {"identifier": "sn55.024.wlsh.html", "title": "Sarakaani Sutta", "source": "neg"}}
{"text": "\"And what more is to be done? 'Our verbal conduct... our mental conduct will be pure, clear & open, unbroken & restrained. We will not exalt ourselves nor disparage others on account of that pure verbal... mental conduct': That's how you should train yourselves. Now the thought may occur to you, 'We are endowed with conscience & concern. Our bodily conduct is pure. Our verbal conduct... our mental conduct is pure. That much is enough, that much means we're done, so that the goal of our contemplative state has been reached. There's nothing further to be done,' and you may rest content with just that. So I tell you, monks. I exhort you, monks. Don't let those of you who seek the contemplative state fall away from the goal of the contemplative state when there is more to be done.", "spans": [], "meta": {"identifier": "mn.039.than.html", "title": "Maha-Assapura Sutta", "source": "neg"}}
{"text": "\" [5] He trains himself, 'I will breathe in sensitive to rapture.' He trains himself, 'I will breathe out sensitive to rapture.' [6] He trains himself, 'I will breathe in sensitive to pleasure.' He trains himself, 'I will breathe out sensitive to pleasure.' [7] He trains himself, 'I will breathe in sensitive to mental fabrication.' He trains himself, 'I will breathe out sensitive to mental fabrication.' [8] He trains himself, 'I will breathe in calming mental fabrication.' He trains himself, 'I will breathe out calming mental fabrication.'", "spans": [], "meta": {"identifier": "sn54.013.than.html", "title": "Ananda Sutta", "source": "neg"}}
{"text": "\"And why do you call it 'consciousness'? Because it cognizes, thus it is called consciousness. What does it cognize? It cognizes what is sour, bitter, pungent, sweet, alkaline, non-alkaline, salty, & unsalty. Because it cognizes, it is called consciousness.", "spans": [], "meta": {"identifier": "sn22.079.than.html", "title": "Khajjaniya Sutta", "source": "neg"}}
{"text": "\"In the same way, monks, if some monk is overwhelmed with gains, favors and fame so that his head is turned, so, having risen early and taken his robe and bowl and gone for alms to the village or market town, he eats his fill, gets invited again for next day, and has a full bowl. Then he goes to the monks' park, [2] and boasts in the midst of the assembled monks: 'I have had a good meal, and I am invited again for tomorrow. My bowl is full. I have got a robe, alms, lodgings and medical requisites. But these other monks have little merit and little influence, they do not get [ all these ] requisites.' Thus this bhikkhu, who is so overwhelmed with gains, favors and fame that his head is turned, despises other well-behaved bhikkhus. But this will bring harm and sorrow to that wretched man for many a long day. That shows you, monks, how disastrous gains, favors and fame are, what a bitter, harsh impediment to the attainment of the unsurpassed freedom from bondage. Therefore monks, you should train yourselves thus: 'Whatever gains, favors and fame may come our way we will reject, lest it turn our heads.' So, monks, you should train yourselves.\"", "spans": [], "meta": {"identifier": "sn17.005.wlsh.html", "title": "Piḷhika Sutta", "source": "neg"}}
{"text": "\"Then those six animals, of different ranges, of different habitats, would each pull toward its own range & habitat. The snake would pull, thinking, 'I'll go into the anthill.' The crocodile would pull, thinking, 'I'll go into the water.' The bird would pull, thinking, 'I'll fly up into the air.' The dog would pull, thinking, 'I'll go into the village.' The hyena would pull, thinking, 'I'll go into the charnel ground.' The monkey would pull, thinking, 'I'll go into the forest.' And when these six animals became internally exhausted, they would submit, they would surrender, they would come under the sway of whichever among them was the strongest. In the same way, when a monk whose mindfulness immersed in the body is undeveloped & unpursued, the eye pulls toward pleasing forms, while unpleasing forms are repellent. The ear pulls toward pleasing sounds... The nose pulls toward pleasing aromas... The tongue pulls toward pleasing flavors... The body pulls toward pleasing tactile sensations... The intellect pulls toward pleasing ideas, while unpleasing ideas are repellent. This, monks, is lack of restraint.", "spans": [], "meta": {"identifier": "sn35.206.than.html", "title": "Chappana Sutta", "source": "neg"}}
{"text": "\"Then again, the monk has admirable friends, admirable companions, admirable comrades. And the fact that he has admirable friends, admirable companions, admirable comrades is a quality creating a protector.", "spans": [], "meta": {"identifier": "an10.017.than.html", "title": "Natha Sutta", "source": "neg"}}
{"text": "\"Then is the cosmos finite?\"... \"Is the cosmos infinite?\"... \"Is the body the same as the soul?\"... \"Is the body one thing, and the soul another?\"... \"Does the Tathagata exist after death?\"... \"Does the Tathagata not exist after death?\"... \"Does the Tathagata both exist and not exist after death?\"... \"Does the Tathagata neither exist nor not exist after death?\"", "spans": [], "meta": {"identifier": "sn44.007.than.html", "title": "Moggallana Sutta", "source": "neg"}}
{"text": "\"If a monk abandons passion for the property of consciousness, then owing to the abandonment of passion, the support is cut off, and there is no landing of consciousness. Consciousness, thus not having landed, not increasing, not concocting, is released. Owing to its release, it is steady. Owing to its steadiness, it is contented. Owing to its contentment, it is not agitated. Not agitated, he (the monk) is totally unbound right within. He discerns that 'Birth is ended, the holy life fulfilled, the task done. There is nothing further for this world.'\"", "spans": [], "meta": {"identifier": "sn22.053.than.html", "title": "Upaya Sutta", "source": "neg"}}
{"text": "\"No, my friend. The eye is not the fetter of forms, nor are forms the fetter of the eye. Whatever desire & passion arises in dependence on the two of them: That is the fetter there. The ear is not the fetter of sounds... The nose is not the fetter of aromas... The tongue is not the fetter of flavors... The body is not the fetter of tactile sensations... The intellect is not the fetter of ideas, nor are ideas the fetter of the intellect. Whatever desire & passion arises in dependence on the two of them: That is the fetter there.", "spans": [], "meta": {"identifier": "sn35.191.than.html", "title": "Kotthita Sutta", "source": "neg"}}
{"text": "\"He develops the base of power endowed with concentration founded on discrimination & the fabrications of exertion, thinking, 'This discrimination of mine will be neither overly sluggish nor overly active, neither inwardly restricted nor outwardly scattered.' He keeps perceiving what is in front & behind so that what is in front is the same as what is behind, what is behind is the same as what is in front. What is below is the same as what is above, what is above is the same as what is below. [He dwells] by night as by day, and by day as by night. By means of an awareness thus open & unhampered, he develops a brightened mind.", "spans": [], "meta": {"identifier": "sn51.020.than.html", "title": "Iddhipada-vibhanga Sutta", "source": "neg"}}
{"text": "\"Now if someone should say, 'Where does the perception of the dimension of neither perception nor non-perception cease? And where do those who repeatedly are stopping the perception of the dimension of neither perception nor non-perception dwell? I don't know that; I don't see that,' he should be told, 'There is the case, friend, where a monk, with the complete transcending of the dimension of neither perception nor non-perception, enters & remains in the cessation of perception & feeling. [2] That is where the perception of the dimension of neither perception nor non-perception ceases, and where those who repeatedly are stopping the perception of the dimension of neither perception nor non-perception dwell.' Surely, a person without guile or deceit, (saying,) 'Very good,' would delight in & approve of that statement. Delighting in & approving of that statement, paying homage & raising his hands palm-to-palm over his heart, he would honor it.", "spans": [], "meta": {"identifier": "an09.033.than.html", "title": "Vihāra Sutta", "source": "neg"}}
{"text": "\"So, monks, I have opened up the safe, restful path, closed off the false path, removed the male decoy, destroyed the female. Whatever a teacher should do — seeking the welfare of his disciples, out of sympathy for them — that have I done for you. Over there are the roots of trees; over there, empty dwellings. Practice jhana, monks. Don't be heedless. Don't later fall into regret. This is our message to you.\"", "spans": [], "meta": {"identifier": "mn.019.than.html", "title": "Dvedhavitakka Sutta", "source": "neg"}}
{"text": "\"His heart, thus knowing, thus seeing, is released from the fermentation of sensuality, the fermentation of becoming, the fermentation of ignorance. With release, there is the knowledge, 'Released.' He discerns that 'Birth is ended, the holy life fulfilled, the task done. There is nothing further for this world.'", "spans": [], "meta": {"identifier": "mn.027.than.html", "title": "Cula-hatthipadopama Sutta", "source": "neg"}}
{"text": "\" Magnificent , Master Gotama! Magnificent! Just as if he were to place upright what was overturned, to reveal what was hidden, to show the way to one who was lost, or to carry a lamp into the dark so that those with eyes could see forms, in the same way has Master Gotama — through many lines of reasoning — made the Dhamma clear. I go to Master Gotama for refuge, to the Dhamma, & to the community of monks. May Master Gotama remember me as a lay follower who has gone for refuge from this day forward, for life.\"", "spans": [], "meta": {"identifier": "an03.060.than.html", "title": "Sangarava Sutta", "source": "neg"}}
{"text": "\"And what is the development of the frames of reference? There is the case where a monk remains focused on the phenomenon of origination with regard to the body, remains focused on the phenomenon of passing away with regard to the body, remains focused on the phenomenon of origination & passing away with regard to the body — ardent, alert, & mindful — putting aside greed & distress with reference to the world.", "spans": [], "meta": {"identifier": "sn47.040.than.html", "title": "Satipatthana-vibhanga Sutta", "source": "neg"}}
{"text": "On one occasion the Blessed One was staying among the Mallans in a Mallan town named Uruvelakappa . Then Gandhabhaka the headman went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the Blessed One: \"It would be good, lord, if the Blessed One would teach me the origination & ending of stress.\"", "spans": [], "meta": {"identifier": "sn42.011.than.html", "title": "Gandhabhaka (Bhadraka) Sutta", "source": "neg"}}
{"text": "As she was standing there, one of the devatas exclaimed in the Blessed One's presence: \"What a naga is Gotama the contemplative! And like a naga, when bodily feelings have arisen — painful, fierce, sharp, wracking, repellent, disagreeable — he endures them mindful, alert, & unperturbed!\"", "spans": [], "meta": {"identifier": "sn01.038.than.html", "title": "Sakalika Sutta", "source": "neg"}}
{"text": "\"And what is stress? Birth is stressful, aging is stressful, death is stressful; sorrow, lamentation, pain, distress, & despair are stressful; not getting what one wants is stressful. [2] In short, the five clinging-aggregates are stressful. This is called stress.", "spans": [], "meta": {"identifier": "mn.009.than.html", "title": "Sammaditthi Sutta", "source": "neg"}}
{"text": "\"In the same way, monks, the eye is not yours: let go of it. Your letting go of it will be for your long-term happiness & benefit... The ear... The nose... The tongue... The body... The intellect is not yours: let go of it. Your letting go of it will be for your long-term happiness & benefit... Whatever arises in dependence on intellect-contact, experienced either as pleasure, as pain, or as neither-pleasure-nor-pain, that too is not yours: let go of it. Your letting go of it will be for your long-term happiness & benefit.\"", "spans": [], "meta": {"identifier": "sn35.101.than.html", "title": "Na Tumhaka Sutta", "source": "neg"}}
{"text": "\"In the same way, Udayin, there are some worthless men who, when I tell them, 'Abandon this,' say: 'Why this petty, elementary thing? He's too much of a stickler, this contemplative.' They don't abandon it. They're rude to me and to the monks keen on training. For them that's a strong snare, a thick snare, a heavy snare, an unrotting snare, and a thick yoke.", "spans": [], "meta": {"identifier": "mn.066.than.html", "title": "Latukikopama Sutta", "source": "neg"}}
{"text": "\"Thus, monks, you should train yourselves: 'Strong will be our desire for the undertaking of heightened virtue. Strong will be our desire for the undertaking of heightened mind. Strong will be our desire for the undertaking of heightened discernment.' That's how you should train yourselves.\"", "spans": [], "meta": {"identifier": "an03.091.than.html", "title": "Accayika Sutta", "source": "neg"}}
{"text": "\"That any brahmans & contemplatives — teachers of kamma who declare that pleasure & pain are self-made — would be sensitive to pleasure & pain otherwise than through contact: that isn't possible. That any brahmans & contemplatives — teachers of kamma who declare that pleasure & pain are other-made... self-made & other-made... neither self-made nor other-made, but arise spontaneously — would be sensitive to pleasure & pain otherwise than through contact: that isn't possible.", "spans": [], "meta": {"identifier": "sn12.025.than.html", "title": "Bhumija Sutta", "source": "neg"}}
{"text": "\"As you say, your majesty,\" the gamekeeper responded to the king. As he was cleaning up Migacira he saw Ven. Ratthapala sitting in the shade of a tree for the day's abiding. On seeing him, he went to the king and said, \"Migacira has been cleaned up for you, your majesty. And the clansman Ratthapala — the son of the leading clan in this Thullakotthita, of whom you have often spoken highly — is there, sitting in the shade of a tree for the day's abiding.\"", "spans": [], "meta": {"identifier": "mn.082.than.html", "title": "Ratthapala Sutta", "source": "neg"}}
{"text": "\"And when, Aggivessana, the ariyan disciple is intent on vigilance, then the Tathagata disciplines him further, saying: 'Come you, monk, be possessed of mindfulness and clear consciousness, acting with clear consciousness whether you are approaching or departing, acting with clear consciousness whether you are looking ahead or looking round, acting with clear consciousness whether you are bending in or stretching out [the arms], acting with clear consciousness whether you are carrying the outer cloak, the bowl or robe, acting with clear consciousness whether you are eating, drinking, munching, savoring, acting with clear consciousness whether you are obeying the calls of nature, acting with clear consciousness whether you are walking, standing, sitting, asleep, awake, talking or being silent.'", "spans": [], "meta": {"identifier": "mn.125.horn.html", "title": "Dantabhumi Sutta", "source": "neg"}}
{"text": "Thus he lives contemplating mental objects in mental objects internally, or he lives contemplating mental objects in mental objects externally, or he lives contemplating mental objects in mental objects internally and externally. He lives contemplating origination factors in mental objects, or he lives contemplating dissolution factors in mental objects, or he lives contemplating origination-and-dissolution factors in mental objects. [21] Or his mindfulness is established with the thought, \"Mental objects exist,\" to the extent necessary just for knowledge and mindfulness, and he lives detached, and clings to nothing in the world. Thus also, monks, a monk lives contemplating mental objects in the mental objects of the five hindrances.", "spans": [], "meta": {"identifier": "mn.010.nysa.html", "title": "Satipatthana Sutta", "source": "neg"}}
{"text": "\"Then again there is the case where a certain excellent thoroughbred person does not hear, 'In that town or village over there a man or woman is in pain or has died.' And he himself does not see a man or woman in pain or dead. But he sees one of his own blood relatives in pain or dead. He is stirred & agitated by that. Stirred, he becomes appropriately resolute. Resolute, he both realizes with his body the highest truth and, having penetrated it with discernment, sees. This type of excellent thoroughbred person, I tell you, is like the excellent thoroughbred horse who, when its hide is pricked with the goad-stick, is stirred & agitated. Some excellent thoroughbred people are like this. And this is the third type of excellent thoroughbred person to be found existing in the world.", "spans": [], "meta": {"identifier": "an04.113.than.html", "title": "Patoda Sutta", "source": "neg"}}
{"text": "\"Monks, there are these four ways of taking on practices. Which four? There is the taking on of a practice that is pleasant in the present but yields pain in the future. There is the taking on of a practice that is painful in the present and yields pain in the future. There is the taking on of a practice that is painful in the present but yields pleasure in the future. There is the taking on of a practice that is pleasant in the present and yields pleasure in the future.", "spans": [], "meta": {"identifier": "mn.045.than.html", "title": "Cula-dhammasamadana Sutta", "source": "neg"}}
{"text": "Thereupon Rahu, Lord of Asuras, released Candima, the deity, and immediately came to the presence of Vepacitta, Lord of Asuras, and stood beside him trembling with fear and with hair standing on end. Then Vepacitta addressed Rahu in this stanza.", "spans": [], "meta": {"identifier": "sn02.009.piya.html", "title": "Candima Sutta", "source": "neg"}}
{"text": "\"I, too, monks, before my awakening, when I was an unawakened bodhisatta, frequently remained with this abiding. When I frequently remained with this abiding, neither my body was fatigued nor were my eyes, and my mind, through lack of clinging/sustenance, was released from fermentations.", "spans": [], "meta": {"identifier": "sn54.008.than.html", "title": "Dipa Sutta", "source": "neg"}}
{"text": "\" Just as a yellow leaf released from its stem is incapable of ever again becoming green, in the same way, when a person is intent on the imperturbable, he is released from the fetter of the baits of the world. This is how it can be known that 'This person, disjoined from the fetter of the baits of the world, is intent on the imperturbable.'", "spans": [], "meta": {"identifier": "mn.105.than.html", "title": "Sunakkhatta Sutta", "source": "neg"}}
{"text": "\"By depending & relying on equanimity coming from singleness, dependent on singleness, abandon & transcend equanimity coming from multiplicity, dependent on multiplicity. Such is its abandoning, such its transcending.", "spans": [], "meta": {"identifier": "mn.137.than.html", "title": "Salayatana-vibhanga Sutta", "source": "neg"}}
