 {"text": "I heard thus. Once the Blessed One, while wandering in the Kosala country with a large community of bhikkhus, entered a town of the Kalama people called Kesaputta . The Kalamas who were inhabitants of Kesaputta: \"Reverend Gotama, the monk, the son of the Sakyans, has, while wandering in the Kosala country, entered Kesaputta. The good repute of the Reverend Gotama has been spread in this way: Indeed, the Blessed One is thus consummate, fully enlightened, endowed with knowledge and practice, sublime, knower of the worlds, peerless, guide of tamable men, teacher of divine and human beings, which he by himself has through direct knowledge understood clearly. He set forth the Dhamma, good in the beginning, good in the middle, good in the end, possessed of meaning and the letter, and complete in everything; and he proclaims the holy life that is perfectly pure. Seeing such consummate ones is good indeed.\"", "entities": [ ["PERSON", "Blessed One"], ["GPE", "Kosala"], ["NORP", "bhikkhus"], ["NORP", "Kalama people"], ["GPE", "Kesaputta"], ["NORP", "Kalamas"], ["GPE", "Kesaputta"], ["PERSON", "Reverend Gotama"], ["NORP", "Sakyans"], ["GPE", "Kosala"], ["GPE", "Kesaputta"], ["PERSON", "Reverend Gotama"], ["PERSON", "Blessed One"], [  "DOCTRINE",  "Dhamma" ] ] }
 { "text": "Then Ugga , the king's chief minister, approached the Blessed One and, on arrival, having bowed down, sat to one side. As he was sitting there, he said to the Blessed One: \"It's amazing, lord, & awesome, how prosperous Migara Rohaneyya is, how great his treasures, how great his resources!\"", "entities": [ [ "PERSON", "Ugga" ], [ "PERSON", "Blessed One" ], [ "PERSON", "Blessed One" ], [ "PERSON", "Migara Rohaneyya" ] ] }
{ "text": "On one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery. And on that occasion the lay woman Velukandaki, Nanda's mother, had established a donation endowed with six factors for the community of monks headed by Sariputta & Moggallana.", "entities": [ [ "PERSON","Blessed One" ], [ "GPE", "Savatthi" ], [ "LOC", "Jeta's Grove" ], [ "LOC", "Anathapindika's monastery" ], [ "PERSON", "Velukandaki"], [ "PERSON", "Nanda" ], [ "NORP", "monks" ], [ "PERSON", "Sariputta" ], [ "PERSON", "Moggallana" ] ] }
{"text": "The Blessed One saw with his divine eye, surpassing the human, that the laywoman Velukandaki, Nanda's mother, had established a donation endowed with six factors for the community of monks headed by Sariputta & Moggallana. On seeing this, he addressed the monks: \"Monks, the lay woman Velukandaki, Nanda's mother, has established a donation endowed with six factors for the community of monks headed by Sariputta & Moggallana.", "entities": [ [ "PERSON", "Blessed One" ], [ "PERSON", "Velukandaki"], [ "PERSON", "Nanda" ], [ "NORP", "monks" ], [ "PERSON", "Sariputta" ], [ "PERSON", "Moggallana" ], [ "PERSON", "Velukandaki"], [ "PERSON", "Nanda" ], [ "NORP", "monks" ], [ "PERSON", "Sariputta" ], [ "PERSON", "Moggallana" ], [ "PERSON", "Sariputta" ], [ "PERSON", "Moggallana" ] ] }
{ "text": "I heard thus. Once the Blessed One, while wandering in the Kosala country with a large community of bhikkhus, entered a town of the Kalama people called Kesaputta. The Kalamas who were inhabitants of Kesaputta: \"Reverend Gotama, the monk, the son of the Sakyans, has, while wandering in the Kosala country, entered Kesaputta. The good repute of the Reverend Gotama has been spread in this way: Indeed, the Blessed One is thus consummate, fully enlightened, endowed with knowledge and practice, sublime, knower of the worlds, peerless, guide of tamable men, teacher of divine and human beings, which he by himself has through direct knowledge understood clearly. He set forth the Dhamma, good in the beginning, good in the middle, good in the end, possessed of meaning and the letter, and complete in everything; and he proclaims the holy life that is perfectly pure. Seeing such consummate ones is good indeed.\"", "entities": [ [ "PERSON", "Blessed One" ], [ "GPE", "Kosala" ], [ "NORP", "bhikkhus" ], [ "NORP", "Kalama people" ], [ "GPE", "Kesaputta" ], [ "NORP", "Kalamas" ], [ "GPE", "Kesaputta" ], [ "PERSON", "Reverend Gotama" ], [ "NORP", "Sakyans" ], [ "GPE", "Kosala" ], [ "GPE", "Kesaputta" ], [ "PERSON", "Reverend Gotama" ], [ "PERSON", "Blessed One" ] ] }
{ "text": "On one occasion the Blessed One was staying near Kapilavatthu at the Banyan Park. Then many Sakyan lay followers, it being the Uposatha day, went to the Blessed One. On arrival, having bowed down to him, they sat to one side. As they were sitting there, the Blessed One said to them, \"Sakyans, do you observe the eight-factored uposatha?\"", "entities": [ [ "PERSON", "Blessed One" ], [ "GPE", "Kapilavatthu" ] [ "LOC", "Banyan Park" ], [ "NORP", "Sakyan" ], [  "EVENT", "Uposatha" ], [ "PERSON", "Blessed One" ], [ "PERSON", "Blessed One" ], [ "NORP", "Sakyans" ] , [  "EVENT", "uposatha" ], [ "DOCTRINE",  "Dhamma" ] } 
{ "text": "I have heard that on one occasion the Blessed One was living among the Kurus. Now, the Kurus have a town named Kammasadhamma. There Ven. Ananda approached the Blessed One and, on arrival, having bowed down to the Blessed One, sat to one side. As he was sitting there he said to the Blessed One: \"It's amazing, lord, it's astounding, how deep this dependent co-arising is, and how deep its appearance, and yet to me it seems as clear as clear can be.", "entities": [ [ "PERSON", "Blessed One" ], [ "NORP", "Kurus" ], [ "NORP", "Kurus" ], [ "GPE", "Kammasadhamma" ], [ "PERSON", "Ven. Ananda" ], [ "PERSON", "Blessed One" ], [ "PERSON", "Blessed One" ], [ "PERSON", "Blessed One" ] ] }
{ "text": "I have heard that on one occasion the Blessed One was wandering on a tour of Kasi with a large community of monks. There he addressed the monks,", "entities": [ [ "PERSON", "Blessed One" ], [ "GPE", "Kasi" ], [ "NORP", "monks" ], [ "NORP", "monks" ] ] }
{ "text": "\"Endowed with these five qualities, a lay follower is an outcaste of a lay follower, a stain of a lay follower, a dregs of a lay follower. Which five? He/she does not have conviction [in the Buddha's Awakening]; is unvirtuous; is eager for protective charms & ceremonies; trusts protective charms & ceremonies, not kamma; and searches for recipients of his/her offerings outside [of the Sangha], and gives offerings there first. Endowed with these five qualities, a lay follower is an outcaste of a lay follower, a stain of a lay follower, a dregs of a lay follower.", "entities": [ [ "NORP", "lay follower" ], [ "NORP", "lay follower" ], [ "NORP", "lay follower" ], [ "NORP", "lay follower" ], [ "PERSON", "Buddha" ], [ "NORP", "Sangha" ], [ "NORP", "lay follower" ], [ "NORP", "lay follower" ], [ "NORP", "lay follower" ], [ "NORP", "lay follower" ] ] } 
{ "text": "I have heard that on one occasion Ven. Sariputta was staying near Rajagaha in the Bamboo Grove, the Squirrels' Feeding Sanctuary. There he said to the monks, \"This Unbinding is pleasant, friends. This Unbinding is pleasant.\"", "entities": [ [ "PERSON", "Ven. Sariputta" ], [ "GPE", "Rajagaha" ], [ "LOC", "Bamboo Grove" ], [ "LOC", "Squirrels' Feeding Sanctuary" ], [ "NORP", "monks" ] ] }
{ "text": "Once the Blessed One was dwelling among the Sakyas in Nigrodha Park at Kapilavatthu. There, Mahanama the Sakyan approached the Blessed One. Having approached and paid respect to the Blessed One, he sat aside. Then, seated aside, Mahanama the Sakyan said thus to the Blessed One:", "entities": [ [ "PERSON", "Blessed One" ], [ "NORP", "Sakyas" ], [ "LOC", "Nigrodha Park" ], [ "GPE", "Kapilavatthu" ], [ "PERSON", "Mahanama" ], [ "NORP", "Sakyan" ], [ "PERSON", "Blessed One" ], [ "PERSON", "Blessed One" ], [ "PERSON", "Mahanama" ], [ "NORP", "Sakyan" ], [ "PERSON", "Blessed One" ] ] } 
{ "text": "On one occasion Ven. Maha Cunda was staying among the Cetis in Sanjatiya . There he addressed the monks, \"Friend monks!\"", "entities": [ [ "PERSON", "Ven. Maha Cunda" ], [ "NORP", "Cetis" ], [ "GPE", "Sanjatiya" ], [ "NORP", "monks" ], [ "NORP", "monks" ] ] } 
{ "text": "I have heard that on one occasion the Blessed One was staying in the Kuru country. Now there is a town of the Kurus called Kammasadhamma. There the Blessed One addressed the monks: \"Monks!\"", "entities": [ [ "PERSON", "Blessed One" ], [ "NORP", "Kuru" ], [ "NORP", "Kurus" ], [ "GPE", "Kammasadhamma" ], [ "PERSON", "Blessed One" ], [ "NORP", "monks" ], [ "NORP", "Monks" ] ] } 
{ "text": "On one occasion Ven. Maha Cunda was staying among the Cetis at Sahajati. There he addressed the monks, \"Monks, my friends.\"", "entities": [ [ "PERSON", "Maha Cunda" ], [ "NORP", "Cetis" ], [ "GPE", "Sahajati" ], [ "NORP", "monks" ], [ "NORP", "Monks" ] ] }
{ "text": "I have heard that on one occasion the Blessed One was staying among the Kajjangalas in the Bamboo Grove. Then the young brahman Uttara , a student of Parasiri [1] went to the Blessed One and, on arrival, exchanged friendly greetings & courtesies. After this exchange of courteous greetings he sat to one side.", "entities": [ [ "PERSON", "Blessed One" ], [ "NORP", "Kajjangalas" ], [ "LOC", "Bamboo Grove" ], [ "PERSON", "Uttara" ], [ "PERSON", "Parasiri" ], [ "PERSON", "Blessed One" ] ] } 
{ "text": "Thus have I heard: The Bhagava was at one time residing at the market-town called Kammasadhamma in the Kuru Country. There the Bhagava addressed the bhikkhus, saying: \"O Bhikkhus,\" and they replied to him, \"Venerable Sir.\" The Bhagava said:", "entities": [ [ "PERSON", "Bhagava" ], [ "GPE", "Kammasadhamma" ], [ "LOC", "Kuru Country" ], [ "PERSON", "Bhagava" ], [ "NORP", "bhikkhus" ], [ "NORP", "Bhikkhus" ], [ "PERSON", "Venerable Sir" ], [  "PERSON", "Bhagava" ] ] }
{ "text": "I have heard that on one occasion the Blessed One was staying near Rajagaha , on Vulture Peak Mountain. And on that occasion Ven. Sona was staying near Rajagaha in the Cool Wood. Then, as Ven. Sona was meditating in seclusion [after doing walking meditation until the skin of his soles was split & bleeding], this train of thought arose in his awareness: \"Of the Blessed One's disciples who have aroused their persistence, I am one, but my mind is not released from the fermentations through lack of clinging/sustenance. Now, my family has enough wealth that it would be possible to enjoy wealth & make merit. What if I were to disavow the training, return to the lower life, enjoy wealth, & make merit?\"", "entities": [ [ "PERSON", "Blessed One" ], [ "GPE", "Rajagaha" ], [ "LOC", "Vulture Peak Mountain" ], [ "PERSON", "Ven. Sona" ], [ "GPE", "Rajagaha" ], [ "LOC", "Cool Wood" ], [ "PERSON", "Ven. Sona" ], [ "PERSON", "Blessed One" ] ] }
{ "text": ". Thus have I heard. On one occasion the Blessed One was living at Rajagaha , in the Bamboo Grove, the Squirrels' Feeding Place. Now on that occasion the venerable Samiddhi was living in a forest hut.", "entities": [ [ "PERSON", "Blessed One" ], [ "GPE", "Rajagaha" ], [ "LOC", "Bamboo Grove" ], [   "LOC", "Squirrels' Feeding Place" ], [ "PERSON", "venerable Samiddhi" ] ] }
{ "text": "I have heard that on one occasion the Blessed One was dwelling among the Sakyans at Kapilavatthu in the Great Wood, together with a large Sangha of approximately five hundred bhikkhus, all of them arahants. And most of the devatas from ten world-systems had gathered in order to see the Blessed One and the Bhikkhu Sangha. Then the thought occurred to four devatas of the ranks from the Pure Abodes:", "entities": [ [ "PERSON", "Blessed One" ], [ "NORP", "Sakyans" ], [ "GPE", "Kapilavatthu" ], [ "LOC", "Great Wood" ], [  "NORP", "Sangha" ], [ "NORP", "bhikkhus" ], [ "NORP", "arahants" ], [ "NORP", "devatas" ], [  "LOC", "ten world-systems"], [ "PERSON", "Blessed One" ], [ "NORP", "Bhikkhu Sangha" ], [ "NORP", "devatas" ], [ "LOC", "Pure Abode" ] ] }
{ "text": "\"Last night, monks, a certain devata in the far extreme of the night, her extreme radiance lighting up the entirety of Jeta's Grove, came to me and, on arrival, bowed down to me and stood to one side.", "entities": [ [ "NORP", "monks" ], [ "NORP", "devata" ], [ "LOC", "Jeta's Grove" ] ] }
{ "text": "As she was standing there, she said to me, 'These seven qualities, lord, lead to a monk's non-decline. Which seven? Respect for the teacher, respect for the Dhamma, respect for the Sangha, respect for training, respect for concentration, compliance, [1] having admirable friends. These seven qualities, lord, lead to a monk's non-decline.'", "entities" : [ ["NORP", "Sangha" ],  [  "DOCTRINE"  , "Dhamma" ] ] }
{ "text": "I have heard that on one occasion the Blessed One was staying near Rajagaha in the Bamboo Grove, the Squirrels' Sanctuary. Then a number of monks from the [Blessed One's] native land, having completed the Rains Retreat in the native land, went to the Blessed One and, on arrival, having bowed down to him, sat to one side.", "entities": [ [ "PERSON", "Blessed One" ], [ "GPE", "Rajagaha" ], [ "LOC", "Bamboo Grove" ], [ "LOC", "Squirrels' Sanctuary" ], [ "NORP", "monks" ], [ "PERSON", "Blessed One" ], [ "EVENT", "Rains Retreat" ], [ "PERSON", "Blessed One" ] ] }