{ "text": "Then Moliyasivaka the wanderer went to the Blessed One and exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to the Blessed One, \"'The Dhamma is visible here-&-now, the Dhamma is visible here-&-now,' it is said. To what extent is the Dhamma visible here-&-now, timeless, inviting verification, pertinent, to be realized by the wise for themselves?\"", "entities": [ [  "PERSON", "Moliyasivaka" ], [ "PERSON", "Blessed One" ], [ "PERSON", "Blessed One" ] ] }
{ "text": "I have heard that on one occasion the Blessed One was staying at Savatthi , in Jeta's Grove, Anathapindika's monastery. There he addressed the monks: \"Monks!\"", "entities": [ [ "PERSON", "Blessed One" ], [ "GPE", "Savatthi" ], [ "LOC", "Jeta's Grove" ], [ "LOC", "Anathapindika's monastery" ], [ "NORP", "Monks" ] ] }
{ "text": "In have heard that on one occasion the Blessed One was staying near Rājagaha on Vulture Peak mountain, not long after Devadatta had left. Referring to Devadatta , the Blessed One addressed the monks:", "entities": [ [ "PERSON", "Blessed One" ], [ "GPE", "Rājagaha" ], [ "LOC", "Vulture Peak mountain" ], [ "PERSON", "Devadatta" ], [ "PERSON", "Devadatta" ] ,[ "PERSON", "Blessed One" ] ] } 
{ "text": "I have heard that on one occasion the Blessed One was staying in the Kuru country. Now there is a town of the Kurus called Kammasadhamma. There the Blessed One addressed the monks: \"Monks.\"", "entities": [ [ "PERSON", "Blessed One" ], [ "LOC", "Kuru country" ], [ "NORP", "Kurus" ], [ "GPE", "Kammasadhamma"] ,[ "PERSON", "Blessed One" ], [ "NORP", "Monks" ] ] }
{ "text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monstery. And on that occasion five hundred brahmans from various provinces were staying at Savatthi on some business or other. The thought occurred to them, \"This Gotama the contemplative prescribes purity for the four castes. Now who is capable of disputing with him on this statement?\" And on that occasion the brahman student Assalayana was staying at Savatthi. Young, shaven-headed, sixteen years old, he was a master of the Three Vedas with their vocabularies, liturgy, phonology, etymology, & histories as a fifth; skilled in philology & grammar, he was fully versed in cosmology and in the marks of a Great Man. The thought occurred to the brahmans, \"This brahman student Assalayana is staying in Savatthi... He is capable of disputing with Gotama the contemplative on this statement.\"", "entities": [ [ "PERSON", "Blessed One" ], [ "GPE", "Savatthi" ], [ "LOC", "Jeta's Grove" ], [ "PERSON", "Anathapindika" ], [ "NORP", "brahmans" ], [ "GPE", "Savatthi" ], [ "PERSON", "Gotama" ], [ "PERSON", "Assalayana" ], [ "GPE", "Savatthi" ], [ "NORP", "brahmans" ], [ "PERSON", "Assalayana" ], [ "GPE", "Savatthi" ], [ "PERSON", "Gotama" ] ] }
{ "text": "Then the wanderer Vacchagotta went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there he asked the Blessed One: How is it, Master Gotama, does Master Gotama hold the view: The cosmos is eternal: only this is true, anything otherwise is worthless?", "entities": [ [ "PERSON", "Vacchagotta" ], [ "PERSON", "Blessed One" ], [ "PERSON", "Blessed One" ], [ "PERSON", "Master Gotama" ], [ "PERSON", "Master Gotama" ] ] } 
{ "text": "Then a certain monk went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the Blessed One: \"It would be good if the Blessed One would teach me the Dhamma in brief so that, having heard the Dhamma from the Blessed One, I might dwell alone in seclusion: heedful, ardent, & resolute.\"", "entities": [ [ "PERSON", "Blessed One" ], [ "PERSON", "Blessed One" ], [ "PERSON", "Blessed One" ], [ "PERSON", "Blessed One" ] ] }
{ "text": "Now on that occasion this pernicious viewpoint (diṭṭhigata) had arisen in the monk Sāti the Fisherman's Son: \"As I understand the Dhamma taught by the Blessed One, it is just this consciousness that runs and wanders on [from birth to birth], not another.", "entities": [ [ "PERSON", "Sāti the Fisherman's Son" ], [ "PERSON", "Blessed One" ] ] }
{ "text": "Then Kesi the horsetrainer went to the Blessed One and, on arrival, having bowed down, sat to one side", "entities": [ ["PERSON", "Kesi the horsetrainer" ], [ "PERSON" , "Blessed One" ] ]} 
{ "text": "Then two brahman cosmologists went to the Blessed One and, on arrival, exchanged courteous greetings with him.", "entities" : [ [ "NORP", "brahman cosmologists" ], [ "PERSON", "Blessed One" ] ] }
{ "text":  "After an exchange of friendly greetings & courtesies, they sat to one side. As they were sitting there, they said to the Blessed One, \"Master Gotama, Purana Kassapa — all-knowing, all-seeing — claims exhaustive knowledge & vision: 'Whether I am standing or walking, awake or asleep, continual, unflagging knowledge & vision is established within me.' He says, 'I dwell with infinite knowledge, knowing & seeing the finite cosmos.' Yet Nigantha Nataputta — all-knowing, all-seeing — also claims exhaustive knowledge & vision: 'Whether I am standing or walking, awake or asleep, continual, unflagging knowledge & vision is established within me.' He says, 'I dwell with infinite knowledge, knowing & seeing the infinite cosmos.' Of these two speakers of knowledge, these two who contradict each other, which is telling the truth, and which is lying?\"", "entities": [ [ "PERSON", "Blessed One" ], [ "PERSON", "Master Gotama" ], [ "PERSON", "Purana Kassapa" ], [ "PERSON", "Nigantha Nataputta" ] ] } 
{ "text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika 's monastery. There he said to the monks: \"Monks, if wanderers who are members of other sects should ask you, ' What , friend, are the prerequisites for the development of the wings to self-awakening?' how would you answer them?\"", "entities": [ [ "PERSON", "Blessed One" ], [ "GPE", "Savatthi" ], [ "LOC", "Jeta's Grove" ], [ "LOC", "Anathapindika 's monastery" ], [ "NORP", "Monks" ], [ "NORP", "wanderers" ] ] }
{ "text": "I have heard that on one occasion the Blessed One was staying near Rajagaha in the Bamboo Grove, the Squirrels' Sanctuary. Now, on that occasion Ven. Sariputta was wandering in the Southern Mountains with a large community of monks. Then a certain monk who had spent the Rains in Rajagaha went to the Southern Mountains, to Ven. Sariputta.", "entities": [ [ "PERSON", "Blessed One" ], [ "GPE", "Rajagaha" ], [ "LOC", "Bamboo Grove" ], [  "LOC", "Squirrels' Sanctuary" ], [ "PERSON", "Ven. Sariputta" ], [ "LOC", "Southern Mountains"], [ "EVENT", "the Rains" ], [ "GPE", "Rajagaha" ], [ "LOC", "Southern Mountains"], [ "PERSON", "Ven. Sariputta" ] ] }
{ "text": "Thus have I heard: At one time the Exalted One was staying near Savatthi at the Eastern monastery in the mansion (given by) Migara's mother.", "entities" : [ [ "PERSON", "Exalted One" ], [ "GPE", "Savatthi" ], [ "LOC", "Eastern monastery" ], [  "LOC", "the mansion"], [ "PERSON", "Migara 's mother"] ] }
{ "text": "Then Visakha , [1] Migara's mother, approached the Exalted One; having approached and bowed down she sat down in a suitable place. When she was seated the Exalted One spoke thus to Visakha, Migara's Mother:", "entities": [ [ "PERSON", "Visakha" ], [  "PERSON", "Migara's mother" ], ["PERSON", "Exalted One" ], [ "PERSON", "Visakha" ], [ "PERSON", "Migara's Mother" ] ] } 
{ "text": "Now at that time a new reception hall [1] had just been built by the Kapilavatthu Sakyans, and it had not yet been dwelled in by any contemplative, brahman, or anyone at all in human form. So the Kapilavatthu Sakyans went to the Blessed One and, on arrival, having bowed down, sat to one side.", "entities": [ [ "GPE", "Kapilavatthu" ], [ "NORP", "Sakyans" ], [ "GPE", "Kapilavatthu" ], [ "NORP", "Sakyans" ], [ "PERSON", "Blessed One" ] ] }
{ "text": "As they were sitting there they said to him, \"Lord, a new reception hall has just been built by the Kapilavatthu Sakyans, and it has not yet been dwelled in by any contemplative, brahman, or anyone at all in human form. May the Blessed One be the first to use it. When the Blessed One has used it first, the Kapilavatthu Sakyans will use it afterwards. That will be for their long-term welfare & happiness.\"", "entities": [ [ "PERSON", "Lord" ], [ "GPE", "Kapilavatthu"], [ "NORP", "Sakyans" ], [ "PERSON", "Blessed One" ], [ "PERSON", "Blessed One" ], [ "GPE", "Kapilavatthu"], [ "NORP", "Sakyans" ] ] }
{ "text": "\"Endowed with five qualities, a king's elephant is worthy of a king, is a king's asset, counts as a very limb of his king. Which five? There is the case where a king's elephant is a listener, a destroyer, a protector, an endurer, and a goer.", "entities": [ ] }
{ "text": "I have heard that on one occasion the Blessed One was staying at Savatthi , in Jeta's Grove, Anathapindika's Monastery . Then the Blessed One, early in the morning, put on his robes and, carrying his bowl and outer robe, went into Savatthi for alms. And Ven. Rahula, early in the morning, put on his robes and, carrying his bowl and outer robe, went into Savatthi for alms following right behind the Blessed One. [1] Then the Blessed One, looking back at Rahula, addressed him: \"Rahula, any form whatsoever that is past, future, or present; internal or external; blatant or subtle; common or sublime; far or near: every form is to be seen as it actually is with right discernment as: 'This is not mine. This is not my self. This is not what I am.'\"", "entities": [ [ "PERSON", "Blessed One" ], [ "GPE", "Savatthi" ], [ "LOC", "Jeta's Grove" ], [ "LOC", "Anathapindika's Monastery" ], [ "PERSON", "Blessed One" ], [ "GPE", "Savatthi" ], [ "PERSON", "Ven. Rahula" ], [ "GPE", "Savatthi" ], [ "PERSON", "Blessed One" ], [ "PERSON", "Blessed One" ], [ "PERSON", "Rahula" ], [ "PERSON", "Rahula" ], ] }
{ "text": "I have heard that on one occasion, as the Blessed One was wandering among the Magadhans , he entered Rajagaha , went to the potter Bhaggava , and on arrival said to him, \"If it is no inconvenience for you, Bhaggava, I will stay for one night in your shed.\"", "entities": [ [ "PERSON", "Blessed One" ], [ "NORP", "Magadhans" ], [ "GPE", "Rajagaha" ], [ "PERSON", "Bhaggava" ], [ "PERSON", "Bhaggava" ] ] }
{ "text": "I have heard that on one occasion the Blessed One was staying near Rājagaha at the Bamboo Grove in the Squirrels' sanctuary. And on that occasion Ven. Samiddhi was staying in a wilderness hut. Then Potaliputta the wanderer, while walking & wandering around to exercise his legs, went to Ven. Samiddhi and exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to Ven. Samiddhi, \"Face to face with Gotama the contemplative have I heard this, face to face have I learned this: 'Bodily action is barren, verbal action is barren, only mental action is true. And there is an attainment in which, on being attained, nothing is felt.'\"", "entities": [ [ "PERSON", "Blessed One" ], [ "GPE", "Rājagaha" ], [ "LOC", "Bamboo Grove" ], [ "LOC", "Squirrels' sanctuary" ], [ "PERSON", "Ven. Samiddhi" ], [ "PERSON", "Potaliputta" ], [ "PERSON", "Ven. Samiddhi" ], [ "PERSON", "Ven. Samiddhi" ], [ "PERSON", "Gotama" ] ] }
{ "text" : "Soon after the wanderer Potaliputta had gone, the venerable Samiddhi went to the venerable Ananda and exchanged greetings with him, and when the courteous and amiable talk was finished, he sat down at one side. When he had done so, he told the venerable Ananda all his conversation with the wanderer Potaliputta.", "entities" : [ ["PERSON", "Potaliputta"], ["PERSON", "venerable Samiddhi" ], [ "PERSON" , "venerable Ananda" ], [ "PERSON", "venerable Ananda" ], [ "PERSON", "Potaliputta" ] ] }
{ "text": "I have heard that on one occasion the Blessed One, on a wandering tour among the Kosalans with a large community of monks, arrived at a Kosalan brahman village named Icchanangala. There he stayed in the Icchanangala forest grove.", "entities": [ [ "PERSON", "Blessed One" ], [ "NORP", "Kosalans" ], [ "NORP", "Kosalan" ], [ "NORP", "Icchanangala" ], [ "LOC", "Icchanangala forest grove" ] ] } 
{ "text": "\"Monks, the taking of life — when indulged in, developed, & pursued — is something that leads to hell, leads to rebirth as a common animal, leads to the realm of the hungry shades. The slightest of all the results coming from the taking of life is that, when one becomes a human being, it leads to a short life span.", "entities": [ [ "NORP", "Monks" ], [  "NORP", "hungry shades" ] ] }
{ "text": "Then Janussonin the brahman went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there he said to the Blessed One: \"I am of the view & opinion that there is no one who, subject to death, is not afraid or in terror of death.\"", "entities": [ [ "PERSON", "Janussonin" ], [ "PERSON", "Blessed One" ], [ "PERSON", "Blessed One" ] ] }
{ "text": "I have heard that on one occasion the Blessed One was staying in Rajagaha , on Vulture Peak Mountain. There he addressed the monks: \"Monks, I will teach you the seven conditions that lead to no decline. Listen & pay close attention. I will speak.\"", "entities": [ [ "PERSON", "Blessed One" ], [ "GPE", "Rajagaha" ], [ "LOC", "Vulture Peak Mountain" ], [ "NORP", "Monks" ] ] }
{ "text": "On one occasion the Blessed One was staying at Savatthi , in Jeta's Grove, Anathapindika's Monastery. There he addressed the monks, \"Monks!\"", "entities": [ [ "PERSON", "Blessed One" ], [ "GPE", "Savatthi" ], [ "LOC", "Jeta's Grove" ], [ "LOC", "Anathapindika's Monastery" ], [ "NORP", "Monks" ] ] } 
{ "text": "Now the Koliyans have a town named Kakkarapatta.", "entities" : [ [ "NORP", "Koliyans" ], [ "GPE", "Kakkarapatta" ] ] }
{ "text" : "There Dighajanu [1] the Koliyan went to the Blessed One and, on arrival, having bowed down to the Blessed One, sat to one side. As he was sitting there he said to the Blessed One, \"We are lay people enjoying sensuality; living crowded with spouses & children; using Kasi fabrics & sandalwood; wearing garlands, scents, & creams; handling gold & silver. May the Blessed One teach the Dhamma for those like us, for our happiness & well-being in this life, for our happiness & well-being in lives to come.\"", "entities": [ [ "PERSON" , "Dighajanu" ], [ "NORP", "Koliyan" ], [ "PERSON", "Blessed One" ], [ "PERSON", "Blessed One" ], [ "PERSON", "Blessed One" ], [ "PERSON", "Blessed One" ] ] }
{ "text": "On one occasion Ven. Maha Kaccana was staying at Madhura in the Gunda Forest.", "entities" : [ [ "PERSON", "Ven. Maha Kaccana" ], [ "GPE", "Madhura" ], [  "LOC", "Gunda Forest" ]] }
{ "text" : "Then Kandarayana the brahman went to Ven. Maha Kaccana and on arrival exchanged courteous greetings with him.", "entities" : [[  "PERSON" , "Kandarayana" ], [ "PERSON", "Ven. Maha Kaccana" ]] }
{ "text" : "he said to Ven. Maha Kaccana, \"I have heard it said, Master Kaccana, that, 'Kaccana the contemplative does not raise his hands in respect to aged, venerable brahmans — advanced in years, come to the last stage of life — nor does he rise up to greet them, nor does he offer them a seat.' Insofar as you don't raise your hands in respect to aged, venerable brahmans — advanced in years, come to the last stage of life — nor rise up to greet them, nor offer them a seat, that is simply not right, Master Kaccana.\"", "entities": [ [ "PERSON", "Ven. Maha Kaccana" ], [ "PERSON", "Master Kaccana" ], [ "PERSON" , "Kaccana" ], [ "PERSON", "Master Kaccana" ] ] }
{ "text": "Having gone for alms in Kapilavatthu, after the meal, returning from his alms round, he went to the dwelling of Kala-khemaka the Sakyan for the day's abiding. Now at that time many resting places had been prepared in Kala-khemaka the Sakyan's dwelling. The Blessed One saw the many resting places prepared there and, on seeing them, the thought occurred to him, \"There are many resting places prepared here. Do many monks live here?\"", "entities": [ [ "GPE", "Kapilavatthu" ], [ "PERSON", "Kala-khemaka" ], [ "NORP", "Sakyan" ], [ "PERSON", "Kala-khemaka" ], [ "NORP", "Sakyan" ], [ "PERSON", "Blessed One" ] ] }
{ "text": "On one occasion Ven. Ananda was staying in Kosambi , at Ghosita's monastery . There he addressed the monks, \"Friends!\"", "entities": [ [ "PERSON", "Ven. Ananda" ], [ "GPE", "Kosambi" ], [ "LOC", "Ghosita's monastery" ] ] } 
{ "text": "I have heard that on one occasion the Blessed One was staying near Rajagaha , at the Bamboo Grove, the Squirrels' Feeding Ground.", "entities": [ [ "PERSON", "Blessed One" ], [ "GPE", "Rajagaha" ], [ "LOC", "Bamboo Grove" ], [ "LOC" , "Squirrels' Feeding Ground" ] }
{ "text": "I have heard that at one time the Blessed One was staying at Nadika , in the Brick Hall. There he addressed the monks, \"Monks, mindfulness of death — when developed & pursued — is of great fruit & great benefit. It gains a footing in the Deathless, has the Deathless as its final end. And how is mindfulness of death developed & pursued so that it is of great fruit & great benefit, gains a footing in the Deathless, and has the Deathless as its final end?", "entities": [ [ "PERSON", "Blessed One" ], [ "GPE" , "Nadika" ], [ "LOC", "Brick Hall" ], [ "NORP", "Monks" ] ] }
{ "text": "I heard thus. Once the Blessed One, while wandering in the Kosala country with a large community of bhikkhus, entered a town of the Kalama people called Kesaputta.", "entities" :   [ [  "PERSON", "Blessed One" ], [ "GPE", "Kosala" ], [ "NORP", "bhikkhus" ], [ "GPE", "Kalama" ], [ "GPE", "Kesaputta" ] ] }
{ "text" : "The Kalamas who were inhabitants of Kesaputta: Reverend Gotama, the monk, the son of the Sakyans, has, while wandering in the Kosala country, entered Kesaputta. The good repute of the Reverend Gotama has been spread in this way", "entities": [ [ "NORP" , "Kalamas" ], [ "GPE" , "Kesaputta" ], [ "PERSON", "Reverend Gotama" ], [ "NORP", "Sakyans" ], [ "GPE", "Kosala" ], [ "GPE", "Kesaputta" ], [ "PERSON", "Reverend Gotama" ] ] }
{ "text": "Now on that occasion Potthapada the wanderer , together with a large following of about 300 wanderers, had taken up residence in the debating hall near the Tinduka tree in the single-pavilion park of Queen Mallika", "entities": [ [ "PERSON", "Potthapada" ], [ "NORP", "wanderers" ], [  "PERSON", "Queen Mallika" ] ]}
{ "text" : "Then the Blessed One, early in the morning, taking his robes & bowl, entered Savatthi for alms. Then the thought occurred to him, \"While it's still too early to go into Savatthi for alms, why don't I go to the debating hall near the Tinduka tree in the single-pavilion park of Queen Mallika to see Potthapada the wanderer?\" So he went to the debating hall near the Tinduka tree in the single-pavilion park of Queen Mallika.", "entities" : [ [ "PERSON", "Blessed One" ], [ "GPE", "Savatthi" ], [ "GPE", "Savatthi" ], [ "PERSON", "Queen Mallika" ], ["PERSON", "Queen Mallika" ] ] } 
{ "text": "I have heard that on one occasion, while the Blessed One was on a wandering tour among the Kosalans with a large community of monks, he arrived at Salavatika .", "entities": [ [ "PERSON", "Blessed One" ], [ "NORP", "Kosalans" ], [ "GPE", "Salavatika" ] ] }
{ "text": "I have heard that on one occasion the Blessed One was staying at Ukkattha , in the shade of a royal Sal tree in the Very Blessed Grove. There he addressed the monks, \"Monks!\"", "entities": [ [ "PERSON", "Blessed One" ], [ "GPE", "Ukkattha" ], [ "LOC" , "Very Blessed Grove" ], [ "NORP", "Monks" ] ] }
{ "text": "I have heard that on one occasion the Blessed One was staying near Rajagaha in the Bamboo Grove, the Squirrels' Sanctuary.", "entities": [ [ "PERSON", "Blessed One" ], [ "GPE", "Rajagaha" ], [ "LOC", "Bamboo Grove" ], [ "LOC", "Squirrels' Sanctuary" ] ] }
{ "text": "Last night, monks, a certain devata in the far extreme of the night, her extreme radiance lighting up the entirety of Jeta's Grove, came to me and, on arrival, bowed down to me and stood to one side.", "entities": [ [ "NORP", "devata" ], [ "LOC", "Jeta's Grove" ] ] }
{ "text": "I have heard that on one occasion the Blessed One was staying among the Sakyans at Kapilavatthu in the Banyan Park. Then Mahanama the Sakyan [1] went to the Blessed One and, on arrival, having bowed down to him, sat to one side.", "entities": [ [ "PERSON", "Blessed One" ], [ "NORP", "Sakyans"] , [ "GPE", "Kapilavatthu" ], [  "LOC", "Banyan Park" ], [ "PERSON", "Mahanama the Sakyan" ], [ "NORP", "Sakyan" ], [ "PERSON", "Blessed One" ] ] }
{ "text": "Thus I heard. On one occasion the venerable Nandaka was living at Savatthi in the Eastern Monastery, Migara's Mother's Palace.", "entities" : [ [ "PERSON", "venerable Nandaka" ], [ "GPE", "Savatthi" ], [ "LOC", "Eastern Monastery" ], [ "LOC", "Migara's Mother's Palace" ] ] }
{ "text" : "Then Migara's grandson, Salha , and Pekhuniya 's grandson, Rohana , went to the venerable Nandaka, and after salutation they sat down at one side. When they had done so the venerable Nandaka said to Migara's grandson Salha:", "entities": [ [ "PERSON", "Migara's grandson" ], [ "PERSON", "Salha" ], [ "PERSON", "Pekhuniya's grandson"] , [ "PERSON", "Rohana" ], [ "PERSON", "venerable Nandaka" ], [ "PERSON", "venerable Nandaka" ], [ "PERSON", "Migara's grandson Salha" ] ] }
{ "text": "I have heard that at one time the Blessed One was staying at Nadika , in the Brick Hall. There he addressed the monks, \"Monks!\"", "entities": [ [ "PERSON", "Blessed One" ], [ "GPE", "Nadika" ], [ "LOC" , "Brick Hall" ], [ "NORP", "Monks" ] ] }
{ "text": "I have heard that on one occasion the Blessed One was staying near Vesali in the Great Forest, at the Peaked Pavilion. Now at that time a large number of monks had declared final gnosis in the Blessed One's presence:", "entities": [ [ "PERSON", "Blessed One" ], [ "GPE", "Vesali" ], [ "LOC" , "Great Forest" ], [ "LOC", "Peaked Pavilion" ], [ "PERSON", "Blessed One" ] ] }
{ "text": "And on that occasion the lay woman Velukandaki, Nanda's mother, had established a donation endowed with six factors for the community of monks headed by Sariputta & Moggallana.", "entities": [ [ "PERSON", "Velukandaki" ] , [ "PERSON" , "Nanda's mother" ], [ "PERSON", "Sariputta" ], [ "PERSON", "Moggallana" ], [ "PERSON", "Blessed One" ], [ "NORP", "monks" ], [ "PERSON", "Sariputta" ], [ "PERSON", "Moggallana" ], ] }
{ "text": "Then Ugga, the king's chief minister, approached the Blessed One and, on arrival, having bowed down, sat to one side. As he was sitting there, he said to the Blessed One: It's amazing, lord, & awesome, how prosperous Migara Rohaneyya is, how great his treasures, how great his resources!", "entities": [ [ "PERSON",  "Ugga" ], [ "PERSON", "Blessed One" ], [ "PERSON", "Blessed One" ], [ "PERSON", "Migara Rohaneyya" ] ] }
{ "text": "I have heard that on one occasion the Blessed One was staying near Savatthi in the Eastern Monastery, the palace of Migara's mother . And on that occasion — the uposatha of the fifteenth, the night of a very full moon — he was sitting out in the open with the community of monks. Then, having surveyed the silent community of monks, he addressed them: \"Monks, could a person of no integrity know of a person of no integrity: 'This is a person of no integrity'?\"", "entities": [ [ "PERSON", "Blessed One" ], [ "GPE", "Savatthi" ], [ "LOC", "Eastern Monastery" ], [ "LOC", "palace of Migara's mother" ], ["EVENT" , "uposatha"], [ "NORP", "monks" ], [ "NORP", "monks" ], [ "NORP", "Monks" ] ] }
{ "text": "I have heard that on one occasion the Blessed One was staying among the Udaññans , in the Deer Park at Kannakatthala.", "entities": [ [ "PERSON", "Blessed One" ], [ "NORP", "Udaññans" ], [ "LOC", "Deer Park" ], [ "GPE", "Kannakatthala" ] ]}
{ "text" : "And at that time King Pasenadi Kosala had arrived at Udañña on some business or other.", "entities" : [ [ "PERSON", "King Pasenadi Kosala" ], [ "GPE" , "Udañña" ] ] }
{ "text": "Now at that time, Janussonin the brahman was driving out of Savatthi in the middle of the day in a totally white roofed-chariot. [1] He saw Pilotika the wanderer coming from afar and, on seeing him, said to him, \"Now where is Master Vacchayana [2] coming from in the middle of the day?\"", "entities": [ [ "PERSON", "Janussonin" ], [ "PERSON", "Pilotika" ], [ "PERSON", "Master Vacchayana" ] ] }
{ "text": "I have heard that on one occasion the Blessed One was staying among the Anguttarapans at an Anguttarapan town named Apana . Then, early in the morning, having put on his robes and carrying his outer robe & bowl, went into Apana for alms.", "entities": [ [ "PERSON", "Blessed One" ], [ "NORP", "Anguttarapans" ], [ "GPE", "Anguttarapan" ], [ "GPE", "Apana" ], [ "GPE", "Apana" ] ] }
{ "text": "I have heard that on one occasion the Blessed One was staying among the Sakyans at Kapilavatthu in the Banyan Park . Now at that time the Blessed One had just recovered from being ill, was not long recovered from his illness. Then Mahanama the Sakyan went to the Blessed One and, on arrival, having bowed down, sat to one side. As he was sitting there he said to the Blessed One: \"For a long time I have known the Dhamma taught by the Blessed One that 'There is knowledge for one who is concentrated, not for one who is not concentrated.' Now, does concentration come first, and knowledge after, or does knowledge come first, and concentration after?\"", "entities": [ [ "PERSON", "Blessed One" ], [ "NORP", "Sakyans" ], [ "GPE", "Kapilavatthu" ], [ "LOC", "Banyan Park" ], [ "PERSON", "Blessed One" ], [ "PERSON", "Mahanama the Sakyan" ], [ "PERSON", "Blessed One" ], [ "PERSON", "Blessed One" ], [ "PERSON", "Blessed One" ] ] }
{ "text": "There he stayed in the Icchanangala forest grove.", "entities": [ [ "LOC", "Icchanangala forest grove" ] ] }
{ "text": "I have heard that on one occasion the Blessed One was staying among the Vajjians at Bhanda Village. There he addressed the monks, \"Monks!\"", "entities": [ [ "PERSON", "Blessed One" ], [ "NORP", "Vajjians" ], [ "GPE", "Bhanda Village" ], [ "NORP", "Monks" ] ] } 
{ "text": "On one occasion the Blessed One was staying near Vesali at Gotamaka Shrine.", "entities": [ [ "PERSON", "Blessed One" ], [ "GPE", "Vesali" ], [ "LOC", "Gotamaka Shrine" ] ] }

{ "text": "Now at that time the Blessed One was sitting & exchanging courtesies & conversation with some very senior brahmans. It so happened that a brahman student named Kapadika was seated in the assembly", "entities": [ [ "PERSON", "Blessed One" ], [ "NORP", "brahmans" ], [ "PERSON", "Kapadika" ] ] }
{ "text": "I have heard that on one occasion the Blessed One was staying at Nalanda in Pavarika's mango grove. Then Kevatta the householder approached the Blessed One and, on arrival, having bowed down, sat to one side.", "entities": [ [ "PERSON", "Blessed One" ], [ "GPE", "Nalanda" ], [ "LOC", "Pavarika's mango grove" ], [ "PERSON", "Kevatta" ], [ "PERSON", "Blessed One" ] ] }
{ "text": "I have heard that on one occasion, when the Blessed One was on a wandering tour among the Kosalans with a large community of monks, he arrived at the brahman village called Sala.", "entities": [ [ "PERSON", "Blessed One" ], [ "NORP", "Kosalans" ], [ "GPE", "Sala" ] ]}
{ "text": "Then Subha the student, Todeyya's son , went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to the Blessed One: \"Master Gotama, what is the reason, what is the cause, why baseness & excellence are seen among human beings, among the human race? For short-lived & long-lived people are to be seen, sickly & healthy, ugly & beautiful, uninfluential & influential, poor & rich, low-born & high-born, stupid & discerning people are to be seen. So what is the reason, what is the cause, why baseness & excellence are seen among human beings, among the human race?\"", "entities": [ [ "PERSON", "Subha" ], [ "PERSON" ,"Todeyya"], [ "PERSON", "Blessed One" ], [ "PERSON", "Blessed One" ], [ "PERSON", "Master Gotama" ] ] }
{ "text": "Then Vacchagotta the wanderer went to the Blessed One and, on arrival, exchanged courteous greetings with him.", "entities": [  [ "PERSON",  "Vacchagotta" ], [ "PERSON", "Blessed One" ] ] } 
{ "text": "I have heard that on one occasion the Blessed One, on a wandering tour among the Kurus with a large community of monks, arrived at Thullakotthita , a town of the Kurus.", "entities": [ [ "PERSON", "Blessed One" ], [ "NORP", "Kurus" ], [ "GPE", "Thullakotthita" ], [ "NORP", "Kurus" ] ]}
{ "text" : "The brahmans & householders of Thullakotthita heard it said, \"Gotama the contemplative — the son of the Sakyans, having gone forth from the Sakyan clan — has arrived at Thullakotthita. And of that Master Gotama this fine reputation has spread: 'He is indeed a Blessed One, worthy, & rightly self-awakened, consummate in knowledge & conduct, well-gone, a knower of the cosmos, an unexcelled trainer of those persons ready to be tamed, teacher of human & divine beings, awakened, blessed. He has made known — having realized it through direct knowledge — this world with its devas, maras, & brahmas, its generations with their contemplatives & brahmans, their rulers & common people.\"", "entities" : [ [ "NORP", "brahmans" ], [ "NORP", "householders" ], [ "GPE", "Thullakotthita" ], [ "PERSON", "Gotama" ], [ "NORP", "Sakyans" ], [ "NORP", "Sakyan" ], [ "GPE", "Thullakotthita" ]. [ "PERSON", "Master Gotama" ], [ "PERSON", "Blessed One" ], [ "NORP", "devas" ], [ "NORP", "maras" ], [ "NORP", "brahmas" ], [ "NORP", "contemplatives" ], [ "NORP", "brahmans" ] ] }
{ "text": "I have heard that on one occasion the Blessed One was staying at Savatthi in the Eastern Monastery, the palace of Migara's mother, together with many well-known elder disciples — with Ven. Sariputta , Ven. Maha Moggallana , Ven. Maha Kassapa , Ven. Maha Kaccana , Ven. Maha Kotthita , Ven. Maha Kappina , Ven. Maha Cunda , Ven. Revata , Ven. Ananda , and other well-known elder disciples. On that occasion the elder monks were teaching & instructing. Some elder monks were teaching & instructing ten monks, some were teaching & instructing twenty monks, some were teaching & instructing thirty monks, some were teaching & instructing forty monks. The new monks, being taught & instructed by the elder monks, were discerning grand, successive distinctions.", "entities": [ [ "PERSON", "Blessed One" ], [ "GPE", "Savatthi" ], [ "LOC", "Eastern Monastery" ], [ "LOC", "palace of Migara's mother" ], [ "PERSON", "Ven. Sariputta" ], [ "PERSON", "Ven. Maha Moggallana" ], [ "PERSON", "Ven. Maha Kassapa" ], [ "PERSON", "Ven. Maha Kaccana" ], [ "PERSON", "Ven. Maha Kotthita" ], [ "PERSON", "Ven. Maha Kappina" ], [ "PERSON", "Ven. Maha Cunda" ], [ "PERSON", "Ven. Revata" ], [ "PERSON", "Ven. Ananda" ] ] } 
{ "text": "Then Ven. Samiddhi went to Ven. Sariputta and, on arrival, having bowed down to him, sat to one side. As he was sitting there, Ven. Sariputta said to him, \"Based on what, Samiddhi, do thoughts & resolves arise in a person?\"", "entities": [ [ "PERSON", "Ven. Samiddhi" ], [ "PERSON", "Ven. Sariputta" ], [ "PERSON", "Ven. Sariputta" ], [ "PERSON", "Samiddhi" ] ] }
{ "text": "\"Monks, speaking rightly of Nanda, one could say, 'He is a son of a good family.' Speaking rightly of Nanda, one could say, 'He is strong.'", "entities": [ [ "NORP", "Monks" ],  [ "PERSON", "Nanda" ], ["PERSON", "Nanda" ] ] }
{ "text": "Then the brahman Sangarava went to the Blessed One and, on arrival, exchanged courteous greetings with him." "entities": [ [ "PERSON", "brahman Sangarava" ], [ "PERSON", "Blessed One" ] ] }
{ "text": "Once the Blessed One was staying among the Bhaggas in the Deer Park at Bhesakala Grove, near Crocodile Haunt. And at that time Ven. Anuruddha was living among the Cetis in the Eastern Bamboo Park. Then, as he was alone in seclusion, this line of thinking arose in Ven. Anuruddha's awareness", "entities": [ [ "PERSON", "Blessed One" ], [ "NORP", "Bhaggas" ], [ "LOC", "Deer Park" ], [ "LOC", "Bhesakala Grove" ], [ "LOC", "Crocodile Haunt" ], [ "PERSON", "Ven. Anuruddha" ], [ "NORP", "Cetis" ], [ "LOC", "Eastern Bamboo Park" ], [ "PERSON", "Ven. Anuruddha" ] ] } 
{ "text": "Then Janussonin the brahman went to the Blessed One and, on arrival, exchanged courteous greetings with him.", "entities": [ [ "PERSOM", "Janussonin" ], [ "PERSON", "Blessed One" ] }
{ "text": "Now, at that time Queen Mallika died. Then a certain man went to the king and whispered in his ear: \"Your majesty, Queen Mallika has died.\" When this was said, King Pasenadi the Kosalan sat there miserable", "entities": [ [ "PERSON", "Queen Mallika" ], [ "PERSON", "Queen Mallika" ], [ "PERSON", "King Pasenadi" ], [ "NORP", "Kosalan" ] ] }