
{ "text": "Then Moliyasivaka the wanderer went to the Blessed One and exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to the Blessed One, \"'The Dhamma is visible here-&-now, the Dhamma is visible here-&-now,' it is said. To what extent is the Dhamma visible here-&-now, timeless, inviting verification, pertinent, to be realized by the wise for themselves?\"", "entities": [ [  "PERSON", "Moliyasivaka" ], [ "PERSON", "Blessed One" ], [ "PERSON", "Blessed One" ], [  "DOCTRINE",  "Dhamma" ], [  "DOCTRINE",  "Dhamma" ], [  "DOCTRINE",  "Dhamma" ] ] }
{
  "text": "I have heard that on one occasion the Blessed One was staying at Savatthi , in Jeta's Grove, Anathapindika's monastery. There he addressed the monks: \"Monks!\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's monastery"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "In have heard that on one occasion the Blessed One was staying near Rājagaha on Vulture Peak mountain, not long after Devadatta had left. Referring to Devadatta , the Blessed One addressed the monks:",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Rājagaha"
    ],
    [
      "LOC",
      "Vulture Peak mountain"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying in the Kuru country. Now there is a town of the Kurus called Kammasadhamma . There the Blessed One addressed the monks: \"Monks.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Kuru"
    ],
    [
      "NORP",
      "Kurus"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monstery. And on that occasion five hundred brahmans from various provinces were staying at Savatthi on some business or other. The thought occurred to them, \"This Gotama the contemplative prescribes purity for the four castes. Now who is capable of disputing with him on this statement?\" And on that occasion the brahman student Assalayana was staying at Savatthi. Young, shaven-headed, sixteen years old, he was a master of the Three Vedas with their vocabularies, liturgy, phonology, etymology, & histories as a fifth; skilled in philology & grammar, he was fully versed in cosmology and in the marks of a Great Man. The thought occurred to the brahmans, \"This brahman student Assalayana is staying in Savatthi... He is capable of disputing with Gotama the contemplative on this statement.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "PERSON",
      "Anathapindika"
    ],
    [
      "NORP",
      "brahmans"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "PERSON",
      "Gotama"
    ],
    [
      "NORP",
      "brahman"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "NORP",
      "brahmans"
    ],
    [
      "NORP",
      "brahman"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "PERSON",
      "Gotama"
    ]
  ]
}
{
  "text": "Then Ven. Maha Kotthita went to Ven. Sariputta and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to Ven. Sariputta, \"With the remainderless stopping & fading of the six contact-media [vision, hearing, smell, taste, touch, & intellection] is it the case that there is anything else?\"",
  "entities": [
    [
      "PERSON",
      "Ven. Maha Kotthita"
    ],
    [
      "PERSON",
      "Ven. Sariputta"
    ],
    [
      "PERSON",
      "Ven. Sariputta"
    ]
  ]
}
{
  "text": "Monks, there are these five benefits of walking up & down. [1] What five?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "Then Ven. Sariputta addressed the monks: \"Friend monks.\"",
  "entities": [
    [
      "PERSON",
      "Ven. Sariputta"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying in Savatthi , at Jeta's Grove, Anathapindika's monastery . Then the wanderer Vacchagotta went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there he asked the Blessed One: \"How is it, Master Gotama, does Master Gotama hold the view: 'The cosmos is eternal: only this is true, anything otherwise is worthless'?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's monastery"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Master Gotama"
    ],
    [
      "PERSON",
      "Master Gotama"
    ]
  ]
}
{
  "text": "Then a certain monk went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the Blessed One: \"It would be good if the Blessed One would teach me the Dhamma in brief so that, having heard the Dhamma from the Blessed One, I might dwell alone in seclusion: heedful, ardent, & resolute.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying in Sāvatthī , at Jeta's Grove, Anāthapiṇḍika's park. Now on that occasion this pernicious viewpoint (diṭṭhigata) had arisen in the monk Sāti the Fisherman's Son: \"As I understand the Dhamma taught by the Blessed One, it is just this consciousness that runs and wanders on [from birth to birth], not another.\" A large number of monks heard, \"They say that this pernicious viewpoint has arisen in the monk Sāti the Fisherman's Son: 'As I understand the Dhamma taught by the Blessed One, it is just this consciousness that runs and wanders on [from birth to birth], not another.'\" So they went to the monk Sāti the Fisherman's Son and on arrival said to him, \"Is it true, friend Sāti, that this pernicious viewpoint has arisen in you — 'As I understand the Dhamma taught by the Blessed One, it is just this consciousness that runs and wanders on, not another'?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Sāvatthī"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anāthapiṇḍika's park"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "Then two brahman cosmologists went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, they sat to one side. As they were sitting there, they said to the Blessed One, \"Master Gotama, Purana Kassapa — all-knowing, all-seeing — claims exhaustive knowledge & vision: 'Whether I am standing or walking, awake or asleep, continual, unflagging knowledge & vision is established within me.' He says, 'I dwell with infinite knowledge, knowing & seeing the finite cosmos.' Yet Nigantha Nataputta — all-knowing, all-seeing — also claims exhaustive knowledge & vision: 'Whether I am standing or walking, awake or asleep, continual, unflagging knowledge & vision is established within me.' He says, 'I dwell with infinite knowledge, knowing & seeing the infinite cosmos.' Of these two speakers of knowledge, these two who contradict each other, which is telling the truth, and which is lying?\"",
  "entities": [
    [
      "NORP",
      "brahman"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Master Gotama"
    ],
    [
      "NORP",
      "Nigantha"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika 's monastery. There he said to the monks: \"Monks, if wanderers who are members of other sects should ask you, ' What , friend, are the prerequisites for the development of the wings to self-awakening?' how would you answer them?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika 's monastery"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ],
    [
      "NORP",
      "wanderers"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Rajagaha in the Bamboo Grove, the Squirrels' Sanctuary. Now, on that occasion Ven. Sariputta was wandering in the Southern Mountains with a large community of monks. Then a certain monk who had spent the Rains in Rajagaha went to the Southern Mountains, to Ven. Sariputta. On arrival, he exchanged courteous greetings with Ven. Sariputta and — after an exchange of friendly greetings & courtesies — sat to one side. As he was sitting there, Ven. Sariputta said to him, \"I trust, friend, that the Blessed One is strong & free from illness?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Rajagaha"
    ],
    [
      "LOC",
      "Bamboo Grove"
    ],
    [
      "PERSON",
      "Ven. Sariputta"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "GPE",
      "Rajagaha"
    ],
    [
      "PERSON",
      "Ven. Sariputta"
    ],
    [
      "PERSON",
      "Ven. Sariputta"
    ],
    [
      "PERSON",
      "Ven. Sariputta"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "Thus have I heard: At one time the Exalted One was staying near Savatthi at the Eastern monastery in the mansion (given by) Migara 's mother. Then Visakha , [1] Migara's mother, approached the Exalted One; having approached and bowed down she sat down in a suitable place. When she was seated the Exalted One spoke thus to Visakha, Migara's Mother:",
  "entities": [
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "at"
    ],
    [
      "LOC",
      "Eastern monastery"
    ],
    [
      "PERSON",
      "Visakha"
    ],
    [
      "PERSON",
      "Visakha"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying among the Sakyans at Kapilavatthu in the Banyan Park. Now at that time a new reception hall [1] had just been built by the Kapilavatthu Sakyans, and it had not yet been dwelled in by any contemplative, brahman, or anyone at all in human form. So the Kapilavatthu Sakyans went to the Blessed One and, on arrival, having bowed down, sat to one side. As they were sitting there they said to him, \"Lord, a new reception hall has just been built by the Kapilavatthu Sakyans, and it has not yet been dwelled in by any contemplative, brahman, or anyone at all in human form. May the Blessed One be the first to use it. When the Blessed One has used it first, the Kapilavatthu Sakyans will use it afterwards. That will be for their long-term welfare & happiness.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Sakyans"
    ],
    [
      "GPE",
      "Kapilavatthu"
    ],
    [
      "LOC",
      "Banyan Park"
    ],
    [
      "NORP",
      "Sakyans"
    ],
    [
      "NORP",
      "brahman"
    ],
    [
      "NORP",
      "Sakyans"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Sakyans"
    ],
    [
      "NORP",
      "brahman"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Sakyans"
    ]
  ]
}
{
  "text": "Then Ven. Sariputta addressed the monks: \"Friend monks.\"",
  "entities": [
    [
      "PERSON",
      "Ven. Sariputta"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "monks"
    ]
  ]
}
{
  "text": "\"Endowed with five qualities, a king's elephant is worthy of a king, is a king's asset, counts as a very limb of his king. Which five? There is the case where a king's elephant is a listener, a destroyer, a protector, an endurer, and a goer.",
  "entities": [
    [
      "PERSON",
      "king. Which"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying at Savatthi , in Jeta's Grove, Anathapindika's Monastery . Then the Blessed One, early in the morning, put on his robes and, carrying his bowl and outer robe, went into Savatthi for alms. And Ven. Rahula, early in the morning, put on his robes and, carrying his bowl and outer robe, went into Savatthi for alms following right behind the Blessed One. [1] Then the Blessed One, looking back at Rahula, addressed him: \"Rahula, any form whatsoever that is past, future, or present; internal or external; blatant or subtle; common or sublime; far or near: every form is to be seen as it actually is with right discernment as: 'This is not mine. This is not my self. This is not what I am.'\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's Monastery"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "PERSON",
      "Ven. Rahula"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "I have heard that on one occasion, as the Blessed One was wandering among the Magadhans , he entered Rajagaha , went to the potter Bhaggava , and on arrival said to him, \"If it is no inconvenience for you, Bhaggava, I will stay for one night in your shed.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Magadhans"
    ],
    [
      "GPE",
      "Rajagaha"
    ],
    [
      "PERSON",
      "Bhaggava"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Rājagaha at the Bamboo Grove in the Squirrels' sanctuary. And on that occasion Ven. Samiddhi was staying in a wilderness hut. Then Potaliputta the wanderer, while walking & wandering around to exercise his legs, went to Ven. Samiddhi and exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to Ven. Samiddhi, \"Face to face with Gotama the contemplative have I heard this, face to face have I learned this: 'Bodily action is barren, verbal action is barren, only mental action is true. And there is an attainment in which, on being attained, nothing is felt.'\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Rājagaha"
    ],
    [
      "LOC",
      "Bamboo Grove"
    ],
    [
      "PERSON",
      "Ven. Samiddhi"
    ],
    [
      "PERSON",
      "Ven. Samiddhi"
    ],
    [
      "PERSON",
      "Ven. Samiddhi"
    ],
    [
      "PERSON",
      "Gotama"
    ]
  ]
}
{
  "text": "\"Monks, for one whose awareness-release through good will is cultivated, developed, pursued, handed the reins and taken as a basis, given a grounding, steadied, consolidated, and well-undertaken, eleven benefits can be expected. Which eleven?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, I will teach you the nine step-by-step dwelling-attainments. Listen & pay close attention. I will speak.\"",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One, on a wandering tour among the Kosalans with a large community of monks, arrived at a Kosalan brahman village named Icchanangala. There he stayed in the Icchanangala forest grove.",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Kosalans"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Kosalan"
    ],
    [
      "NORP",
      "brahman"
    ],
    [
      "NORP",
      "Icchanangala"
    ],
    [
      "NORP",
      "Icchanangala"
    ]
  ]
}
{
  "text": "\"Monks, the taking of life — when indulged in, developed, & pursued — is something that leads to hell, leads to rebirth as a common animal, leads to the realm of the hungry shades. The slightest of all the results coming from the taking of life is that, when one becomes a human being, it leads to a short life span.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Savatthi at Jeta's Grove, Anathapindika's monastery. And at that time in King Pasenadi's realm there was a bandit named Angulimala: brutal, bloody-handed, devoted to killing & slaying, showing no mercy to living beings. He turned villages into non-villages, towns into non-towns, settled countryside into unsettled countryside. Having repeatedly killed human beings, he wore a garland (mala) made of fingers (anguli).",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's monastery"
    ],
    [
      "PERSON",
      "King Pasenadi"
    ],
    [
      "PERSON",
      "Angulimala"
    ]
  ]
}
{
  "text": "Then Janussonin the brahman went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there he said to the Blessed One: \"I am of the view & opinion that there is no one who, subject to death, is not afraid or in terror of death.\"",
  "entities": [
    [
      "NORP",
      "brahman"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "On one occasion the Blessed One was staying near Varanasi in the Deer Park at Isipatana . There he addressed the monks: \"Monks!\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Varanasi"
    ],
    [
      "LOC",
      "Deer Park at Isipatana"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying in Rajagaha , on Vulture Peak Mountain. There he addressed the monks: \"Monks, I will teach you the seven conditions that lead to no decline. Listen & pay close attention. I will speak.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Rajagaha"
    ],
    [
      "LOC",
      "Vulture Peak Mountain"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, there are these eight rewards of merit, rewards of skillfulness, nourishments of happiness, celestial, resulting in happiness, leading to heaven, leading to what is desirable, pleasurable, & appealing, to welfare & happiness. Which eight?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, these four are ignoble searches. Which four? There is the case where a person, being subject himself to aging, seeks [happiness in] what is subject to aging. Being subject himself to illness, he seeks [happiness in] what is subject to illness. Being subject himself to death, he seeks [happiness in] what is subject to death. Being subject himself to defilement, he seeks [happiness in] what is subject to defilement. These are four ignoble searches.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, there are these four perversions of perception, perversions of mind, perversions of view. Which four? 'Constant' with regard to the inconstant is a perversion of perception, a perversion of mind, a perversion of view. 'Pleasant' with regard to the stressful... 'Self' with regard to not-self... 'Attractive' with regard to the unattractive is a perversion of perception, a perversion of mind, a perversion of view. These are the four perversions of perception, perversions of mind, perversions of view.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "On one occasion the Blessed One was staying near Sāvatthī in Jeta's Grove, Anāthapiṇḍika's monastery. Then Anāthapiṇḍika the householder went to the Blessed One and, on arrival, bowed down to him and sat to one side. As he was sitting there, the Blessed One said to him, \"Householder, are gifts still given in your family?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Sāvatthī"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anāthapiṇḍika's monastery"
    ],
    [
      "PERSON",
      "Anāthapiṇḍika"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "On one occasion the Blessed One was staying at Savatthi , in Jeta's Grove, Anathapindika's Monastery. There he addressed the monks, \"Monks!\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's Monastery"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was dwelling among the Koliyans . Now the Koliyans have a town named Kakkarapatta . There Dighajanu [1] the Koliyan went to the Blessed One and, on arrival, having bowed down to the Blessed One, sat to one side. As he was sitting there he said to the Blessed One, \"We are lay people enjoying sensuality; living crowded with spouses & children; using Kasi fabrics & sandalwood; wearing garlands, scents, & creams; handling gold & silver. May the Blessed One teach the Dhamma for those like us, for our happiness & well-being in this life, for our happiness & well-being in lives to come.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Koliyans"
    ],
    [
      "NORP",
      "Koliyans"
    ],
    [
      "NORP",
      "Koliyan"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "\"Endowed with eight qualities, a king's auspicious thoroughbred steed is worthy of a king, is a king's asset, counts as a very limb of his king. Which eight?",
  "entities": [
    [
      "PERSON",
      "king. Which"
    ]
  ]
}
{
  "text": "On one occasion the Blessed One was wandering on a tour among the Kosalans with a large community of monks. As he was going along a road, he saw a large sala forest in a certain place. Going down from the road, he went to the sala forest. On reaching it , he plunged into it and at a certain spot, broke into a smile. Then the thought occurred to Ven. Ananda , \"What is the cause, what is the reason, for the Blessed One's breaking into a smile? It's not without purpose that Tathagata's break into smile.\" So he said to the Blessed One, \"What is the cause, what is the reason, for the Blessed One's breaking into a smile? It's not without purpose that Tathagata's break into smile.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Kosalans"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "PERSON",
      "Ven. Ananda"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Tathagata"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Tathagata"
    ]
  ]
}
{
  "text": "On one occasion Ven. Maha Kaccana was staying at Madhura in the Gunda Forest. Then Kandarayana the brahman went to Ven. Maha Kaccana and on arrival exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to Ven. Maha Kaccana, \"I have heard it said, Master Kaccana, that, 'Kaccana the contemplative does not raise his hands in respect to aged, venerable brahmans — advanced in years, come to the last stage of life — nor does he rise up to greet them, nor does he offer them a seat.' Insofar as you don't raise your hands in respect to aged, venerable brahmans — advanced in years, come to the last stage of life — nor rise up to greet them, nor offer them a seat, that is simply not right, Master Kaccana.\"",
  "entities": [
    [
      "PERSON",
      "Ven. Maha Kaccana"
    ],
    [
      "NORP",
      "brahman"
    ],
    [
      "PERSON",
      "Ven. Maha Kaccana"
    ],
    [
      "PERSON",
      "Ven. Maha Kaccana"
    ],
    [
      "PERSON",
      "Master Kaccana"
    ],
    [
      "NORP",
      "brahmans"
    ],
    [
      "NORP",
      "brahmans"
    ],
    [
      "PERSON",
      "Master Kaccana"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying among the Sakyans at Kapilavatthu in the Banyan Park. Then in the early morning, the Blessed One, having put on his robes and carrying his bowl and outer robe, went into Kapilavatthu for alms. Having gone for alms in Kapilavatthu, after the meal, returning from his alms round, he went to the dwelling of Kala-khemaka the Sakyan for the day's abiding. Now at that time many resting places had been prepared in Kala-khemaka the Sakyan's dwelling. The Blessed One saw the many resting places prepared there and, on seeing them, the thought occurred to him, \"There are many resting places prepared here. Do many monks live here?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Sakyans"
    ],
    [
      "GPE",
      "Kapilavatthu"
    ],
    [
      "LOC",
      "Banyan Park"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Kapilavatthu"
    ],
    [
      "GPE",
      "Kapilavatthu"
    ],
    [
      "NORP",
      "Sakyan"
    ],
    [
      "NORP",
      "Sakyan"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "monks"
    ]
  ]
}
{
  "text": "...\" Monks , live with yourself as your island, yourself as your refuge, with nothing else as your refuge. Live with the Dhamma as your island, the Dhamma as your refuge, with nothing else as your refuge. [1] And how does a monk live with himself as his island, himself as his refuge, with nothing else as his refuge; with the Dhamma as his island, the Dhamma as his refuge, with nothing else as his refuge? There is the case where a monk remains focused on the body in & of itself — ardent, alert, & mindful — putting aside greed & distress with reference to the world. He remains focused on feelings in & of themselves... mind in & of itself... mental qualities in & of themselves — ardent, alert, & mindful — putting aside greed & distress with reference to the world. This is how a monk lives with himself as his island, himself as his refuge, with nothing else as his refuge; with the Dhamma as his island, the Dhamma as his refuge, with nothing else as his refuge.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, doctors give a purgative for warding off diseases caused by bile, diseases caused by phlegm, diseases caused by the internal wind property. There is a purging there; I don't say that there's not, but it sometimes succeeds and sometimes fails. So I will teach you the noble purgative that always succeeds and never fails, a purgative whereby beings subject to birth are freed from birth; beings subject to aging are freed from aging; beings subject to death are freed from death; beings subject to sorrow, lamentation, pain, distress & despair are freed from sorrow, lamentation, pain, distress & despair. Listen & pay close attention. I will speak.\"",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, there are these nine step-by-step dwellings. Which nine? The first jhāna, the second jhāna, the third jhāna, the fourth jhāna, the dimension of the infinitude of space, the dimension of the infinitude of consciousness, the dimension of nothingness, the dimension of neither perception nor non-perception, the cessation of perception & feeling. These are the nine step-by-step dwellings.\" [1]",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "On one occasion Ven. Ananda was staying in Kosambi , at Ghosita's monastery . There he addressed the monks, \"Friends!\"",
  "entities": [
    [
      "PERSON",
      "Ven. Ananda"
    ],
    [
      "GPE",
      "Kosambi"
    ],
    [
      "LOC",
      "Ghosita's monastery"
    ],
    [
      "NORP",
      "monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery. There he addressed the monks, \"Monks!\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's monastery"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, there are these five hindrances. Which five? Sensual desire as a hindrance, ill will as a hindrance, sloth & drowsiness as a hindrance, restlessness & anxiety as a hindrance, and uncertainty as a hindrance. These are the five hindrances.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, these four traits may be known by means of four [other] traits. Which four?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, these five future dangers, unarisen at present, will arise in the future. Be alert to them and, being alert, work to get rid of them. Which five?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery. There he addressed the monks: \"Monks!\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's monastery"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"These four types of individuals are to be found existing in the world. Which four? The individual who goes with the flow, the individual who goes against the flow, the individual who stands fast, and the one who has crossed over, gone beyond, who stands on firm ground: a brahman.",
  "entities": [
    [
      "NORP",
      "brahman"
    ]
  ]
}
{
  "text": "\"Monks, there are these seven obsessions. [1] Which seven?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, seven types of individuals are to be found existing in the world. Which seven?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, there are these two assemblies. Which two? The assembly trained in bombast and not in cross-questioning, and the assembly trained in cross-questioning and not in bombast.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "When endowed with five qualities, monks, in no long time a monk penetrates and intuits [1] the Unshakeable. [2] Which five? Here, monks, a monk is one who has attained discrimination [3] of meanings, [4] is one who has attained discrimination of principles, [5] is one who as attained discrimination of language, [6] is one who has attained discrimination of the illuminating qualities (of knowledge), [7] and he reflects upon the mind as liberated. [8] When endowed with these five qualities, monks, a monk in no long time penetrates and intuits the Unshakeable.",
  "entities": [
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Savatthi at Jeta's Grove, Anathapindika's monastery. Then, early in the morning, several monks put on their robes and, carrying their bowls and outer robes, went into Savatthi for alms. The thought occurred to them, \"It's still too early to go into Savatthi for alms. What if we were to visit the park of the wanderers of other persuasions?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's monastery"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "NORP",
      "wanderers"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying at Savatthi , in Jeta's Grove, Anathapindika's Monastery. Then, as he was alone in seclusion, this line of thinking arose in the Blessed One's awareness: \"The mental qualities that ripen in release have ripened in Rahula. What if I were to lead Rahula further to the ending of the mental fermentations?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's Monastery"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "\"From wrongness comes failure, not success. And how is it, monks, that from wrongness comes failure, not success?",
  "entities": [
    [
      "NORP",
      "monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying at Varanasi in the Game Refuge at Isipatana . Then early in the morning the Blessed One, having put on his robes and carrying his bowl & outer robe, went into Varanasi for alms. As he was walking for alms near the fig-tree at the cattle yoke, he saw a certain monk whose delight was in what is empty, whose delight was in exterior things, his mindfulness muddled, his alertness lacking, his concentration lacking, his mind gone astray, his faculties uncontrolled. On seeing him, the Blessed One said to him: \"Monk, monk, don't let yourself putrefy! On one who lets himself putrefy & stink with the stench of carrion, there's no way that flies won't swarm & attack!\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Varanasi"
    ],
    [
      "LOC",
      "Game Refuge"
    ],
    [
      "GPE",
      "Isipatana"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Varanasi"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Rajagaha , at the Bamboo Grove, the Squirrels' Feeding Ground.",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Rajagaha"
    ],
    [
      "LOC",
      "Bamboo Grove"
    ]
  ]
}
{
  "text": "I have heard that at one time the Blessed One was staying at Nadika , in the Brick Hall. There he addressed the monks, \"Monks, mindfulness of death — when developed & pursued — is of great fruit & great benefit. It gains a footing in the Deathless, has the Deathless as its final end. And how is mindfulness of death developed & pursued so that it is of great fruit & great benefit, gains a footing in the Deathless, and has the Deathless as its final end?",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "Then Ven. Upali went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the Blessed One: \"It would be good, lord, if the Blessed One would teach me the Dhamma in brief such that, having heard the Dhamma from the Blessed One, I might dwell alone, secluded, heedful, ardent, & resolute.\"",
  "entities": [
    [
      "PERSON",
      "Ven. Upali"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": ". I heard thus. Once the Blessed One, while wandering in the Kosala country with a large community of bhikkhus, entered a town of the Kalama people called Kesaputta . The Kalamas who were inhabitants of Kesaputta: \"Reverend Gotama, the monk, the son of the Sakyans, has, while wandering in the Kosala country, entered Kesaputta. The good repute of the Reverend Gotama has been spread in this way: Indeed, the Blessed One is thus consummate, fully enlightened, endowed with knowledge and practice, sublime, knower of the worlds, peerless, guide of tamable men, teacher of divine and human beings, which he by himself has through direct knowledge understood clearly. He set forth the Dhamma, good in the beginning, good in the middle, good in the end, possessed of meaning and the letter, and complete in everything; and he proclaims the holy life that is perfectly pure. Seeing such consummate ones is good indeed.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Kosala"
    ],
    [
      "NORP",
      "bhikkhus"
    ],
    [
      "PERSON",
      "Gotama"
    ],
    [
      "NORP",
      "Sakyans"
    ],
    [
      "GPE",
      "Kosala"
    ],
    [
      "PERSON",
      "entered Kesaputta"
    ],
    [
      "PERSON",
      "Gotama"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery . Now on that occasion Potthapada the wanderer , together with a large following of about 300 wanderers, had taken up residence in the debating hall near the Tinduka tree in the single-pavilion park of Queen Mallika . Then the Blessed One, early in the morning, taking his robes & bowl, entered Savatthi for alms. Then the thought occurred to him, \"While it's still too early to go into Savatthi for alms, why don't I go to the debating hall near the Tinduka tree in the single-pavilion park of Queen Mallika to see Potthapada the wanderer?\" So he went to the debating hall near the Tinduka tree in the single-pavilion park of Queen Mallika.",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's monastery"
    ],
    [
      "NORP",
      "wanderers"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "GPE",
      "Savatthi"
    ]
  ]
}
{
  "text": "I have heard that on one occasion, while the Blessed One was on a wandering tour among the Kosalans with a large community of monks, he arrived at Salavatika .",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Kosalans"
    ],
    [
      "NORP",
      "monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying at Ukkattha , in the shade of a royal Sal tree in the Very Blessed Grove. There he addressed the monks, \"Monks!\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Rajagaha in the Bamboo Grove, the Squirrels' Sanctuary.",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Rajagaha"
    ],
    [
      "LOC",
      "Bamboo Grove"
    ]
  ]
}
{
  "text": "Once the Blessed One was staying among the Bhaggas in the Deer Park at Bhesakala Grove, near Crocodile Haunt . At that time, Nakula's father , the householder, was diseased, in pain, severely ill. Then Nakula's mother said to him: \"Don't be worried as you die, householder. Death is painful for one who is worried. The Blessed One has criticized being worried at the time of death.",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Bhaggas"
    ],
    [
      "LOC",
      "Deer Park"
    ],
    [
      "LOC",
      "Bhesakala Grove"
    ],
    [
      "LOC",
      "Crocodile Haunt"
    ],
    [
      "PERSON",
      "Nakula"
    ],
    [
      "PERSON",
      "Nakula"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "Thus have I heard. At one time the Blessed One was staying at Savatthi, in Jeta's Grove, Anathapindika's Pleasance. The Blessed One addressed the bhikkhus, saying, \"Bhikkhus,\" and they replied to him saying, \"Reverend Sir.\" The Blessed One spoke as follows:",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "PERSON",
      "Anathapindika"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "bhikkhus"
    ],
    [
      "NORP",
      "Bhikkhus"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "\"Monks, I have known two qualities through experience: discontent with regard to skillful qualities [1] and unrelenting exertion. Relentlessly I exerted myself, [thinking,] 'Gladly would I let the flesh & blood in my body dry up, leaving just the skin, tendons, & bones, but if I have not attained what can be reached through human firmness, human persistence, human striving, there will be no relaxing my persistence.' From this heedfulness of mine was attained Awakening. From this heedfulness of mine was attained the unexcelled freedom from bondage.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Last night, monks, a certain devata in the far extreme of the night, her extreme radiance lighting up the entirety of Jeta's Grove, came to me and, on arrival, bowed down to me and stood to one side. As she was standing there, she said to me, 'These seven qualities, lord, lead to a monk's non-decline. Which seven? Respect for the teacher, respect for the Dhamma, respect for the Sangha, respect for training, respect for concentration, respect for shame, respect for compunction. These seven qualities, lord, lead to a monk's non-decline.'",
  "entities": [
    [
      "NORP",
      "monks"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying among the Sakyans at Kapilavatthu in the Banyan Park. Then Mahanama the Sakyan [1] went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the Blessed One, \"For a long time now, lord, I have understood the Dhamma taught by the Blessed One thus: 'Greed is a defilement of the mind; aversion is a defilement of the mind; delusion is a defilement of the mind.' Yet even though I understand the Dhamma taught by the Blessed One that greed is a defilement of the mind, aversion is a defilement of the mind, delusion is a defilement of the mind, there are still times when the mental quality of greed invades my mind and remains, when the mental quality of aversion... the mental quality of delusion invades my mind and remains. The thought occurs to me: What mental quality is unabandoned within me so that there are times when the mental quality of greed invades my mind and remains, when the mental quality of aversion... the mental quality of delusion invades my mind and remains?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Sakyans"
    ],
    [
      "GPE",
      "Kapilavatthu"
    ],
    [
      "LOC",
      "Banyan Park"
    ],
    [
      "NORP",
      "Sakyan"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "Thus I heard. On one occasion the venerable Nandaka was living at Savatthi in the Eastern Monastery, Migara 's Mother's Palace. Then Migara 's grandson, Salha , and Pekhuniya 's grandson, Rohana , went to the venerable Nandaka, and after salutation they sat down at one side. When they had done so the venerable Nandaka said to Migara's grandson Salha:",
  "entities": [
    [
      "PERSON",
      "venerable Nandaka"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Eastern Monastery"
    ],
    [
      "PERSON",
      "venerable Nandaka"
    ],
    [
      "PERSON",
      "venerable Nandaka"
    ]
  ]
}
{
  "text": "Then Ven. Ananda went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there, he said to the Blessed One, \"Lord, could a monk have an attainment of concentration such that he would neither be percipient of earth with regard to earth, nor of water with regard to water, nor of fire... wind... the dimension of the infinitude of space... the dimension of the infinitude of consciousness... the dimension of nothingness... the dimension of neither perception nor non-perception... this world... nor of the next world with regard to the next world, and yet he would still be percipient?\"",
  "entities": [
    [
      "PERSON",
      "Ven. Ananda"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "I have heard that at one time the Blessed One was staying at Nadika , in the Brick Hall. There he addressed the monks, \"Monks!\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": ". Thus have I heard. Once the Blessed One was staying at Savatthi , in Jeta's Grove, Anathapindika 's monastery. There he addressed the monks thus: \"Monks.\" — \"Venerable sir,\" they replied. The Blessed One said this:",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika 's monastery"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "\"Monks, these two are fools. Which two? The one who doesn't see his transgression as a transgression, and the one who doesn't rightfully pardon another who has confessed his transgression. These two are fools.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Vesali in the Great Forest, at the Peaked Pavilion. Now at that time a large number of monks had declared final gnosis in the Blessed One's presence: \"We discern that 'Birth is ended, the holy life fulfilled, the task done. There is nothing further for the sake of this world.'\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "near"
    ],
    [
      "GPE",
      "Vesali"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "On one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery. And on that occasion the lay woman Velukandaki, Nanda's mother, had established a donation endowed with six factors for the community of monks headed by Sariputta & Moggallana. The Blessed One saw with his divine eye, surpassing the human, that the laywoman Velukandaki, Nanda's mother, had established a donation endowed with six factors for the community of monks headed by Sariputta & Moggallana. On seeing this, he addressed the monks: \"Monks, the lay woman Velukandaki, Nanda's mother, has established a donation endowed with six factors for the community of monks headed by Sariputta & Moggallana.",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's monastery"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "PERSON",
      "Sariputta"
    ],
    [
      "PERSON",
      "Moggallana"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "PERSON",
      "Sariputta"
    ],
    [
      "PERSON",
      "Moggallana"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "PERSON",
      "Sariputta"
    ],
    [
      "PERSON",
      "Moggallana"
    ]
  ]
}
{
  "text": "\"Monks, a person endowed with these four qualities can be known as 'a person of no integrity.' Which four?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying at Savatthi , in Jeta's Grove, Anathapindika's monastery . Then early in the morning, having put on his robes and carrying his bowl & outer robe, he went into Savatthi for alms. Then a large number of monks went to Ven. Ananda and said, \"It has been a long time, friend Ananda, since we have heard a Dhamma talk in the Blessed One's presence. It would be good if we could get to hear a Dhamma talk in the Blessed One's presence.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's monastery"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "PERSON",
      "Ven. Ananda"
    ],
    [
      "PERSON",
      "Ananda"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "\"Monks, a lay follower should not engage in five types of business. Which five? Business in weapons, business in human beings, business in meat, business in intoxicants, and business in poison.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "Then a certain brahman approached the Blessed One. Having approached the Blessed One, he exchanged friendly greetings. After pleasant conversation had passed between them, he sat to one side. Having sat to one side, the brahman spoke to the Blessed One thus:",
  "entities": [
    [
      "NORP",
      "brahman"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "brahman"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "Then Ven. Ananda went to the Blessed One and, on arrival, bowed down to him and sat to one side. As he was sitting there he said to the Blessed One, \"Lord, this word, 'becoming, becoming' — to what extent is there becoming?\" [1]",
  "entities": [
    [
      "PERSON",
      "Ven. Ananda"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "I have heard that on one occasion Ven. Ananda was staying near Vesali at Veluvagamaka. Now on that occasion Dasama the householder from Atthakanagara had arrived at Pataliputta on some business. Then he went to a certain monk at Kukkata Monastery and on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the monk, \"Where is Ven. Ananda staying now? I'd like to see him.\"",
  "entities": [
    [
      "PERSON",
      "Ven. Ananda"
    ],
    [
      "GPE",
      "Vesali"
    ],
    [
      "GPE",
      "Veluvagamaka"
    ],
    [
      "PERSON",
      "Dasama"
    ],
    [
      "GPE",
      "Atthakanagara"
    ],
    [
      "GPE",
      "Pataliputta"
    ],
    [
      "LOC",
      "Kukkata Monastery"
    ],
    [
      "PERSON",
      "Ven. Ananda"
    ]
  ]
}
{
  "text": "Then Ugga , the king's chief minister, approached the Blessed One and, on arrival, having bowed down, sat to one side. As he was sitting there, he said to the Blessed One: \"It's amazing, lord, & awesome, how prosperous Migara Rohaneyya is, how great his treasures, how great his resources!\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Savatthi in the Eastern Monastery, the palace of Migara's mother . And on that occasion — the uposatha of the fifteenth, the night of a very full moon — he was sitting out in the open with the community of monks. Then, having surveyed the silent community of monks, he addressed them: \"Monks, could a person of no integrity know of a person of no integrity: 'This is a person of no integrity'?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Eastern Monastery"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, these eight worldly conditions spin after the world, and the world spins after these eight worldly conditions. Which eight? Gain, loss, status, disgrace, censure, praise, pleasure, & pain. These are the eight worldly conditions that spin after the world, and the world spins after these eight worldly conditions.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, these two slander the Tathagata. Which two? He who explains a discourse whose meaning needs to be inferred as one whose meaning has already been fully drawn out. And he who explains a discourse whose meaning has already been fully drawn out as one whose meaning needs to be inferred. These are two who slander the Tathagata.\"",
  "entities": [
    [
      "NORP",
      "Monks"
    ],
    [
      "PERSON",
      "Tathagata"
    ],
    [
      "PERSON",
      "Tathagata"
    ]
  ]
}
{
  "text": ". Thus have I heard. Once the Blessed One was staying at Savatthi , in Jeta's Grove, Anathapindika 's monastery.",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika 's monastery"
    ]
  ]
}
{
  "text": "\"Monks, these two people are hard to find in the world. Which two? The one who is first to do a kindness, and the one who is grateful for a kindness done and feels obligated to repay it. These two people are hard to find in the world.\"",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying among the Udaññans , in the Deer Park at Kannakatthala. And at that time King Pasenadi Kosala had arrived at Udañña on some business or other. So King Pasenadi Kosala said to one of his men, \"Come, my good man. Go to the Blessed One and, on arrival, showing reverence with your head to his feet in my name, ask whether he is free from illness & affliction, is carefree, strong, & living in comfort, saying: 'King Pasenadi Kosala, lord, shows reverence with his head to your feet and asks whether you are free from illness & affliction, are carefree, strong, & living in comfort.' And then say: 'Lord, today King Pasenadi Kosala will come to see the Blessed One after his morning meal.'\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "LOC",
      "Deer Park"
    ],
    [
      "PERSON",
      "King Pasenadi Kosala"
    ],
    [
      "PERSON",
      "King Pasenadi Kosala"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "King Pasenadi Kosala"
    ],
    [
      "PERSON",
      "King Pasenadi Kosala"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Savatthi at Jeta's Grove, Anathapindika 's monastery. Now at that time a certain householder's dear & beloved little son, his only child, had died. Because of his death, the father had no desire to work or to eat. He kept going to the cemetery and crying out, \"Where have you gone, my only little child? Where have you gone, my only little child?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika 's monastery"
    ]
  ]
}
{
  "text": "\"Monks, there are these six rewards in realizing the fruit of stream-entry. Which six? One is certain of the true Dhamma. One is not subject to falling back. There is no suffering over what has had a limit placed on it. [1] One is endowed with uncommon knowledge. [2] One rightly sees cause, along with causally-originated phenomena.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, there are these four obscurations of the sun and moon, obscured by which the sun and moon don't glow, don't shine, don't dazzle. Which four?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "These four traditions of the Noble Ones — original, long-standing, traditional, ancient, unadulterated, unadulterated from the beginning — are not open to suspicion, will never be open to suspicion, and are unfaulted by knowledgeable contemplatives and brahmans. Which four?",
  "entities": [
    [
      "NORP",
      "Noble Ones"
    ],
    [
      "NORP",
      "brahmans"
    ]
  ]
}
{
  "text": "Thus have I heard. Once the Blessed One lived at Saavatthii, in Jeta's Grove, in Anaathapindika's monastery.",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Saavatthii"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anaathapindika's monastery"
    ]
  ]
}
{
  "text": "Then Anathapindika the householder went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there the Blessed One said to him: \"There are these five benefits that can be obtained from wealth. Which five?",
  "entities": [
    [
      "PERSON",
      "Anathapindika"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "I have heard that at one time the Blessed One was staying in Savatthi at Jeta's Grove, Anathapindika's monastery. There he addressed the monks, saying, \"Monks.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's monastery"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, these five future dangers, unarisen at present, will arise in the future. Be alert to them and, being alert, work to get rid of them. Which five?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery. Now at that time, Janussonin the brahman was driving out of Savatthi in the middle of the day in a totally white roofed-chariot. [1] He saw Pilotika the wanderer coming from afar and, on seeing him, said to him, \"Now where is Master Vacchayana [2] coming from in the middle of the day?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's monastery"
    ],
    [
      "NORP",
      "brahman"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "PERSON",
      "Master Vacchayana"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying among the Anguttarapans at an Anguttarapan town named Apana . Then, early in the morning, having put on his robes and carrying his outer robe & bowl, went into Apana for alms. Having wandered for alms in Apana and returning from his alms round after his meal, he went to a certain forest grove for the day's abiding. Plunging into the grove, he sat down for his day's abiding at the root of a certain tree.",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery. Then Ven. Sariputta addressed the monks, \"Friends!\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's monastery"
    ],
    [
      "PERSON",
      "Ven. Sariputta"
    ],
    [
      "NORP",
      "monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying among the Sakyans at Kapilavatthu in the Banyan Park . Now at that time the Blessed One had just recovered from being ill, was not long recovered from his illness. Then Mahanama the Sakyan went to the Blessed One and, on arrival, having bowed down, sat to one side. As he was sitting there he said to the Blessed One: \"For a long time I have known the Dhamma taught by the Blessed One that 'There is knowledge for one who is concentrated, not for one who is not concentrated.' Now, does concentration come first, and knowledge after, or does knowledge come first, and concentration after?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Sakyans"
    ],
    [
      "GPE",
      "Kapilavatthu"
    ],
    [
      "LOC",
      "Banyan Park"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Sakyan"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "\"Monks, these nine perceptions, when developed & pursued, are of great fruit, of great benefit. They gain a footing in the deathless and have the deathless as their final end. Which nine?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One, on a wandering tour among the Kosalans with a large community of monks, arrived at a Kosalan brahman village named Icchanangala . There he stayed in the Icchanangala forest grove.",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Kosalans"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Kosalan"
    ],
    [
      "NORP",
      "brahman"
    ],
    [
      "NORP",
      "Icchanangala"
    ],
    [
      "NORP",
      "Icchanangala"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying among the Vajjians at Bhanda Village. There he addressed the monks, \"Monks!\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Vajjians"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"There are these five inhabitants of the states of deprivation, inhabitants of hell, who are in agony & incurable. Which five? One who has killed his/her mother, one who has killed his/her father, one who has killed an arahant, one who — with a corrupted mind — has caused the blood of a Tathagata to flow, and one who has caused a split in the Sangha. These are the five inhabitants of the states of deprivation, inhabitants of hell, who are in agony & incurable.\"",
  "entities": [
    [
      "PERSON",
      "Tathagata"
    ]
  ]
}
{
  "text": "Then Ven. Ananda went to the Blessed One and, on arrival, bowed down to him and sat to one side. As he was sitting there he said to the Blessed One, \"Lord, this word, 'becoming, becoming' — to what extent is there becoming?\" [1]",
  "entities": [
    [
      "PERSON",
      "Ven. Ananda"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "\"Monks, if those who have gone forth in other sects ask you, 'In what are all phenomena rooted? What is their coming into play? What is their origination? What is their meeting place? What is their presiding state? What is their governing principle? What is their surpassing state? What is their heartwood? Where do they gain a footing? What is their final end?': On being asked this by those who have gone forth in other sects, how would you answer?\"",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "On one occasion the Blessed One was staying near Vesali at Gotamaka Shrine. There he addressed the monks, \"Monks!\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Vesali"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One, on a wandering tour among the Kosalans with a large community of monks, arrived at Kesaputta , a town of the Kalamas . The Kalamas of Kesaputta heard it said, \"Gotama the contemplative — the son of the Sakyans, having gone forth from the Sakyan clan — has arrived at Kesaputta. And of that Master Gotama this fine reputation has spread: 'He is indeed a Blessed One, worthy, & rightly self-awakened, consummate in knowledge & conduct, well-gone, a knower of the cosmos, an unexcelled trainer of those persons ready to be tamed, teacher of human & divine beings, awakened, blessed. He has made known — having realized it through direct knowledge — this world with its devas, maras, & brahmas, its generations with their contemplatives & brahmans, their rulers & common people; has explained the Dhamma admirable in the beginning, admirable in the middle, admirable in the end; has expounded the holy life both in its particulars & in its essence, entirely perfect, surpassingly pure. It is good to see such a worthy one.'\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Kosalans"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "PERSON",
      "Gotama"
    ],
    [
      "NORP",
      "Sakyans"
    ],
    [
      "NORP",
      "Sakyan"
    ],
    [
      "PERSON",
      "Master Gotama"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "brahmans"
    ]
  ]
}
{
  "text": "\"Monks, there are these two conditions for the arising of wrong view. Which two? The voice of another [1] and inappropriate attention. These are the two conditions for the arising of wrong view.\"",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, I shall point out the nearest shore and the farthest shore. [1] Hear this, and thoroughly attend to it in mind. I shall speak.\"",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "... Now at that time the Blessed One was sitting & exchanging courtesies & conversation with some very senior brahmans. It so happened that a brahman student named Kapadika was seated in the assembly: young, shaven-headed, sixteen years old, a master of the Three Vedas with their vocabularies, liturgy, phonology, & etymologies, and the histories as a fifth; skilled in philology & grammar, well-versed in cosmology & the marks of a great man. While the very senior brahmans were conversing with the Blessed One, he kept breaking in & interrupting their talk. So the Blessed One scolded him, \"Venerable Bharadvaja, don't break in & interrupt while the very senior brahmans are conversing. Wait until they are finished talking.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "brahmans"
    ],
    [
      "NORP",
      "brahman"
    ],
    [
      "PERSON",
      "Kapadika"
    ],
    [
      "NORP",
      "brahmans"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Venerable Bharadvaja"
    ],
    [
      "NORP",
      "brahmans"
    ]
  ]
}
{
  "text": "[ Udayin :] \"'Bodily witness, bodily witness,' it is said. To what extent is one described by the Blessed One as a bodily witness?\"",
  "entities": [
    [
      "PERSON",
      "Udayin"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "\"Monks, these six properties are means of escape. Which six?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\" Monks , the great sal trees that live in dependence on the Himalayas , the king of mountains, prosper in terms of three kinds of prosperity. Which three? They prosper in terms of branches, leaves, & foliage. They prosper in terms of bark & shoots. They prosper in terms of softwood and heartwood. The great sal trees that grow in dependence on the Himalayas, the king of mountains, prosper in terms of these three kinds of prosperity.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "Then Anathapindika the householder, surrounded by about 500 lay followers, went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there the Blessed One said to him, \"Householder, you have provided the community of monks with robes, alms food, lodgings, & medicinal requisites for the sick, but you shouldn't rest content with the thought, 'We have provided the community of monks with robes, alms food, lodgings, & medicinal requisites for the sick.' So you should train yourself, 'Let's periodically enter & remain in seclusion & rapture.' That's how you should train yourself.\"",
  "entities": [
    [
      "PERSON",
      "Anathapindika"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "monks"
    ]
  ]
}
{
  "text": "On one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika 's monastery. Then two brahmans — feeble old men, aged, advanced in years, having come to the last stage of life, 120 years old — went to the Blessed One. On arrival, they exchanged courteous greetings with him and, after an exchange of friendly greetings & courtesies, sat to one side. As they were sitting there, they said to him: \"Master Gotama, we are brahmans — feeble old men, aged, advanced in years, having come to the last stage of life, 120 years old. And we have done no admirable deeds, no skillful deeds, no deeds that allay our fears. Teach us, Master Gotama. Instruct us, Master Gotama, for our long-term benefit & happiness.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika 's monastery"
    ],
    [
      "NORP",
      "brahmans"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Master Gotama"
    ],
    [
      "NORP",
      "brahmans"
    ],
    [
      "PERSON",
      "Master Gotama"
    ],
    [
      "PERSON",
      "Master Gotama"
    ]
  ]
}
{
  "text": "\"Monks, these four types of individuals are to be found existing in the world. Which four?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "Then Anathapindika the householder went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there the Blessed One said to him: \"There are these four kinds of bliss that can be attained in the proper season, on the proper occasions, by a householder partaking of sensuality. Which four? The bliss of having, the bliss of [making use of] wealth, the bliss of debtlessness, the bliss of blamelessness.",
  "entities": [
    [
      "PERSON",
      "Anathapindika"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying at Nalanda in Pavarika 's mango grove. Then Kevatta the householder approached the Blessed One and, on arrival, having bowed down, sat to one side. As he was sitting there he said to the Blessed One: \"Lord, this Nalanda is powerful, both prosperous and populous, filled with people who have faith in the Blessed One. It would be good if the Blessed One were to direct a monk to display a miracle of psychic power from his superior human state so that Nalanda would to an even greater extent have faith in the Blessed One.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Nalanda"
    ],
    [
      "LOC",
      "mango grove"
    ],
    [
      "PERSON",
      "Kevatta"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Nalanda"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Nalanda"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "I have heard that on one occasion, when the Blessed One was on a wandering tour among the Kosalans with a large community of monks, he arrived at the brahman village called Sala . The brahman householders heard, \"Master Gotama the contemplative — the son of the Sakyans, having gone forth from the Sakyan clan — on a wandering tour among the Kosalans with a large community of monks — has arrived at Sala. And of that master Gotama this fine reputation has spread: 'He is indeed a Blessed One, an arahant, rightly self-awakened: consummate in knowledge & conduct, well-gone, a knower of the cosmos, an unexcelled trainer of those persons ready to be tamed, teacher of human & divine beings, awakened, blessed. He has made known — having realized it through direct knowledge — this world with its devas, maras, & brahmas, its generations with their contemplatives & brahmans, their rulers & common people. He has explained the Dhamma admirable in the beginning, admirable in the middle, admirable in the end; has expounded the holy life both in its particulars & in its essence, entirely perfect, surpassingly pure. It is good to see such a worthy one.'\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Kosalans"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "brahman"
    ],
    [
      "NORP",
      "brahman"
    ],
    [
      "NORP",
      "householders"
    ],
    [
      "PERSON",
      "Master Gotama"
    ],
    [
      "NORP",
      "Sakyans"
    ],
    [
      "NORP",
      "Sakyan"
    ],
    [
      "NORP",
      "Kosalans"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "PERSON",
      "master Gotama"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "brahmans"
    ]
  ]
}
{
  "text": "\"Monks, there are these four types of individuals to be found existing in the world. Which four?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Endowed with five qualities, monks, a king's elephant is not worthy of a king, is not a king's asset, does not count as a very limb of his king. Which five? There is the case where a king's elephant is not resilient to sights, not resilient to sounds, not resilient to aromas, not resilient to flavors, not resilient to tactile sensations.",
  "entities": [
    [
      "NORP",
      "monks"
    ],
    [
      "PERSON",
      "king. Which"
    ]
  ]
}
{
  "text": "Monks, there are these eight individuals who are worthy of gifts, worthy of hospitality, worthy of offerings, worthy of reverential salutation, the unsurpassed field of merit for the world. Which eight?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, there are these eight grounds for laziness . Which eight?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery . Then Subha the student, Todeyya's son , went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to the Blessed One: \"Master Gotama, what is the reason, what is the cause, why baseness & excellence are seen among human beings, among the human race? For short-lived & long-lived people are to be seen, sickly & healthy, ugly & beautiful, uninfluential & influential, poor & rich, low-born & high-born, stupid & discerning people are to be seen. So what is the reason, what is the cause, why baseness & excellence are seen among human beings, among the human race?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's monastery"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Master Gotama"
    ]
  ]
}
{
  "text": "Then Vacchagotta the wanderer went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to the Blessed One: \"Master Gotama, I have heard that 'Gotama the contemplative says this: \"Only to me should a gift be given, and not to others. Only to my disciples should a gift be given, and not to others. Only what is given to me bears great fruit, and not what is given to others. Only what is given to my disciples bears great fruit, and not what is given to the disciples of others.\"' Now those who report this: Are they reporting the Master Gotama's actual words, are they not misrepresenting him with what is unfactual, are they answering in line with the Dhamma, so that no one whose thinking is in line with the Dhamma will have grounds for criticizing them? For we don't want to misrepresent the Master Gotama.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Master Gotama"
    ],
    [
      "PERSON",
      "Gotama"
    ],
    [
      "PERSON",
      "Master Gotama"
    ],
    [
      "PERSON",
      "Master Gotama"
    ]
  ]
}
{
  "text": "\"Monks, this recitation of more than 150 training rules comes every fortnight, in reference to which sons of good families desiring the goal train themselves. [1] There are these three trainings under which all that is gathered. Which three? The training in heightened virtue, the training in heightened mind, the training in heightened discernment. [2]",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, these five future dangers are just enough, when considered, for a monk — heedful, ardent, and resolute — to live for the attaining of the as-yet-unattained, the reaching of the as-yet-unreached, the realization of the as-yet-unrealized. Which five?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One, on a wandering tour among the Kurus with a large community of monks, arrived at Thullakotthita , a town of the Kurus. The brahmans & householders of Thullakotthita heard it said, \"Gotama the contemplative — the son of the Sakyans, having gone forth from the Sakyan clan — has arrived at Thullakotthita. And of that Master Gotama this fine reputation has spread: 'He is indeed a Blessed One, worthy, & rightly self-awakened, consummate in knowledge & conduct, well-gone, a knower of the cosmos, an unexcelled trainer of those persons ready to be tamed, teacher of human & divine beings, awakened, blessed. He has made known — having realized it through direct knowledge — this world with its devas, maras, & brahmas, its generations with their contemplatives & brahmans, their rulers & common people. He has explained the Dhamma admirable in the beginning, admirable in the middle, admirable in the end; has expounded the holy life both in its particulars & in its essence, entirely perfect, surpassingly pure. It's good to see such a worthy one.'\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Kurus"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Kurus"
    ],
    [
      "NORP",
      "brahmans"
    ],
    [
      "NORP",
      "householders"
    ],
    [
      "PERSON",
      "Gotama"
    ],
    [
      "NORP",
      "Sakyans"
    ],
    [
      "NORP",
      "Sakyan"
    ],
    [
      "PERSON",
      "Master Gotama"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "brahmans"
    ]
  ]
}
{
  "text": "\"Monks, these four types of individuals are to be found existing in the world. Which four? The one who practices neither for his/her own benefit nor for that of others. The one who practices for the benefit of others but not for his/her own. The one who practices for his/her own benefit but not for that of others. The one who practices for his/her own benefit and for that of others.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, these eight causes, these eight requisite conditions lead to the acquiring of the as-yet-unacquired discernment that is basic to the holy life, and to the increase, plenitude, development, & culmination of that which has already been acquired. Which eight?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying at Savatthi in the Eastern Monastery, the palace of Migara 's mother, together with many well-known elder disciples — with Ven. Sariputta , Ven. Maha Moggallana , Ven. Maha Kassapa , Ven. Maha Kaccana , Ven. Maha Kotthita , Ven. Maha Kappina , Ven. Maha Cunda , Ven. Revata , Ven. Ananda , and other well-known elder disciples. On that occasion the elder monks were teaching & instructing. Some elder monks were teaching & instructing ten monks, some were teaching & instructing twenty monks, some were teaching & instructing thirty monks, some were teaching & instructing forty monks. The new monks, being taught & instructed by the elder monks, were discerning grand, successive distinctions.",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Eastern Monastery"
    ],
    [
      "PERSON",
      "Ven. Sariputta"
    ],
    [
      "PERSON",
      "Ven. Maha Moggallana"
    ],
    [
      "PERSON",
      "Ven. Maha Kassapa"
    ],
    [
      "PERSON",
      "Ven. Maha Kaccana"
    ],
    [
      "PERSON",
      "Ven. Maha Kotthita"
    ],
    [
      "PERSON",
      "Ven. Maha Kappina"
    ],
    [
      "PERSON",
      "Ven. Maha Cunda"
    ],
    [
      "PERSON",
      "Ven. Revata"
    ],
    [
      "PERSON",
      "Ven. Ananda"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "monks"
    ]
  ]
}
{
  "text": "Then Ven. Samiddhi went to Ven. Sariputta and, on arrival, having bowed down to him, sat to one side. As he was sitting there, Ven. Sariputta said to him, \"Based on what, Samiddhi, do thoughts & resolves arise in a person?\"",
  "entities": [
    [
      "PERSON",
      "Ven. Samiddhi"
    ],
    [
      "PERSON",
      "Ven. Sariputta"
    ],
    [
      "PERSON",
      "Ven. Sariputta"
    ]
  ]
}
{
  "text": "\"Monks, speaking rightly of Nanda, one could say, 'He is a son of a good family.' Speaking rightly of Nanda, one could say, 'He is strong.' Speaking rightly of Nanda, one could say, 'He is handsome.' Speaking rightly of Nanda, one could say, 'He is fiercely passionate.' If Nanda did not guard the doors of his senses, know moderation in eating, be devoted to wakefulness, and be endowed with mindfulness & alertness, how would he be able to follow the holy life, complete & pure?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "Then Ven. Sariputta went to the Blessed One and, on arrival, bowed down to him and sat to one side. As he was sitting there, the Blessed One said to him, \"Sariputta, how many are the strengths of a monk whose effluents are ended, endowed with which he affirms the ending of the effluents (thus): 'The effluents are ended in me'?\"",
  "entities": [
    [
      "PERSON",
      "Ven. Sariputta"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Sariputta"
    ]
  ]
}
{
  "text": "\"Monks, these four types of individuals are to be found existing in the world. Which four? The one who practices for his/her own benefit but not for that of others. The one who practices for the benefit of others but not for his/her own. The one who practices neither for his/her own benefit nor for that of others. The one who practices for his/her own benefit and for that of others.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, there are these four types of individuals to be found existing in the world. Which four?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Sāvatthī in Jeta's Grove, Anāthapiṇḍika's monastery. There the Blessed One addressed the monks, \"Monks.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Sāvatthī"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anāthapiṇḍika's monastery"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "Then the brahman Sangarava went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there he said to the Blessed One: \"I say, Master Gotama. We brahmans perform sacrifices and get others to perform sacrifices. And whoever performs a sacrifice, whoever gets others to perform a sacrifice, they have all practiced a practice of merit — the business of a sacrifice — [that benefits] countless beings. But whoever, leaving his family, has gone forth from the home life into homelessness, and tames his single self, brings his single self into tune, brings his single self to Unbinding: his practice of merit — this business of going forth — is one [that benefits] only one being.\"",
  "entities": [
    [
      "NORP",
      "brahman"
    ],
    [
      "NORP",
      "Sangarava"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Master Gotama"
    ],
    [
      "NORP",
      "brahmans"
    ]
  ]
}
{
  "text": "Once the Blessed One was staying among the Bhaggas in the Deer Park at Bhesakala Grove, near Crocodile Haunt. And at that time Ven. Anuruddha was living among the Cetis in the Eastern Bamboo Park. Then, as he was alone in seclusion, this line of thinking arose in Ven. Anuruddha's awareness: \"This Dhamma is for one who is modest, not for one who is self-aggrandizing. This Dhamma is for one who is content, not for one who is discontent. This Dhamma is for one who is reclusive, not for one who is entangled. This Dhamma is for one whose persistence is aroused, not for one who is lazy. This Dhamma is for one whose mindfulness is established, not for one whose mindfulness is confused. This Dhamma is for one whose mind is centered, not for one whose mind is uncentered. This Dhamma is for one endowed with discernment, not for whose discernment is weak.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Bhaggas"
    ],
    [
      "LOC",
      "Deer Park"
    ],
    [
      "LOC",
      "Bhesakala Grove"
    ],
    [
      "LOC",
      "Crocodile Haunt"
    ],
    [
      "PERSON",
      "Ven. Anuruddha"
    ],
    [
      "NORP",
      "Cetis"
    ],
    [
      "LOC",
      "Bamboo Park"
    ],
    [
      "PERSON",
      "Ven. Anuruddha"
    ]
  ]
}
{
  "text": "On one occasion the Blessed One was staying in Saketa at Kalaka's park. There he addressed the monks: \"Monks!\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Saketa"
    ],
    [
      "LOC",
      "Kalaka's park"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "Then Janussonin the brahman went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to the Blessed One, \"Master Gotama, you know that we brahmans give gifts, make offerings, [saying,] 'May this gift accrue to our dead relatives. May our dead relatives partake of this gift.' Now, Master Gotama, does that gift accrue to our dead relatives? Do our dead relatives partake of that gift?\"",
  "entities": [
    [
      "NORP",
      "brahman"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Master Gotama"
    ],
    [
      "NORP",
      "brahmans"
    ],
    [
      "PERSON",
      "Master Gotama"
    ]
  ]
}
{
  "text": "Once the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika 's monastery. Then King Pasenadi the Kosalan went to the Blessed One and, on arrival, having bowed down, sat to one side. Now, at that time Queen Mallika died. Then a certain man went to the king and whispered in his ear: \"Your majesty, Queen Mallika has died.\" When this was said, King Pasenadi the Kosalan sat there miserable, sick at heart, his shoulders drooping, his face down, brooding, at a loss for words. Then the Blessed One saw the king sitting there miserable, sick at heart... at a loss for words, and so said to him, \"There are these five things, great king, that cannot be gotten by a contemplative, a brahman, a deva, a Mara, a Brahma, or anyone at all in the world. Which five?",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika 's monastery"
    ],
    [
      "PERSON",
      "King Pasenadi"
    ],
    [
      "NORP",
      "Kosalan"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "King Pasenadi"
    ],
    [
      "NORP",
      "Kosalan"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "brahman"
    ],
    [
      "PERSON",
      "Mara"
    ]
  ]
}
{
  "text": "Thus have I heard. Once the Blessed One was wandering among the Kosala people together with a large company of monks. Entering a major path, the Blessed One saw in a certain spot a great mass of fire, burning, blazing, glowing. After seeing it and stepping down from the path he sat on the appointed seat at the root of a tree. After sitting down the Blessed One said to the monks: \"Do you see, monks, that great mass of fire, burning, blazing, glowing?\" — \" Yes, venerable Sir.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "PERSON",
      "venerable Sir"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying at Rajagaha , in Jivaka Komarabhacca 's mango grove, with a large community of monks — 1,250 monks in all. Now at that time — it being the observance day, the full-moon night of the water-lily season, the fourth month of the rains — King Ajatasattu of Magadha, the son of Queen Videha , was sitting on the roof terrace of his palace surrounded by his ministers. Then he felt inspired to exclaim: \"How wonderful is this moonlit night! How beautiful... How lovely... How inspiring... How auspicious is this moonlit night! What brahman or contemplative should we visit tonight who might enlighten and bring peace to our mind?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Rajagaha"
    ],
    [
      "PERSON",
      "Jivaka Komarabhacca"
    ],
    [
      "LOC",
      "mango grove"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "PERSON",
      "King Ajatasattu of Magadha"
    ],
    [
      "PERSON",
      "Queen Videha"
    ],
    [
      "NORP",
      "brahman"
    ]
  ]
}
{
  "text": "\"Monks, these are the four developments of concentration. Which four? There is the development of concentration that, when developed & pursued, leads to a pleasant abiding in the here & now. There is the development of concentration that, when developed & pursued, leads to the attainment of knowledge & vision. There is the development of concentration that, when developed & pursued, leads to mindfulness & alertness. There is the development of concentration that, when developed & pursued, leads to the ending of the effluents.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, these four things are born. Which four? Affection is born of affection. Aversion is born of affection. Affection is born of aversion. Aversion is born of aversion.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Vesālī , at the Gabled Hall in the Great Forest. And on that occasion Saccaka the Nigaṇṭha-son was dwelling in Vesālī — a debater, a sophist, [1] well-regarded by people at large. He made this statement before the assembly in Vesālī: \"I see no contemplative or brahman, the head of an order, the head of a group, or even one who claims to be an arahant, rightly self-awakened, who — engaged in debate with me — would not shiver, quiver, shake, & break out in sweat under the armpits. Even if I were to engage a senseless stump in debate, it — engaged with me in debate — would shiver, quiver, & shake, to say nothing of a human being.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Vesālī"
    ],
    [
      "GPE",
      "Vesālī"
    ],
    [
      "GPE",
      "Vesālī"
    ],
    [
      "NORP",
      "brahman"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Rajagaha on Vulture's Peak Mountain. Then early in the morning, Ven. Sariputta put on his robes and, carrying his bowl and outer robe, was coming down from Vulture's Peak Mountain with a large group of monks when he saw a large wood pile off to one side. Seeing it, he said to the monks, \"Friends, do you see that large wood pile over there?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Rajagaha"
    ],
    [
      "LOC",
      "Vulture's Peak Mountain"
    ],
    [
      "PERSON",
      "Ven. Sariputta"
    ],
    [
      "LOC",
      "Vulture's Peak Mountain"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Rajagaha in the Bamboo Grove, the Squirrels' Sanctuary.",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Rajagaha"
    ],
    [
      "LOC",
      "Bamboo Grove"
    ]
  ]
}
{
  "text": "\"Monks, there are these five types of warriors who can be found existing in the world. Which five?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, these four types of individuals are to be found existing in the world. Which four?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying in Savatthi at Jeta's Grove, Anathapindika's monastery . Now at that time a large number of monks, after the meal, on returning from their alms round, had gathered at the meeting hall and were engaged in many kinds of bestial topics of conversation: conversation about kings, robbers, & ministers of state; armies, alarms, & battles; food & drink; clothing, furniture, garlands, & scents; relatives; vehicles; villages, towns, cities, the countryside; women & heroes; the gossip of the street & the well; tales of the dead; tales of diversity, the creation of the world & of the sea; talk of whether things exist or not.",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's monastery"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "kings"
    ]
  ]
}
{
  "text": "On one occasion Ven. Ananda was staying in Kosambi at Ghosita's Park. Then Ven. Udayin went to him and, on arrival, exchanged courteous greetings. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to Ven. Ananda, \"This has been said by Pañcalacanda the deva's son:",
  "entities": [
    [
      "PERSON",
      "Ven. Ananda"
    ],
    [
      "GPE",
      "in"
    ],
    [
      "GPE",
      "Kosambi"
    ],
    [
      "LOC",
      "Ghosita's Park"
    ],
    [
      "PERSON",
      "Ven. Udayin"
    ],
    [
      "PERSON",
      "Ven. Ananda"
    ]
  ]
}
{
  "text": "[ Udayin :] \"'Released both ways, released both ways,' it is said. To what extent is one described by the Blessed One as released both ways?\"",
  "entities": [
    [
      "PERSON",
      "Udayin"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Vesali , in the Great Forest, at the Gabled Pavilion. Then, in the late afternoon, he left his seclusion and went to the sick ward, where he saw a monk who was weak & sickly. Seeing him, he sat down on a prepared seat. As he was sitting there, he addressed the monks: \"When these five things don't leave a monk who is weak & sickly, it can be expected of him that, before long — with the ending of the fermentations — he will enter & remain in the fermentation-free awareness-release & discernment-release, having realized & directly known them for himself in the here & now. Which five?",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Vesali"
    ],
    [
      "NORP",
      "monks"
    ]
  ]
}
{
  "text": "\"Monks, there are these four types of individuals to be found existing in the world. Which four?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "1. Thus have I heard. On one occasion the Exalted One was travelling along the highway between Rājagaha and Nālandā together with a great company of bhikkhus, with about five hundred bhikkhus. At the same time the wanderer Suppiya was also travelling along the highway between Rājagaha and Nālandā together with his pupil, the youth Brahmadatta. Along the way, the wanderer Suppiya spoke in many ways in dispraise of the Buddha, the Dhamma, and the Sangha. But his pupil, the youth Brahmadatta, spoke in many ways in praise of the Buddha, the Dhamma, and the Sangha. Thus these two, teacher and pupil, followed closely behind the Exalted One and the company of bhikkhus, making assertions in direct contradiction to each other.",
  "entities": [
    [
      "GPE",
      "Rājagaha"
    ],
    [
      "GPE",
      "Nālandā"
    ],
    [
      "NORP",
      "bhikkhus"
    ],
    [
      "NORP",
      "bhikkhus"
    ],
    [
      "GPE",
      "Rājagaha"
    ],
    [
      "GPE",
      "Nālandā"
    ],
    [
      "NORP",
      "bhikkhus"
    ]
  ]
}
{
  "text": "I have heard that at one time the Blessed One was staying at Vesali , in the Peaked Roof Hall in the Great Forest.",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Vesali"
    ]
  ]
}
{
  "text": "Thus have I heard. Once the Blessed One was staying at Savatthi, in Jeta's Grove, Anathapindika's monastery. [1] Then Carpenter Fivetools went to see the Venerable Udayi . Having saluted him respectfully, he sat down at one side. Thus seated, he asked the Venerable Udayi:",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's monastery"
    ],
    [
      "PERSON",
      "Venerable Udayi"
    ],
    [
      "PERSON",
      "Venerable Udayi"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Sāvatthī in Jeta's Grove, Anāthapiṇḍika's monastery. Then Piṅgalakoccha the brahman went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there, he said to the Blessed One, \"Master Gotama, these contemplatives & brahmans, each with his group, each with his community, each the teacher of his group, an honored leader, well-regarded by people at large — i.e., Pūraṇa Kassapa , Makkhali Gosāla , Ajita Kesakambalin , Pakudha Kaccāyana , Sañjaya Velaṭṭhaputta , & the Nigaṇṭha Nāṭaputta : Do they all have direct knowledge as they themselves claim, or do they all not have direct knowledge, or do some of them have direct knowledge and some of them not?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Sāvatthī"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anāthapiṇḍika's monastery"
    ],
    [
      "NORP",
      "brahman"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Master Gotama"
    ],
    [
      "NORP",
      "brahmans"
    ]
  ]
}
{
  "text": "Then Anathapindika the householder went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there the Blessed One said to him: \"These five things, householder, are welcome, agreeable, pleasant, & hard to obtain in the world. Which five?",
  "entities": [
    [
      "PERSON",
      "Anathapindika"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
