{"text": "I have heard that on one occasion the Blessed One was staying near Rājagaha at the Bamboo Grove, the Squirrels' Sanctuary. And on that occasion Ven. Mahā Kassapa was staying at the Pipphali Cave, sitting for seven days in a single session, having attained a certain level of concentration. Then, with the passing of seven days, he emerged from that concentration. To him, emerging from that concentration, the thought occurred: \"What if I were to go into Rājagaha for alms?\"", "spans": [ {"start": 38, "end": 49, "label": "PERSON"}, {"start": 83, "end": 95, "label": "LOC"}, {"start": 181, "end": 194, "label": "LOC"}] }
{"text": "I have heard that on one occasion the Blessed One was staying near Rājagaha at the Bamboo Grove, the Squirrels' Sanctuary. And on that occasion two factions in Rājagaha were infatuated with a certain courtesan, their minds enthralled. Arguing, quarreling, & disputing, they attacked one another with fists, attacked one another with clods of dirt, attacked one another with sticks, attacked one another with knives, so that they fell into death or death-like pain.", "spans": [{"start": 38, "end": 49, "label": "PERSON"}, {"start": 83, "end": 95, "label": "LOC"}]}
{"text": "I have heard that on one occasion the Blessed One was staying near Rājagaha at the Bamboo Grove, the Squirrels' Sanctuary. And on that occasion Ven. Mahā Kassapa was staying at the Pipphali Cave, afflicted, in pain, & seriously ill. Then, at a later time, he recovered from his illness. When he had recovered from the illness, the thought occurred to him: \"What if I were to go into Rājagaha for alms?\"", "spans": [{"start": 38, "end": 49, "label": "PERSON"}, {"start": 83, "end": 95, "label": "LOC"}, {"start": 181, "end": 194, "label": "LOC"}]}
{"text": "I have heard that on one occasion the Blessed One was staying near Rājagaha at the Bamboo Grove, the Squirrels' Sanctuary. And on that occasion, when Ven. Upasena Vaṅgantaputta was alone in seclusion, this line of thinking appeared to his awareness: \"What a gain, what a true gain it is for me that my teacher is the Blessed One, worthy and fully self-awakened; that I have gone forth from home to the homeless life in a well-taught Dhamma & Vinaya; that my companions in the holy life are virtuous and endowed with admirable qualities; that I have achieved culmination in terms of the precepts; that my mind is unified and well-concentrated; that I am an arahant, with effluents ended; that I have great power & great might. Fortunate has been my life; fortunate will be my death.\"", "spans": [{"start": 38, "end": 49, "label": "PERSON"}, {"start": 83, "end": 95, "label": "LOC"}, {"start": 317, "end": 328, "label": "PERSON"}]}
{"text": "I have heard that on one occasion the Blessed One was staying near Rājagaha at the Bamboo Grove in the Squirrels' sanctuary. And on that occasion Ven. Samiddhi was staying in a wilderness hut. Then Potaliputta the wanderer, while walking & wandering around to exercise his legs, went to Ven. Samiddhi and exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to Ven. Samiddhi, \"Face to face with Gotama the contemplative have I heard this, face to face have I learned this: 'Bodily action is barren, verbal action is barren, only mental action is true. And there is an attainment in which, on being attained, nothing is felt.'\"", "spans": [{"start": 38, "end": 49, "label": "PERSON"}, {"start": 83, "end": 95, "label": "LOC"}, {"start": 489, "end": 495, "label": "PERSON"}]}
{"text": "Then in the early morning, a large number of monks adjusted their under robes and — carrying their bowls & robes — went into Sāvatthī for alms. Having gone for alms in Sāvatthī, after the meal, returning from their alms round, they went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As they were sitting there, they said to the Blessed One, \"At present, two factions in Rājagaha are infatuated with a certain courtesan, their minds enthralled. Arguing, quarreling, & disputing, they attack one another with fists, attack one another with clods of dirt, attack one another with sticks, attack one another with knives, so that they fall into death or death-like pain.\"", "spans": [{"start": 125, "end": 133, "label": "GPE"}, {"start": 168, "end": 176, "label": "GPE"}, {"start": 244, "end": 255, "label": "PERSON"}, {"start": 361, "end": 372, "label": "PERSON"}]}
{"text": "Now on that occasion Sakka, the deva-king, wanted to give alms to Ven. Mahā Kassapa. So, assuming the appearance of a weaver, he was working a loom, while Sujātā, an asura-maiden, filled the shuttle. Then, as Ven. Mahā Kassapa was going on an almsround that bypassed no donors [1] in Rājagaha, he arrived at Sakka's home. Sakka saw him coming from afar and, on seeing him, came out of house to meet him. Taking the bowl from his hand, entered the house, took cooked rice from the pot, filled the bowl, and gave it back to Ven. Mahā Kassapa. And that gift of alms included many kinds of curry, many kinds of sauces.", "spans": [{"start": 155, "end": 161, "label": "PERSON"}]}
{"text": "I have heard that on one occasion the Blessed One was staying near Rājagaha at the Bamboo Grove, the Squirrels' Sanctuary. And on that occasion Ven. Sāriputta and Ven. Mahā Moggallāna were staying in Pigeon Cave. Then, on a moonlit night, Ven. Sāriputta — his head newly shaven — was sitting in the open air, having attained a certain level of concentration.", "spans": [{"start": 38, "end": 49, "label": "PERSON"}, {"start": 83, "end": 95, "label": "LOC"}, {"start": 200, "end": 211, "label": "LOC"}]}
{"text": "I have heard that on one occasion the Blessed One was staying near Rājagaha at the Bamboo Grove, the Squirrels' refuge. Now at on that occasion Ven. Pilindavaccha went around addressing the monks as if they were outcastes.", "spans": [{"start": 38, "end": 49, "label": "PERSON"}, {"start": 83, "end": 95, "label": "LOC"}]}
{"text": "In have heard that on one occasion the Blessed One was staying near Rājagaha on Vulture Peak mountain, not long after Devadatta had left. Referring to Devadatta , the Blessed One addressed the monks:", "spans": [{"start": 39, "end": 50, "label": "PERSON"}, {"start": 80, "end": 92, "label": "LOC"}, {"start": 167, "end": 178, "label": "PERSON"}]}
{"text": "In the same way, monks, on whatever occasion a monk — secluded from sensuality, secluded from unskillful qualities — enters the first jhāna: rapture & pleasure born of seclusion, accompanied by directed thought & evaluation, on that occasion the thought occurs to him, Having come to this shelter for the fearful, I will now keep here to myself, having nothing to do with Māra. And the thought occurs to Māra, the Evil One, Having gone to this shelter for the fearful, the monk will now keep here to himself, having nothing to do with me.", "spans": [{"start": 372, "end": 376, "label": "PERSON"}, {"start": 404, "end": 408, "label": "PERSON"}]}
{"text": "\"On whatever occasion, with the complete transcending of the dimension of neither perception nor non-perception, he enters & remains in the cessation of perception & feeling; and, having seen [that] with discernment, his effluents are completely ended: He is said to be a monk who has put Māra in the dark. Having bound Māra's eyes and leaving no opening, he has become invisible to the Evil One, having crossed over attachment in the cosmos.\"", "spans": [{"start": 289, "end": 293, "label": "PERSON"}, {"start": 320, "end": 324, "label": "PERSON"}]}
{"text": "Then Visakha the lay follower, delighting & rejoicing in what Dhammadinna the nun had said, bowed down to her and, keeping her to his right, went to the Blessed One. On arrival, having bowed down to the Blessed One, he sat to one side. As he was sitting there he told the Blessed One the full extent of the conversation he had had with Dhammadinna the nun. When this was said, the Blessed One said to him, \"Dhammadinna the nun is wise, Visakha, a woman of great discernment. If you had asked me those things, I would have answered you in the same way she did. That is the meaning of those things. That is how you should remember it.\"", "spans": [{"start": 5, "end": 12, "label": "PERSON"}, {"start": 153, "end": 164, "label": "PERSON"}, {"start": 203, "end": 214, "label": "PERSON"}, {"start": 272, "end": 283, "label": "PERSON"}, {"start": 381, "end": 392, "label": "PERSON"}, {"start": 436, "end": 443, "label": "PERSON"}]}
{"text": "I have heard that on one occasion the Blessed One was staying near Rajagaha in the Bamboo Grove, the Squirrels' Sanctuary. Then Visakha the lay follower went to Dhammadinna the nun and, on arrival, having bowed down to her, sat to one side. As he was sitting there he said to her, \"'Self-identification, self-identification,' it is said, lady. Which self-identification is described by the Blessed One?\"", "spans": [{"start": 38, "end": 49, "label": "PERSON"}, {"start": 67, "end": 75, "label": "GPE"}, {"start": 83, "end": 95, "label": "LOC"}, {"start": 128, "end": 135, "label": "PERSON"}, {"start": 390, "end": 401, "label": "PERSON"}]}
{"text": "Saying, \"Yes, lady,\" Visakha the lay follower delighted & rejoiced in what Dhammadinna the nun had said. Then he asked her a further question: \"'The origination of self-identification, the origination of self-identification,' it is said, lady. Which origination of self-identification is described by the Blessed One?\"", "spans": [{"start": 21, "end": 28, "label": "PERSON"}, {"start": 305, "end": 316, "label": "PERSON"}]}
{"text": "Once Ven. Sariputta and Ven. Upasena were staying near Rajagaha in the Cool Forest, at Snakeshood Grotto. Then it so happened that a snake fell on Ven. Upasena's body [and bit him]. Then Ven. Upasena said to the monks, \"Quick, friends, lift this body of mine onto a couch and carry it outside before it is scattered like a fistful of chaff!\"", "spans": [{"start": 10, "end": 19, "label": "PERSON"}, {"start": 55, "end": 63, "label": "GPE"}]}
{"text": "Then Ven. Upasena said, \"Quick, friends, lift this body of mine onto a couch and carry it outside before it is scattered like a fistful of chaff! Friend Sariputta, in anyone who had the thought, 'I am the eye' or 'The eye is mine,' 'I am the ear' or 'The ear is mine,' 'I am the nose' or 'The nose is mine,' 'I am the tongue' or 'The tongue is mine,' 'I am the body or 'The body is mine,' 'I am the intellect' or 'The intellect is mine': in him there would be an alteration in his body or a change in his faculties. But as for me, the thought does not occur to me that 'I am the eye' or 'The eye is mine,'... 'I am the tongue' or 'The tongue is mine,'... 'I am the intellect' or 'The intellect is mine.' So what alteration should there be in my body, what change should there be in my faculties?\"", "spans": [{"start": 153, "end": 162, "label": "PERSON"}]}
{"text": "I have heard that on one occasion the Blessed One was staying near Rājagaha at the Bamboo Grove, the Squirrels' Sanctuary. And on that occasion, when Ven. Upasena Vaṅgantaputta was alone in seclusion, this line of thinking appeared to his awareness: \"What a gain, what a true gain it is for me that my teacher is the Blessed One, worthy and fully self-awakened; that I have gone forth from home to the homeless life in a well-taught Dhamma & Vinaya; that my companions in the holy life are virtuous and endowed with admirable qualities; that I have achieved culmination in terms of the precepts; that my mind is unified and well-concentrated; that I am an arahant, with effluents ended; that I have great power & great might. Fortunate has been my life; fortunate will be my death.\"", "spans": [{"start": 38, "end": 49, "label": "PERSON"}, {"start": 83, "end": 95, "label": "LOC"}, {"start": 317, "end": 328, "label": "PERSON"}]}
{"text": "Then the Blessed One, comprehending with his awareness the line of thinking that had appeared to Ven. Upasena Vaṅgantaputta's awareness, on that occasion exclaimed:", "spans": [{"start": 9, "end": 20, "label": "PERSON"}]}
{"text": "When this was said, Ven. Sariputta said to Ven. Upasena, \"But we don't see any alteration in your body or change in your faculties.\"", "spans": [{"start": 25, "end": 34, "label": "PERSON"}]}
{"text": "And on that occasion Ven. Subhūti was sitting not far from the Blessed One, his legs crossed, his body held erect, having attained a concentration free from directed thought.", "spans": [{"start": 63, "end": 74, "label": "PERSON"}]}
{"text": "And on that occasion Ven. Sāriputta, Ven. Mahā Moggalāna, Ven. Mahā Kassapa, Ven. Mahā Kaccāyana, Ven. Mahā Koṭṭhita, Ven. Mahā Kappina, Ven. Mahā Cunda, Ven. Anuruddha, Ven. Revata, and Ven. Nanda [1] went to the Blessed One. The Blessed One saw them coming from afar and, on seeing them, addressed the monks, \"Monks, those are brahmans who are coming. Monks, those are brahmans who are coming.\"", "spans": [{"start": 147, "end": 152, "label": "PERSON"}, {"start": 214, "end": 225, "label": "PERSON"}, {"start": 231, "end": 242, "label": "PERSON"}, {"start": 329, "end": 337, "label": "NORP"}, {"start": 371, "end": 379, "label": "NORP"}]}
{"text": "On one occasion Ven. Ananda was staying near Savatthi in Jeta's Grove, Anathapindika 's monastery. Then early in the morning he put on his robes and, carrying his bowl & outer robe, went into Savatthi for alms with Ven. Vangisa as his attendant monk.", "spans": [{"start": 21, "end": 27, "label": "PERSON"}, {"start": 45, "end": 53, "label": "GPE"}, {"start": 57, "end": 69, "label": "LOC"}, {"start": 71, "end": 97, "label": "LOC"}, {"start": 192, "end": 200, "label": "GPE"}]}
{"text": "Now at that time Ven. Upavana was standing in front of the Blessed One, fanning him.", "spans": [{"start": 59, "end": 70, "label": "PERSON"}]}
{"text": "Then Mahapajapati Gotami , together with about 500 other nuns, went to the Blessed One and, on arrival, having bowed down to him, stood to one side.", "spans": [{"start": 75, "end": 86, "label": "PERSON"}]}
{"text": "Then Mara the Evil One — sad & dejected at realizing, \"Kisa Gotami the nun knows me\" — vanished right there.", "spans": [{"start": 5, "end": 9, "label": "PERSON"}]}
{"text": "Then King Pasenadi Kosala went to the bhikkhuni Khema and, on arrival, having bowed down to her, sat to one side. As he was sitting there he said to her, \"Now then, lady, does the Tathagata exist after death?\"", "spans": [{"start": 180, "end": 189, "label": "PERSON"}]}
{"text": "Setting at Savatthi. Then, in the morning, the bhikkhuni Uppalavanna dressed... she stood at the foot of a sala tree in full flower.", "spans": [{"start": 11, "end": 19, "label": "GPE"}]}
{"text": "Saying, \"Yes, lady,\" Visakha the lay follower delighted & rejoiced in what Dhammadinna the nun had said.", "spans": [{"start": 21, "end": 28, "label": "PERSON"}]}
{"text": "Then Mara the Evil One, desiring to arouse fear, trepidation, and terror in the bhikkhuni Kisagotami, desiring to make her fall away from concentration, approached her and addressed her in verse.", "spans": [{"start": 5, "end": 9, "label": "PERSON"}]}
{"text": "When this was said, Ven. Ananda said to the Blessed One, \"Lord, may the Blessed One not be totally unbound in this little town, this dusty town, this branch township. There are other great cities: Campa , Rajagaha , Savatthi , Saketa , Kosambi , Vanarasi . May the Blessed One be totally unbound there. In those cities there are many wealthy noble warriors, brahmans, & householders who have high confidence in the Tathagata. They will conduct the Tathagata's funeral.\"", "spans": [{"start": 25, "end": 31, "label": "PERSON"}, {"start": 44, "end": 55, "label": "PERSON"}, {"start": 72, "end": 83, "label": "PERSON"}, {"start": 205, "end": 213, "label": "GPE"}, {"start": 216, "end": 224, "label": "GPE"}, {"start": 236, "end": 243, "label": "GPE"}, {"start": 265, "end": 276, "label": "PERSON"}, {"start": 358, "end": 366, "label": "NORP"}, {"start": 415, "end": 424, "label": "PERSON"}, {"start": 448, "end": 457, "label": "PERSON"}]}
{"text": "Then the thought occurred to Ven. Channa, \"This Ven. Ananda is staying at Kosambi in Ghosita's Park. He has been praised by the Teacher and is esteemed by his knowledgeable fellows in the holy life. He is capable of teaching me the Dhamma so that I might see the Dhamma, and I have sudden trust in him. Why don't I go to Ven. Ananda?\"", "spans": [{"start": 53, "end": 59, "label": "PERSON"}, {"start": 74, "end": 81, "label": "GPE"}, {"start": 326, "end": 332, "label": "PERSON"}]}
{"text": "On one occasion Ven. Ananda was staying in Kosambi at Ghosita's Park. Then Ven. Udayin went to him and, on arrival, exchanged courteous greetings. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to Ven. Ananda, \"This has been said by Pañcalacanda the deva's son:", "spans": [{"start": 21, "end": 27, "label": "PERSON"}, {"start": 43, "end": 50, "label": "GPE"}, {"start": 262, "end": 268, "label": "PERSON"}]}
{"text": "On one occasion Ven. Musila , Ven. Pavittha , Ven. Narada , and Ven. Ananda were staying in Kosambi at Ghosita's monastery .", "spans": [{"start": 69, "end": 75, "label": "PERSON"}, {"start": 92, "end": 99, "label": "GPE"}]}
