>>>>>>
{"text": "On one occasion the Blessed One was living in Vesālī , in the Great Wood. Then a certain Vajjian monk approached him and, on arrival, having bowed down to him, sat to one side. As he was sitting there, he said to the Blessed One, \"Lord, this recitation of more than 150 training rules comes every fortnight. [1] I cannot train in reference to them.\"", "entities": [["PERSON", "Blessed One"],
    [
      "GPE",
      "in"
    ],
    ["GPE", "Vesālī"],
    ["LOC", "Great Wood"],
    ["NORP", "Vajjian"],
    ["PERSON", "Blessed One"]
  ]
}
<<<<<<

{
  "text": "I have heard that on one occasion, while the Blessed One was on a wandering tour among the Kosalans with a large community of monks, he arrived at Salavatika .",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Kosalans"
    ],
    [
      "NORP",
      "monks"
    ], [ "GPE", "Salavatika"]
  ]
}


>>>>>>>>>>>>>>>>>>>
{
  "text": "\"Endowed with four qualities, monks, a warrior is worthy of a king, an asset to a king, and counts as a very limb of his king. Which four?",
  "entities": [
    [
      "NORP",
      "monks"
    ],
    [
      "PERSON",
      "king. Which"
    ]
  ]
}

<<<<<<<<<<<<<<<<<<<


{"text": "Thus have I heard. At one time the Blessed One was staying at Savatthi, in Jeta's Grove, Anathapindika's Pleasance. The Blessed One addressed the bhikkhus, saying, \"Bhikkhus,\" and they replied to him saying, \"Reverend Sir.\" The Blessed One spoke as follows:", "entities": [["PERSON", "Blessed One"], ["GPE", "Savatthi"], ["LOC", "Jeta's Grove"], ["LOC", "Anathapindika's Pleasance"], ["PERSON", "Blessed One"], ["NORP", "bhikkhus"], ["NORP", "Bhikkhus"], ["PERSON", "Reverend Sir"], ["PERSON", "Blessed One"] ] }
{"text": "Then Janussonin the brahman went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side.", "entities": [[ "PERSON", "Janussonin"], ["NORP", "brahman"], ["PERSON", "Blessed One"] }

===========================
{
  "text": "\"Monks, if those who have gone forth in other sects ask you, 'In what are all phenomena rooted? What is their coming into play? What is their origination? What is their meeting place? What is their presiding state? What is their governing principle? What is their surpassing state? What is their heartwood? Where do they gain a footing? What is their final end?': On being asked this by those who have gone forth in other sects, how would you answer?\"",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, these four types of individuals are to be found existing in the world. Which four? The one who practices for his own benefit but not for that of others. The one who practices for the benefit of others but not for his own. The one who practices neither for his own benefit nor for that of others. The one who practices for his own benefit and for that of others.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, there are these two conditions for the arising of wrong view. Which two? The voice of another [1] and inappropriate attention. These are the two conditions for the arising of wrong view.\"",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}






{"text": "I have heard that on one occasion the Blessed One was staying among the Angas . Now, the Angas have a town named Assapura . There the Blessed One addressed the monks, \"Monks!\"", "entities": [["PERSON", "Blessed One"], ["NORP", "Angas"], ["NORP", "Angas"], ["GPE", "Assapura"], ["PERSON", "Blessed One"], ["NORP", "monks"], ["NORP", "Monks"] ] }

{
  "text": "\"Bhikkhus, there are these five ways of removing annoyance, by which annoyance can be entirely removed by a bhikkhu when it arises in him. What are the five?",
  "entities": [
    [
      "NORP",
      "Bhikkhus"
    ]
  ]
}
{
  "text": "Then a certain devata, in the far extreme of the night, her extreme radiance lighting up the entirety of Jeta's Grove, went to the Blessed One. On arrival, having bowed down to him, she stood to one side. As she was standing there, she said to the Blessed One, \"These seven qualities, lord, lead to a monk's non-decline. Which seven? Respect for the teacher, respect for the Dhamma, respect for the Sangha, respect for training, respect for concentration, respect for heedfulness, respect for hospitality. These seven qualities, lord, lead to the non-decline of a monk.\"",
  "entities": [
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
   
  ]
}
{
  "text": "\"Monks, these eight worldly conditions spin after the world, and the world spins after these eight worldly conditions. Which eight? Gain, loss, status, disgrace, censure, praise, pleasure, & pain. These are the eight worldly conditions that spin after the world, and the world spins after these eight worldly conditions.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, there are these eight rewards of merit, rewards of skillfulness, nourishments of happiness, celestial, resulting in happiness, leading to heaven, leading to what is desirable, pleasurable, & appealing, to welfare & happiness. Which eight?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, there are these three types of individuals to be found existing in the world. Which three? An individual like an inscription in rock, an individual like an inscription in soil, and an individual like an inscription in water.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, I shall point out the nearest shore and the farthest shore. [1] Hear this, and thoroughly attend to it in mind. I shall speak.\"",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, there are these seven obsessions. [1] Which seven?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, there are these four modes of practice. Which four? Intolerant practice, tolerant practice, self-controlled practice, and even practice. [1]",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, these four types of individuals are to be found existing in the world. Which four?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, these six are conditions that are conducive to amiability, that engender feelings of endearment, engender feelings of respect, leading to a sense of fellowship, a lack of disputes, harmony, & a state of unity. Which six?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "On one occasion Ven. Ananda was staying near Rajagaha , at Tapoda monastery. Then, as night was ending, he got up & went to the Tapoda Hot Springs to bathe his limbs. Having bathed his limbs and having gotten out of the springs, he stood wearing only his lower robe, drying his limbs. Kokanuda the wanderer, as night was ending, also got up & went to the Tapoda Hot Springs to bathe his limbs. He saw Ven. Ananda from afar, and on seeing him said to him, \"Who are you, my friend?\"",
  "entities": [
    [
      "PERSON",
      "Ven. Ananda"
    ],
    [
      "GPE",
      "Rajagaha"
    ],
    [
      "LOC",
      "Tapoda monastery"
    ],
    [
      "LOC",
      "Tapoda Hot Springs"
    ],
    [
      "PERSON",
      "Kokanuda"
    ],
    [
      "LOC",
      "Tapoda Hot Springs"
    ],
    [
      "PERSON",
      "Ven. Ananda"
    ]
  ]
}
{
  "text": "Monks, there are these five benefits of walking up & down. [1] What five?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": ". Thus have I heard. On one occasion the Blessed One was living at Savatthi in Jeta's Grove, Anathapindika 's Park. There the Venerable Sariputta addressed the bhikkhus thus: \"Friends, bhikkhus.\" — \"Friend,\" they replied. The Venerable Sariputta said this:",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika 's Park"
    ],
    [
      "PERSON",
      "Venerable Sariputta"
    ],
    [
      "NORP",
      "bhikkhus"
    ],
    [
      "NORP",
      "bhikkhus"
    ],
    [
      "PERSON",
      "Venerable Sariputta"
    ]
  ]
}
{
  "text": "On one occasion the Blessed One was staying near Sāvatthī in Jeta's Grove, Anāthapiṇḍika's monastery. Then Anāthapiṇḍika the householder went to the Blessed One and, on arrival, bowed down to him and sat to one side. As he was sitting there, the Blessed One said to him, \"Householder, are gifts still given in your family?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Sāvatthī"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anāthapiṇḍika's monastery"
    ],
    [
      "PERSON",
      "Anāthapiṇḍika"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Savatthi, in Jeta's Grove, Anathapindika's monastery. And on that occasion Anathapindika the householder was diseased, in pain, severely ill. Then Anathapindika the householder said to one of his men, \"Come, my good man. Go to the Blessed One and, on arrival, pay homage to his feet with your head in my name and say 'Lord, Anathapindika the householder is diseased, in pain, severely ill. He pays homage with his head to the Blessed One's feet.' Then go to Ven. Sariputta and, on arrival, pay homage to his feet with your head in my name and say 'Venerable sir, Anathapindika the householder is diseased, in pain, severely ill. He pays homage with his head to your feet.' Then say: 'It would be good if Ven. Sariputta would visit Anathapindika's home, out of sympathy for him.'\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's monastery"
    ],
    [
      "PERSON",
      "Anathapindika"
    ],
    [
      "PERSON",
      "Anathapindika"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Anathapindika"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Ven. Sariputta"
    ],
    [
      "PERSON",
      "Anathapindika"
    ],
    [
      "PERSON",
      "Ven. Sariputta"
    ],
    [
      "PERSON",
      "Anathapindika"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Rajagaha on Vulture's Peak Mountain. Then early in the morning, Ven. Sariputta put on his robes and, carrying his bowl and outer robe, was coming down from Vulture's Peak Mountain with a large group of monks when he saw a large wood pile off to one side. Seeing it, he said to the monks, \"Friends, do you see that large wood pile over there?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Rajagaha"
    ],
    [
      "LOC",
      "Vulture's Peak Mountain"
    ],
    [
      "PERSON",
      "Ven. Sariputta"
    ],
    [
      "LOC",
      "Vulture's Peak Mountain"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "monks"
    ]
  ]
}

{
  "text": "I have heard that on one occasion the Blessed One was staying among the Sakyans at Kapilavatthu in the Banyan Park. Now at that time a new reception hall [1] had just been built by the Kapilavatthu Sakyans, and it had not yet been dwelled in by any contemplative, brahman, or anyone at all in human form. So the Kapilavatthu Sakyans went to the Blessed One and, on arrival, having bowed down, sat to one side. As they were sitting there they said to him, \"Lord, a new reception hall has just been built by the Kapilavatthu Sakyans, and it has not yet been dwelled in by any contemplative, brahman, or anyone at all in human form. May the Blessed One be the first to use it. When the Blessed One has used it first, the Kapilavatthu Sakyans will use it afterwards. That will be for their long-term welfare & happiness.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Sakyans"
    ],
    [
      "GPE",
      "Kapilavatthu"
    ],
    [
      "LOC",
      "Banyan Park"
    ],
    [
      "GPE",
      "Kapilavatthu"
    ],
    [
      "NORP",
      "Sakyans"
    ],
    [
      "NORP",
      "brahman"
    ],
    [
      "GPE",
      "Kapilavatthu"
    ],
    [
      "NORP",
      "Sakyans"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Kapilavatthu"
    ],
    [
      "NORP",
      "Sakyans"
    ],
    [
      "NORP",
      "brahman"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Kapilavatthu"
    ],
    [
      "NORP",
      "Sakyans"
    ]
  ]
}



>>>>>>>>>>>>>>>>>
{
  "text": "I have heard that on one occasion the Blessed One was staying among the Mallans near a Mallan town named Uruvelakappa. Then early in the morning the Blessed One, having put on his robes and carrying his bowl and outer robe, went into Uruvelakappa for alms. Having gone into Uruvelakappa for alms, after his meal, on his return from his alms round, he said to Ven. Ananda , \"Stay right here, Ananda, while I go into the Great Wood for the day's abiding.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Mallans"
    ],
    [
      "LOC",
      "Mallan town"
    ],
    [ 
      "GPE",
      "Uruvelakappa"
    ],
    [ "GPE", "Uruvelakappa"],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Ven. Ananda"
    ],
    [
      "PERSON",
      ","
    ],
    [
      "PERSON",
      "Ananda"
    ],
    [
      "LOC",
      "Great Wood"
    ]
  ]
}
<<<<<<<<<<<<<<<<<<<<<<<<
{
  "text": "I have heard that on one occasion Ven. Sariputta was staying near Rajagaha in the Bamboo Grove, the Squirrels' Feeding Sanctuary. There he said to the monks, \"This Unbinding is pleasant, friends. This Unbinding is pleasant.\"",
  "entities": [
    [
      "PERSON",
      "Ven. Sariputta"
    ],
    [
      "GPE",
      "Rajagaha"
    ],
    [
      "LOC",
      "Bamboo Grove"
    ],
    [
      "LOC",
      "Squirrels' Feeding Sanctuary"
    ],
    [
      "NORP",
      "monks"
    ]
    

  ]
}
{"text": "On one occasion the Blessed One was staying near Alavi at the Aggalava Shrine . Then Hatthaka of Alavi, surrounded by approximately 500 [other] lay followers, went to the Blessed One. On arrival, having bowed down to the Blessed One, he sat to one side. As he was sitting there the Blessed One said to him, \"Large is your following, Hatthaka. How have you won over this large following?\"", "entities": [["PERSON", "Blessed One"], [ "GPE", "Alavi"], [ "LOC", "Aggalava Shrine"], [ "NORP", "Hatthaka"], [ "GPE",  "Alavi"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["NORP",  "Hatthaka"] ] }
{
  "text": "Then a certain monk went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there, he said to the Blessed One, \"Lord, what is the cause, what is the reason, why uncertainty doesn't arise in an instructed disciple of the noble ones over the undeclared issues?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "noble ones"
    ]
  ]
}
{
  "text": "1. Thus have I heard. Once the Blessed One [1] dwelt at Rajagaha , on the hill called Vultures' Peak. At that time the king of Magadha , Ajatasattu, son of the Videhi queen, [2] desired to wage war against the Vajjis . He spoke in this fashion: \"These Vajjis, powerful and glorious as they are, I shall annihilate them, I shall make them perish, I shall utterly destroy them.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Rajagaha"
    ],
    [
      "LOC",
      "Vultures' Peak"
    ],
    [
      "GPE",
      "Magadha"
    ],
    [
      "PERSON",
      "Ajatasattu"
    ],
    [
      "PERSON",
      "Videhi queen"
    ],
    [
      "NORP",
      "Vajjis"
    ],
    [
      "NORP",
      "Vajjis"
    ]
  ]
}
{"text": "I have heard that on one occasion the Blessed One, on a wandering tour among the Kosalans with a large community of monks, arrived at a Kosalan brahman village named Icchanangala . There he stayed in the Icchanangala forest grove.",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Kosalans"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Kosalan"
    ],
    [
      "NORP",
      "brahman"
    ],
    [
      "NORP",
      "Icchanangala"
    ],
    [
      "NORP",
      "Icchanangala"
    ]
  ]
}


{
  "text": "\"Monks, these four are ignoble searches. Which four? There is the case where a person, being subject himself to aging, seeks [happiness in] what is subject to aging. Being subject himself to illness, he seeks [happiness in] what is subject to illness. Being subject himself to death, he seeks [happiness in] what is subject to death. Being subject himself to defilement, he seeks [happiness in] what is subject to defilement. These are four ignoble searches.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, these five are things that weaken the training. Which five? The taking of life, stealing, sexual misconduct, the telling of lies, and distilled & fermented beverages that are a cause for heedlessness. These five are things that weaken the training.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"I will teach you the penetrative explanation that is a Dhamma explanation. Listen & pay close attention. I will speak.\"",
  "entities": [
  ]
}
{
  "text": "\"Monks, these three are fabricated characteristics of what is fabricated. Which three? Arising is discernible, passing away is discernible, alteration (literally, other-ness) while staying is discernible.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying at Varanasi in the Game Refuge at Isipatana . Then early in the morning the Blessed One, having put on his robes and carrying his bowl & outer robe, went into Varanasi for alms. As he was walking for alms near the fig-tree at the cattle yoke, he saw a certain monk whose delight was in what is empty, whose delight was in exterior things, his mindfulness muddled, his alertness lacking, his concentration lacking, his mind gone astray, his faculties uncontrolled. On seeing him, the Blessed One said to him: \"Monk, monk, don't let yourself putrefy! On one who lets himself putrefy & stink with the stench of carrion, there's no way that flies won't swarm & attack!\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Varanasi"
    ],
    [
      "LOC",
      "Game Refuge"
    ],
    [
      "GPE",
      "Isipatana"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Varanasi"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery. There he addressed the monks, \"Monks!\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's monastery"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
>>>>>>>>>>>>>>>>>>
{
  "text": "Then Ven. Ananda went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there, the Blessed One said to him, \"I say categorically, Ananda, that bodily misconduct, verbal misconduct, & mental misconduct should not be done.\"",
  "entities": [
    [
      "PERSON",
      "Ven. Ananda"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      ","
    ],
    [
      "PERSON",
      "Ananda"
    ]
  ]
}
<<<<<<<<<<<<

{
  "text": "Then Ven. Ananda went to the Blessed One and, on arrival, bowed down to him and sat to one side. As he was sitting there he said to the Blessed One, \"Lord, this word, 'becoming, becoming' — to what extent is there becoming?\" [1]",
  "entities": [
    [
      "PERSON",
      "Ven. Ananda"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying among the Sakyans at Kapilavatthu in the Banyan Park . Now at that time Mahanama the Sakyan had recovered from being ill, was not long recovered from his illness. And at that time many monks were at work making robes for the Blessed One, [thinking], \"When the robes are finished, at the end of the three months, [1] the Blessed One will set out wandering.\" Mahanama the Sakyan heard that many monks were at work making robes for the Blessed One, [thinking], \"When the robes are finished, at the end of the three months, the Blessed One will set out wandering.\" So he approached the Blessed One and, on arrival, having bowed down, sat to one side. As he was sitting there he said to the Blessed One: \"I have heard that many monks are at work making robes for the Blessed One, [thinking], 'When the robes are finished, at the end of the three months, the Blessed One will set out wandering.' For those of us living by means of various dwelling places [for the mind], by means of which dwelling place should we live?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Sakyans"
    ],
    [
      "GPE",
      "Kapilavatthu"
    ],
    [
      "LOC",
      "Banyan Park"
    ],
    [
      "NORP",
      "Sakyan"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Sakyan"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}


{
  "text": "I have heard that on one occasion the Blessed One was staying at Savatthi , in Jeta's Grove, Anathapindika's monastery . Then early in the morning, having put on his robes and carrying his bowl & outer robe, he went into Savatthi for alms. Then a large number of monks went to Ven. Ananda and said, \"It has been a long time, friend Ananda, since we have heard a Dhamma talk in the Blessed One's presence. It would be good if we could get to hear a Dhamma talk in the Blessed One's presence.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's monastery"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "PERSON",
      "Ven. Ananda"
    ],
    [
      "PERSON",
      "Ananda"
    ],
    
    [
      "PERSON",
      "Blessed One"
    ],
  
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}

{
  "text": "I have heard that on one occasion the Blessed One was staying at Savatthi , in Jeta's Grove, Anathapindika's Monastery . Then Ven. Maha Kotthita , arising from his seclusion in the late afternoon, went to Ven. Sariputta and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side.",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's Monastery"
    ],
    [
      "PERSON",
      "Ven. Maha Kotthita"
    ],
    [
      "PERSON",
      "Ven. Sariputta"
    ]
  ]
}

{
  "text": "I have heard that on one occasion the Blessed One was staying among the Sakyans at Kapilavatthu in the Banyan Park . Now at that time the Blessed One had just recovered from being ill, was not long recovered from his illness. Then Mahanama the Sakyan went to the Blessed One and, on arrival, having bowed down, sat to one side. As he was sitting there he said to the Blessed One: \"For a long time I have known the Dhamma taught by the Blessed One that 'There is knowledge for one who is concentrated, not for one who is not concentrated.' Now, does concentration come first, and knowledge after, or does knowledge come first, and concentration after?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Sakyans"
    ],
    [
      "GPE",
      "Kapilavatthu"
    ],
    [
      "LOC",
      "Banyan Park"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Mahanama"
    ],
    [
      "NORP",
      "Sakyan"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
   
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": ". Thus have I heard. On one occasion the Blessed One was living in the Koliyan country: there is a town of the Koliyans called Haliddavasana .",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Koliyan"
    ],
    [
      "NORP",
      "Koliyans"
    ]
  ]
}
{
  "text": "\"Monks, a person endowed with these four qualities can be known as 'a person of no integrity.' Which four?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "On one occasion Ven. MahaCunda was staying among the Cetis at Sahajati . There he addressed the monks, \"Monks, my friends.\"",
  "entities": [
    [
      "NORP",
      "Cetis"
    ],
    [
      "GPE",
      "Sahajati"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "Thus have I heard. Once the Blessed One lived at Saavatthii, in Jeta's Grove, in Anaathapindika's monastery.",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Saavatthii"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anaathapindika's monastery"
    ]
  ]
}
{
  "text": "Then Ven. Sariputta went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the Blessed One, \"What is the reason, lord, what is the cause why a certain trade, when engaged in by some people, turns out a failure? What is the reason, what is the cause why the same sort of trade, when engaged in by other people, turns out not as intended? What is the reason, what is the cause why the same sort of trade, when engaged in by other people, turns out as intended? What is the reason, what is the cause why the same sort of trade, when engaged in by other people, turns out better than intended?\"",
  "entities": [
    [
      "PERSON",
      "Ven. Sariputta"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "I have heard that on one occasion Ven. Ananda was staying in Kosambi , at Ghosita 's Park. Then a certain nun said to a certain man, \"Go, my good man, to my lord Ananda and, on arrival, bowing your head to his feet in my name, tell him, 'The nun named such-and-such, venerable sir, is sick, in pain, severely ill. She bows her head to the feet of her lord Ananda and says, \"It would be good if my lord Ananda were to go to the nuns' quarters, to visit this nun out of sympathy for her.\"'\"",
  "entities": [
    [
      "PERSON",
      "Ven. Ananda"
    ],
    [
      "GPE",
      "Kosambi"
    ],
    [
      "LOC",
      "Ghosita 's Park"
    ],
    [
      "PERSON",
      "Ananda"
    ],
    [
      "PERSON",
      "Ananda"
    ],
    [
      "PERSON",
      "Ananda"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Rājagaha at the Bamboo Grove in the Squirrels' sanctuary. And on that occasion Ven. Samiddhi was staying in a wilderness hut. Then Potaliputta the wanderer, while walking & wandering around to exercise his legs, went to Ven. Samiddhi and exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to Ven. Samiddhi, \"Face to face with Gotama the contemplative have I heard this, face to face have I learned this: 'Bodily action is barren, verbal action is barren, only mental action is true. And there is an attainment in which, on being attained, nothing is felt.'\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Rājagaha"
    ],
    [
      "LOC",
      "Bamboo Grove"
    ],
    [
      "PERSON",
      "Ven. Samiddhi"
    ],
    [
      "PERSON",
      "Ven. Samiddhi"
    ],
    [
      "PERSON",
      "Ven. Samiddhi"
    ],
    [
      "PERSON",
      "Gotama"
    ]
  ]
}
{
  "text": "I have heard that on one occasion, when the Blessed One was on a wandering tour among the Kosalans with a large community of monks, he arrived at the brahman village called Sala . The brahman householders heard, \"Master Gotama the contemplative — the son of the Sakyans, having gone forth from the Sakyan clan — on a wandering tour among the Kosalans with a large community of monks — has arrived at Sala. And of that master Gotama this fine reputation has spread: 'He is indeed a Blessed One, an arahant, rightly self-awakened: consummate in knowledge & conduct, well-gone, a knower of the cosmos, an unexcelled trainer of those persons ready to be tamed, teacher of human & divine beings, awakened, blessed. He has made known — having realized it through direct knowledge — this world with its devas, maras, & brahmas, its generations with their contemplatives & brahmans, their rulers & common people. He has explained the Dhamma admirable in the beginning, admirable in the middle, admirable in the end; has expounded the holy life both in its particulars & in its essence, entirely perfect, surpassingly pure. It is good to see such a worthy one.'\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Kosalans"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "brahman"
    ],
    [
      "NORP",
      "brahman"
    ],
    [
      "NORP",
      "householders"
    ],
    [
      "PERSON",
      "Master Gotama"
    ],
    [
      "NORP",
      "Sakyans"
    ],
    [
      "NORP",
      "Sakyan"
    ],
    [
      "NORP",
      "Kosalans"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "PERSON",
      "master Gotama"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "brahmans"
    ]
  ]
}
{
  "text": "\"Endowed with eight qualities, a king's auspicious thoroughbred steed is worthy of a king, is a king's asset, counts as a very limb of his king. Which eight?",
  "entities": [
    [
      "PERSON",
      "king. Which"
    ]
  ]
}
{
  "text": "\"Monks, there are these four modes of practice. Which four? Painful practice with slow intuition, painful practice with quick intuition, pleasant practice with slow intuition, & pleasant practice with quick intuition.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "Once the Blessed One was staying among the Bhaggas in the Deer Park at Bhesakala Grove, near Crocodile Haunt. And at that time Ven. Anuruddha was living among the Cetis in the Eastern Bamboo Park. Then, as he was alone in seclusion, this line of thinking arose in Ven. Anuruddha's awareness: \"This Dhamma is for one who is modest, not for one who is self-aggrandizing. This Dhamma is for one who is content, not for one who is discontent. This Dhamma is for one who is reclusive, not for one who is entangled. This Dhamma is for one whose persistence is aroused, not for one who is lazy. This Dhamma is for one whose mindfulness is established, not for one whose mindfulness is confused. This Dhamma is for one whose mind is centered, not for one whose mind is uncentered. This Dhamma is for one endowed with discernment, not for whose discernment is weak.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Bhaggas"
    ],
    [
      "LOC",
      "Deer Park"
    ],
    [
      "LOC",
      "Bhesakala Grove"
    ],
    [
      "LOC",
      "Crocodile Haunt"
    ],
    [
      "PERSON",
      "Ven. Anuruddha"
    ],
    [
      "NORP",
      "Cetis"
    ],
    [
      "LOC",
      "Bamboo Park"
    ],
    [
      "PERSON",
      "Ven. Anuruddha"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying at Savatthi , in Jeta's Grove, Anathapindika 's monastery. There he addressed the monks, \"Monks!\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika 's monastery"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "On one occasion the Blessed One was staying near Alavi on a spread of leaves by a cattle track in a simsapa forest. Then Hatthaka of Alavi , out roaming & rambling for exercise, saw the Blessed One sitting on a spread of leaves by the cattle track in the simsapa forest. On seeing him, he went to him and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the Blessed One, \"Lord, I hope the Blessed One has slept in ease.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "\"There are these three governing principles. Which three? The self as a governing principle, the cosmos as a governing principle, and the Dhamma as a governing principle.",
  "entities": [
  ]
}
{
  "text": "Then Anathapindika the householder, surrounded by about 500 lay followers, went to the Blessed One and, on arrival, having bowed down to him, sat to one side. So the Blessed One said to Ven. Sariputta : \"Sariputta, when you know of a householder clothed in white, that he is restrained in terms of the five training rules and that he obtains at will, without difficulty, without hardship, four pleasant mental abidings in the here & now, then if he wants he may state about himself: 'Hell is ended; animal wombs are ended; the state of the hungry shades is ended; states of deprivation, destitution, the bad bourns are ended! I am a stream-winner, steadfast, never again destined for states of woe, headed for self-awakening!'",
  "entities": [
    [
      "PERSON",
      "Anathapindika"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Ven. Sariputta"
    ],
    [
      "PERSON",
      "Sariputta"
    ]
  ]
}
{
  "text": "Then Ven. Ananda went to Ven. Sariputta and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to Ven. Sariputta, \"Friend Sariputta, what is the cause, what is the reason, why some beings do not become totally unbound in the present life?\"",
  "entities": [
    [
      "PERSON",
      "Ven. Ananda"
    ],
    [
      "PERSON",
      "Ven. Sariputta"
    ],
    [
      "PERSON",
      "Ven. Sariputta"
    ],
    [
      "PERSON",
      "Sariputta"
    ]
  ]
}
{
  "text": "\"Monks, there are these three roots of what is unskillful. Which three? Greed is a root of what is unskillful, aversion is a root of what is unskillful, delusion is a root of what is unskillful.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, this recitation of more than 150 training rules comes every fortnight, in reference to which sons of good families desiring the goal train themselves. [1] There are these three trainings under which all that is gathered. Which three? The training in heightened virtue, the training in heightened mind, the training in heightened discernment. [2]",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Pava in Cunda the silversmith's mango grove. Then Cunda the silversmith went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there, the Blessed One said to him: \"Cunda, of whose rites of purification do you approve?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Cunda"
    ],
    [
      "LOC",
      "mango grove"
    ],
    [
      "PERSON",
      "Cunda"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Cunda"
    ]
  ]
}
{
  "text": "\"Monks, there are these seven treasures. Which seven? The treasure of conviction, the treasure of virtue, the treasure of conscience, the treasure of concern, the treasure of listening, the treasure of generosity, the treasure of discernment.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, I don't speak of the wiping out of intentional acts that have been done & accumulated without [their results] having been experienced, either in the here & now or in a further state hereafter. Nor do I speak of the act of putting an end to suffering and stress without having experienced [the results of] intentional acts that have been done & accumulated. [1]",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"There are these five inhabitants of the states of deprivation, inhabitants of hell, who are in agony & incurable. Which five? One who has killed his/her mother, one who has killed his/her father, one who has killed an arahant, one who — with a corrupted mind — has caused the blood of a Tathagata to flow, and one who has caused a split in the Sangha. These are the five inhabitants of the states of deprivation, inhabitants of hell, who are in agony & incurable.\"",
  "entities": [
    [
      "PERSON",
      "Tathagata"
    ],
    [
      "NORP",
      "Sangha"
    ]
  ]
}
{
  "text": "At one time, the Venerable Sāriputta was dwelling near the small village of Nālaka in Magadha . And then, there where Venerable Sāriputta was, there Sāmaṇḍakāni , the wanderer, approached. Having approached, he exchanged greetings with the Venerable Sāriputta. Having exchanged greetings, and courteous talk having passed between them, he sat to one side. Having sat to one side, Sāmaṇḍakāni, the wanderer, said this to Venerable Sāriputta:",
  "entities": [
    [
      "PERSON",
      "Venerable Sāriputta"
    ],
    [
      "GPE",
      "Magadha"
    ],
    [
      "PERSON",
      "Venerable Sāriputta"
    ],
    [
      "PERSON",
      "Venerable Sāriputta"
    ],
    [
      "PERSON",
      "Venerable Sāriputta"
    ]
  ]
}
{
  "text": ". Thus have I heard. On one occasion the Blessed One was living at Rajagaha , in the Bamboo Grove, the Squirrels' Feeding Place. Now on that occasion the venerable Samiddhi was living in a forest hut.",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Rajagaha"
    ],
    [
      "LOC",
      "Bamboo Grove"
    ],
    [
      "LOC",
      "Squirrels' Feeding Place"
    ],
    [
      "PERSON",
      "venerable Samiddhi"
    ]
  ]
}
{
  "text": "Then a certain brahman approached the Blessed One; having approached the Blessed One, he exchanged friendly greetings. After pleasant conversation had passed between them, he sat to one side. Having sat to one side, the brahman spoke to the Blessed One thus:",
  "entities": [
    [
      "NORP",
      "brahman"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "brahman"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "\"Monks, there are these four types of individuals to be found existing in the world. Which four?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One, on a wandering tour among the Kosalans with a large community of monks, arrived at Kesaputta , a town of the Kalamas . The Kalamas of Kesaputta heard it said, \"Gotama the contemplative — the son of the Sakyans, having gone forth from the Sakyan clan — has arrived at Kesaputta. And of that Master Gotama this fine reputation has spread: 'He is indeed a Blessed One, worthy, & rightly self-awakened, consummate in knowledge & conduct, well-gone, a knower of the cosmos, an unexcelled trainer of those persons ready to be tamed, teacher of human & divine beings, awakened, blessed. He has made known — having realized it through direct knowledge — this world with its devas, maras, & brahmas, its generations with their contemplatives & brahmans, their rulers & common people; has explained the Dhamma admirable in the beginning, admirable in the middle, admirable in the end; has expounded the holy life both in its particulars & in its essence, entirely perfect, surpassingly pure. It is good to see such a worthy one.'\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Kosalans"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "GPE",
      "Kesaputta"
    ],
    [
      "NORP",
      "Kalamas"
    ],
    [
      "NORP",
      "Kalamas"
    ],
    [
      "GPE",
      "Kesaputta"
    ],
    [
      "PERSON",
      "Gotama"
    ],
    [
      "NORP",
      "Sakyans"
    ],
    [
      "NORP",
      "Sakyan"
    ],
    [
      "GPE",
      "Kesaputta"
    ],
    [
      "PERSON",
      "Master Gotama"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "brahmans"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying among the Kajjangalas in the Bamboo Grove. Then the young brahman Uttara , a student of Parasiri [1] went to the Blessed One and, on arrival, exchanged friendly greetings & courtesies. After this exchange of courteous greetings he sat to one side.",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Kajjangalas"
    ],
    [
      "LOC",
      "Bamboo Grove"
    ],
    [
      "NORP",
      "brahman"
    ],
    [
      "PERSON",
      "Uttara"
    ],
    [
      "PERSON",
      "Parasiri"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "\"Monks, there are these three topics for discussion. Which three?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "31 . \"Monks, I know not of any other single thing so intractable as the untamed mind. The untamed mind is indeed a thing untractable.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Sāvatthī in Jeta's Grove, Anāthapiṇḍika's monastery. Then Piṅgalakoccha the brahman went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there, he said to the Blessed One, \"Master Gotama, these contemplatives & brahmans, each with his group, each with his community, each the teacher of his group, an honored leader, well-regarded by people at large — i.e., Pūraṇa Kassapa , Makkhali Gosāla , Ajita Kesakambalin , Pakudha Kaccāyana , Sañjaya Velaṭṭhaputta , & the Nigaṇṭha Nāṭaputta : Do they all have direct knowledge as they themselves claim, or do they all not have direct knowledge, or do some of them have direct knowledge and some of them not?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Sāvatthī"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anāthapiṇḍika's monastery"
    ],
    [
      "NORP",
      "brahman"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Master Gotama"
    ],
    [
      "NORP",
      "brahmans"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Savatthi at Jeta's Grove, Anathapindika's monastery. Then, early in the morning, several monks put on their robes and, carrying their bowls and outer robes, went into Savatthi for alms. The thought occurred to them, \"It's still too early to go into Savatthi for alms. What if we were to visit the park of the wanderers of other persuasions?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's monastery"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "NORP",
      "wanderers"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Sāvatthī in Jeta's Grove, Anāthapiṇḍika's monastery. There the Blessed One addressed the monks, \"Monks.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Sāvatthī"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anāthapiṇḍika's monastery"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Rajagaha , on Vulture Peak Mountain. And on that occasion Ven. Sona was staying near Rajagaha in the Cool Wood. Then, as Ven. Sona was meditating in seclusion [after doing walking meditation until the skin of his soles was split & bleeding], this train of thought arose in his awareness: \"Of the Blessed One's disciples who have aroused their persistence, I am one, but my mind is not released from the fermentations through lack of clinging/sustenance. Now, my family has enough wealth that it would be possible to enjoy wealth & make merit. What if I were to disavow the training, return to the lower life, enjoy wealth, & make merit?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Rajagaha"
    ],
    [
      "LOC",
      "Vulture Peak Mountain"
    ],
    [
      "PERSON",
      "Ven. Sona"
    ],
    [
      "GPE",
      "Rajagaha"
    ],
    [
      "LOC",
      "Cool Wood"
    ],
    [
      "PERSON",
      "Ven. Sona"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "\"Monks, these nine perceptions, when developed & pursued, are of great fruit, of great benefit. They gain a footing in the deathless and have the deathless as their final end. Which nine?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying at Savatthi in the Eastern Monastery, the palace of Migara 's mother, together with many well-known elder disciples — with Ven. Sariputta , Ven. Maha Moggallana , Ven. Maha Kassapa , Ven. Maha Kaccana , Ven. Maha Kotthita , Ven. Maha Kappina , Ven. Maha Cunda , Ven. Revata , Ven. Ananda , and other well-known elder disciples. On that occasion the elder monks were teaching & instructing. Some elder monks were teaching & instructing ten monks, some were teaching & instructing twenty monks, some were teaching & instructing thirty monks, some were teaching & instructing forty monks. The new monks, being taught & instructed by the elder monks, were discerning grand, successive distinctions.",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Eastern Monastery"
    ],
    [
      "PERSON",
      "Ven. Sariputta"
    ],
    [
      "PERSON",
      "Ven. Maha Moggallana"
    ],
    [
      "PERSON",
      "Ven. Maha Kassapa"
    ],
    [
      "PERSON",
      "Ven. Maha Kaccana"
    ],
    [
      "PERSON",
      "Ven. Maha Kotthita"
    ],
    [
      "PERSON",
      "Ven. Maha Kappina"
    ],
    [
      "PERSON",
      "Ven. Maha Cunda"
    ],
    [
      "PERSON",
      "Ven. Revata"
    ],
    [
      "PERSON",
      "Ven. Ananda"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "monks"
    ]
  ]
}
{
  "text": "Thus I heard. On one occasion the venerable Nandaka was living at Savatthi in the Eastern Monastery, Migara 's Mother's Palace. Then Migara 's grandson, Salha , and Pekhuniya 's grandson, Rohana , went to the venerable Nandaka, and after salutation they sat down at one side. When they had done so the venerable Nandaka said to Migara's grandson Salha:",
  "entities": [
    [
      "PERSON",
      "venerable Nandaka"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Eastern Monastery"
    ],
    [
      "PERSON",
      "venerable Nandaka"
    ],
    [
      "PERSON",
      "venerable Nandaka"
    ]
  ]
}
{
  "text": "I have heard that at one time the Blessed One was staying at Nadika , in the Brick Hall. There he addressed the monks, \"Monks, mindfulness of death — when developed & pursued — is of great fruit & great benefit. It gains a footing in the Deathless, has the Deathless as its final end. And how is mindfulness of death developed & pursued so that it is of great fruit & great benefit, gains a footing in the Deathless, and has the Deathless as its final end?",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Nadika"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, if you are asked by wanderers of other sects, 'Friends, there are these three qualities. Which three? Passion, aversion, & delusion. These are the three qualities. Now what is the difference, what the distinction, what the distinguishing factor among these three qualities?' — when thus asked, how would you answer those wanderers of other sects?\"",
  "entities": [
    [
      "NORP",
      "Monks"
    ],
    [
      "NORP",
      "wanderers"
    ],
    [
      "NORP",
      "wanderers"
    ]
  ]
}
{
  "text": "\"These four types of individuals are to be found existing in the world. Which four? The individual who goes with the flow, the individual who goes against the flow, the individual who stands fast, and the one who has crossed over, gone beyond, who stands on firm ground: a brahman.",
  "entities": [
    [
      "NORP",
      "brahman"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying at Savatthi , in Jeta's Grove, Anathapindika's monastery. There he addressed the monks: \"Monks!\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's monastery"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "On one occasion Ven. Uttara was staying in Mahisavatthu [Water Buffalo Ground] on Sankheyyaka Mountain in Dhavajalika . There he addressed the monks:",
  "entities": [
    [
      "PERSON",
      "Ven. Uttara"
    ],
    [
      "NORP",
      "monks"
    ]
  ]
}
{
  "text": "\"Monks, these two are fools. Which two? The one who takes up a burden that hasn't fallen to him, and the one who doesn't take up a burden that has. These two are fools.\"",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Savatthi at Jeta's Grove, Anathapindika 's monastery. Then, as Ven. Malunkyaputta was alone in seclusion, this train of thought arose in his awareness: \" These positions that are undeclared, set aside, discarded by the Blessed One — 'The cosmos is eternal,' 'The cosmos is not eternal,' 'The cosmos is finite,' 'The cosmos is infinite,' 'The soul & the body are the same,' 'The soul is one thing and the body another,' 'After death a Tathagata exists,' 'After death a Tathagata does not exist,' 'After death a Tathagata both exists & does not exist,' 'After death a Tathagata neither exists nor does not exist' — I don't approve, I don't accept that the Blessed One has not declared them to me. I'll go ask the Blessed One about this matter. If he declares to me that 'The cosmos is eternal,' that 'The cosmos is not eternal,' that 'The cosmos is finite,' that 'The cosmos is infinite,' that 'The soul & the body are the same,' that 'The soul is one thing and the body another,' that 'After death a Tathagata exists,' that 'After death a Tathagata does not exist,' that 'After death a Tathagata both exists & does not exist,' or that 'After death a Tathagata neither exists nor does not exist,' then I will live the holy life under him. If he does not declare to me that 'The cosmos is eternal,'... or that 'After death a Tathagata neither exists nor does not exist,' then I will renounce the training and return to the lower life.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika 's monastery"
    ],
    [
      "PERSON",
      "Ven. Malunkyaputta"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Tathagata"
    ],
    [
      "PERSON",
      "Tathagata"
    ],
    [
      "PERSON",
      "Tathagata"
    ],
    [
      "PERSON",
      "Tathagata"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Tathagata"
    ],
    [
      "PERSON",
      "Tathagata"
    ],
    [
      "PERSON",
      "Tathagata"
    ],
    [
      "PERSON",
      "Tathagata"
    ],
    [
      "PERSON",
      "Tathagata"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Campa , on the shore of Gaggara Lake . Then Vajjiya Mahita the householder left Campa in the middle of the day to see the Blessed One, but the thought then occurred to him, \"Now is not the right time to see the Blessed One, for he is in seclusion. And it is not the right time to see the monks who develop the mind, for they are in seclusion. What if I were to visit the park of the wanderers of other persuasions?\" So he headed to the park of the wanderers of other persuasions.",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Campa"
    ],
    [
      "NORP",
      "Vajjiya"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "wanderers"
    ],
    [
      "NORP",
      "wanderers"
    ]
  ]
}
{
  "text": "Then Anathapindika the householder went to the Blessed One and, on arrival, having bowed down to the Blessed One, sat to one side. As he was sitting there, the Blessed One said to him, \"When, for a disciple of the noble ones, five forms of fear & animosity are stilled; when he is endowed with the four factors of stream-entry; and when, through discernment, he has rightly seen & rightly ferreted out the noble method, then if he wants he may state about himself: 'Hell is ended; animal wombs are ended; the state of the hungry shades is ended; states of deprivation, destitution, the bad bourns are ended! I am a stream-winner, steadfast, never again destined for states of woe, headed for self-awakening!'",
  "entities": [
    [
      "PERSON",
      "Anathapindika"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "On one occasion the Blessed One was staying near Alavi at the Aggalava Shrine . There he addressed the monks: \"Monks, remember Hatthaka of Alavi as being endowed with seven amazing, astounding qualities. Which seven? Monks, Hatthaka of Alavi is endowed with conviction. He is virtuous. He has a sense of conscience. He has a sense of concern. [1] He is learned. He is generous. He is discerning. Remember Hatthaka of Alavi as being endowed with these seven amazing, astounding qualities.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Endowed with these six qualities, a person is incapable of alighting on the lawfulness, the rightness of skillful mental qualities even when listening to the true Dhamma. Which six?",
  "entities": [
  
  ]
}
{
  "text": "Then Uttiya the wanderer went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to the Blessed One,",
  "entities": [
    [
      "PERSON",
      "Uttiya"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "\"Monks, when right view is supported by five factors, it has awareness-release as its fruit, awareness-release as its reward; it has discernment-release as its fruit, discernment-release as its reward. Which five?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\" Monks , the great sal trees that live in dependence on the Himalayas , the king of mountains, prosper in terms of three kinds of prosperity. Which three? They prosper in terms of branches, leaves, & foliage. They prosper in terms of bark & shoots. They prosper in terms of softwood and heartwood. The great sal trees that grow in dependence on the Himalayas, the king of mountains, prosper in terms of these three kinds of prosperity.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, these seven perceptions , when developed & pursued, are of great fruit, of great benefit. They gain a footing in the Deathless, have the Deathless as their final end. Which seven? The perception of the unattractive, the perception of death, the perception of loathsomeness in food, the perception of distaste for every world, the perception of inconstancy, the perception of stress in what is inconstant, the perception of not-self in what is stressful.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, for one whose awareness-release through good will is cultivated, developed, pursued, handed the reins and taken as a basis, given a grounding, steadied, consolidated, and well-undertaken, eleven benefits can be expected. Which eleven?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying in the Kuru country. Now there is a town of the Kurus called Kammasadhamma. There the Blessed One addressed the monks: \"Monks!\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Kuru"
    ],
    [
      "NORP",
      "Kurus"
    ],
    [
      "GPE",
      "Kammasadhamma"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "On one occasion Ven. Ananda was staying in Kosambi at Ghosita's Park. Then Ven. Udayin went to him and, on arrival, exchanged courteous greetings. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to Ven. Ananda, \"This has been said by Pañcalacanda the deva's son:",
  "entities": [
    [
      "PERSON",
      "Ven. Ananda"
    ],
    [
      "GPE",
      "Kosambi"
    ],
    [
      "LOC",
      "Ghosita's Park"
    ],
    [
      "PERSON",
      "Ven. Udayin"
    ],
    [
      "PERSON",
      "Ven. Ananda"
    ]
  ]
}
{
  "text": "On one occasion the Blessed One was staying in Saketa at Kalaka's park. There he addressed the monks: \"Monks!\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Saketa"
    ],
    [
      "LOC",
      "Kalaka's park"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying at Ukkattha , in the shade of a royal Sal tree in the Very Blessed Grove. There he addressed the monks, \"Monks!\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, a lay follower should not engage in five types of business. Which five? Business in weapons, business in human beings, business in meat, business in intoxicants, and business in poison.",
  "entities": [
    [
      "NORP",
      "Monks"
    ],
    [
      "NORP",
      "lay follower"
    ]
  ]
}
{
  "text": "\"Monks, these two slander the Tathagata. Which two? He who explains a discourse whose meaning needs to be inferred as one whose meaning has already been fully drawn out. And he who explains a discourse whose meaning has already been fully drawn out as one whose meaning needs to be inferred. These are two who slander the Tathagata.\"",
  "entities": [
    [
      "NORP",
      "Monks"
    ],
    [
      "PERSON",
      "Tathagata"
    ],
    [
      "PERSON",
      "Tathagata"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying in Rajagaha , at Jivaka's Mango Grove. Then Jivaka Komarabhacca went to the Blessed One and, on arrival, having bowed down, sat to one side. As he was sitting there he said to the Blessed One: \"Lord, to what extent is one a lay follower?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Rajagaha"
    ],
    [
      "LOC",
      "'s"
    ],
    [
      "PERSON",
      "Jivaka Komarabhacca"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was living among the Kurus. Now, the Kurus have a town named Kammasadhamma . There Ven. Ananda approached the Blessed One and, on arrival, having bowed down to the Blessed One, sat to one side. As he was sitting there he said to the Blessed One: \"It's amazing, lord, it's astounding, how deep this dependent co-arising is, and how deep its appearance, and yet to me it seems as clear as clear can be.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Kurus"
    ],
    [
      "NORP",
      "Kurus"
    ],
    [
      "GPE",
      "Kammasadhamma"
    ],
    [
      "PERSON",
      "Ven. Ananda"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "Thus have I heard. Once the Blessed One was wandering among the Kosala people together with a large company of monks. Entering a major path, the Blessed One saw in a certain spot a great mass of fire, burning, blazing, glowing. After seeing it and stepping down from the path he sat on the appointed seat at the root of a tree. After sitting down the Blessed One said to the monks: \"Do you see, monks, that great mass of fire, burning, blazing, glowing?\" — \" Yes, venerable Sir.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Kosala"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "PERSON",
      "venerable Sir"
    ]
  ]
}
{
  "text": "\"Last night, monks, a certain devata in the far extreme of the night, her extreme radiance lighting up the entirety of Jeta's Grove, came to me and, on arrival, bowed down to me and stood to one side. As she was standing there, she said to me, 'These seven qualities, lord, lead to a monk's non-decline. Which seven? Respect for the teacher, respect for the Dhamma, respect for the Sangha, respect for training, respect for concentration, compliance, [1] having admirable friends. These seven qualities, lord, lead to a monk's non-decline.'",
  "entities": [
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "devata"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
  
  ]
}
{
  "text": "These four traditions of the Noble Ones — original, long-standing, traditional, ancient, unadulterated, unadulterated from the beginning — are not open to suspicion, will never be open to suspicion, and are unfaulted by knowledgeable contemplatives and brahmans. Which four?",
  "entities": [
    [
      "NORP",
      "Noble Ones"
    ],
    [
      "NORP",
      "brahmans"
    ]
  ]
}
{
  "text": "\"Monks, these five future dangers, unarisen at present, will arise in the future. Be alert to them and, being alert, work to get rid of them. Which five?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying in the Kuru country. Now there is a town of the Kurus called Kammasadhamma . There the Blessed One addressed the monks, \"Monks.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Kuru"
    ],
    [
      "NORP",
      "Kurus"
    ],
    [
      "GPE",
      "Kammasadhamma"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "Then Ugga , the king's chief minister, approached the Blessed One and, on arrival, having bowed down, sat to one side. As he was sitting there, he said to the Blessed One: \"It's amazing, lord, & awesome, how prosperous Migara Rohaneyya is, how great his treasures, how great his resources!\"",
  "entities": [
    [
      "PERSON",
      "Ugga"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Migara Rohaneyya"
    ]
  ]
}
{
  "text": "Then Anathapindika the householder went to the Blessed One and, on arrival, having bowed to him, sat to one side. As he was sitting there, the Blessed One said to him: \"Householder, when the mind is unprotected, bodily actions are unprotected as well, verbal actions are unprotected as well, mental actions are unprotected as well. When one's bodily actions, verbal actions, & mental actions are unprotected, one's bodily actions get soggy, one's verbal actions get soggy, one's mental actions get soggy. When one's bodily actions, verbal actions, & mental actions are soggy, one's bodily actions... verbal actions... mental actions rot. When one's bodily actions, verbal actions, & mental actions rot, one's death is not auspicious, the mode of one's dying not good.",
  "entities": [
    [
      "PERSON",
      "Anathapindika"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "On one occasion Ven. Ananda was staying near Vesali at Veluvagamaka. Now on that occasion Dasama the householder from Atthakanagara had arrived at Pataliputta on some business. Then he went to a certain monk at Kukkata Monastery and on arrival said to him, \"Where is Ven. Ananda staying now? I'd like to see him.\"",
  "entities": [
    [
      "PERSON",
      "Ven. Ananda"
    ],
    [
      "GPE",
      "Vesali"
    ],
    [
      "GPE",
      "Veluvagamaka"
    ],
    [
      "PERSON",
      "Dasama"
    ],
    [
      "GPE",
      "Atthakanagara"
    ],
    [
      "GPE",
      "Pataliputta"
    ],
    [
      "LOC",
      "Kukkata Monastery"
    ],
    [
      "PERSON",
      "Ven. Ananda"
    ]
  ]
}
{
  "text": "Then Anathapindika the householder went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there the Blessed One said to him: \"There are these four kinds of bliss that can be attained in the proper season, on the proper occasions, by a householder partaking of sensuality. Which four? The bliss of having, the bliss of [making use of] wealth, the bliss of debtlessness, the bliss of blamelessness.",
  "entities": [
    [
      "PERSON",
      "Anathapindika"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery . Then Anathapindika the householder left Savatthi in the middle of the day to see the Blessed One, but the thought then occurred to him, \"Now is not the right time to see the Blessed One, for he is in seclusion. And it is not the right time to see the monks who are developing their minds [in meditation], for they are in seclusion. What if I were to visit the park of the wanderers of other persuasions?\" So he headed to the park of the wanderers of other persuasions.",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's monastery"
    ],
    [
      "PERSON",
      "Anathapindika"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "wanderers"
    ],
    [
      "NORP",
      "wanderers"
    ]
  ]
}
{
  "text": "On one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika 's monastery. There he addressed the monks, \"Monks!\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika 's monastery"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Endowed with these six qualities, a person is incapable of alighting on the lawfulness, the rightness of skillful mental qualities even when listening to the true Dhamma. Which six?",
  "entities": [
  
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying in Savatthi at Jeta's Grove, Anathapindika 's monastery. Now at that time a large number of monks, after the meal, on returning from their alms round, had gathered at the meeting hall and were engaged in many kinds of bestial topics of conversation: conversation about kings, robbers, & ministers of state; armies, alarms, & battles; food & drink; clothing, furniture, garlands, & scents; relatives; vehicles; villages, towns, cities, the countryside; women & heroes; the gossip of the street & the well; tales of the dead; tales of diversity, the creation of the world & of the sea; talk of whether things exist or not.",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika 's monastery"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "kings"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery. Now on that occasion Uggahamana , a follower of Mundika the contemplative, [1] together with a large following of about 500 wanderers, had taken up residence in the debating hall near the Tinduka tree in the single-pavilion park of Queen Mallika . Then Pañcakanga the carpenter left Savatthi in the middle of the day to see the Blessed One, but the thought occurred to him, \"Now is not the right time to see the Blessed One, for he is in seclusion. And it is not the right time to see the mind-developing monks, for they too are in seclusion. Why don't I go to the debating hall near the Tinduka tree in the single-pavilion park of Queen Mallika to see Uggahamana, a follower of Mundika the contemplative?\" So he headed to the debating hall near the Tinduka tree in the single-pavilion park of Queen Mallika.",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's monastery"
    ],
    [
      "NORP",
      "wanderers"
    ],
    [
      "NORP",
      "Pañcakanga"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "monks"
    ]
  ]
}
{
  "text": "Then Ven. Maha Kotthita went to Ven. Sariputta and exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to Ven. Sariputta, \"Is it the case, friend Sariputta, that the holy life is lived under the Blessed One with the purpose, 'May an action [whose result] is to be experienced in the here-&-now be turned into an action [whose result] is to be experienced by me in a future life?'\"",
  "entities": [
    [
      "PERSON",
      "Ven. Maha Kotthita"
    ],
    [
      "PERSON",
      "Ven. Sariputta"
    ],
    [
      "PERSON",
      "Ven. Sariputta"
    ],
    [
      "PERSON",
      "Sariputta"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying among the Sakyans at Kapilavatthu in the Banyan Park. Then in the early morning, the Blessed One, having put on his robes and carrying his bowl and outer robe, went into Kapilavatthu for alms. Having gone for alms in Kapilavatthu, after the meal, returning from his alms round, he went to the dwelling of Kala-khemaka the Sakyan for the day's abiding. Now at that time many resting places had been prepared in Kala-khemaka the Sakyan's dwelling. The Blessed One saw the many resting places prepared there and, on seeing them, the thought occurred to him, \"There are many resting places prepared here. Do many monks live here?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Sakyans"
    ],
    [
      "GPE",
      "Kapilavatthu"
    ],
    [
      "LOC",
      "Banyan Park"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Kapilavatthu"
    ],
    [
      "GPE",
      "Kapilavatthu"
    ],
    [
      "NORP",
      "Sakyan"
    ],
    [
      "NORP",
      "Sakyan"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika 's Monastery. There he addressed the monks: \"Monks!\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika 's Monastery"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "Thus have I heard. Once the Blessed One was staying at Savatthi, in Jeta's Grove, Anathapindika's monastery. [1] Then Carpenter Fivetools went to see the Venerable Udayi . Having saluted him respectfully, he sat down at one side. Thus seated, he asked the Venerable Udayi:",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's monastery"
    ],
    [
      "PERSON",
      "Venerable Udayi"
    ],
    [
      "PERSON",
      "Venerable Udayi"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying in Savatthi at Jeta's Grove, Anathapindika's monastery . Now at that time a large number of monks, after the meal, on returning from their alms round, had gathered at the meeting hall and were engaged in many kinds of bestial topics of conversation: conversation about kings, robbers, & ministers of state; armies, alarms, & battles; food & drink; clothing, furniture, garlands, & scents; relatives; vehicles; villages, towns, cities, the countryside; women & heroes; the gossip of the street & the well; tales of the dead; tales of diversity, the creation of the world & of the sea; talk of whether things exist or not.",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's monastery"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "kings"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Savatthi in the Eastern Monastery, the palace of Migara's mother . And on that occasion — the uposatha of the fifteenth, the night of a very full moon — he was sitting out in the open with the community of monks.",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Eastern Monastery"
    ],
    [
      "NORP",
      "monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying in Savatthi , at Jeta's Grove, Anathapindika's monastery . Then the wanderer Vacchagotta went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there he asked the Blessed One: \"How is it, Master Gotama, does Master Gotama hold the view: 'The cosmos is eternal: only this is true, anything otherwise is worthless'?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's monastery"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Master Gotama"
    ],
    [
      "PERSON",
      "Master Gotama"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying in Campa , on the shore of Gaggara Lake . Then Ven. Bahuna went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the Blessed One: \"Lord, freed, dissociated, & released from how many things does the Tathagata dwell with unrestricted awareness?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Ven. Bahuna"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Tathagata"
    ]
  ]
}
{
  "text": "\"Monks, a friend endowed with seven qualities is worth associating with. Which seven? He gives what is hard to give. He does what is hard to do. He endures what is hard to endure. He reveals his secrets to you. He keeps your secrets. When misfortunes strike, he doesn't abandon you. When you're down & out, he doesn't look down on you. A friend endowed with these seven qualities is worth associating with.\"",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "Thus have I heard. Once the Exalted One was dwelling amongst the Koliyans, [1] in their market town named Kakkarapatta. Then Dighajanu, [2] a Koliyan, approached the Exalted One, respectfully saluted Him and sat on one side. Thus seated, he addressed the Exalted One as follows:",
  "entities": [
    [
      "NORP",
      "Koliyans"
    ],
    [
      "NORP",
      "Koliyan"
    ]
  ]
}
{
  "text": "On one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika 's monastery. Then two brahmans — feeble old men, aged, advanced in years, having come to the last stage of life, 120 years old — went to the Blessed One. On arrival, they exchanged courteous greetings with him and, after an exchange of friendly greetings & courtesies, sat to one side. As they were sitting there, they said to him: \"Master Gotama, we are brahmans — feeble old men, aged, advanced in years, having come to the last stage of life, 120 years old. And we have done no admirable deeds, no skillful deeds, no deeds that allay our fears. Teach us, Master Gotama. Instruct us, Master Gotama, for our long-term benefit & happiness.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika 's monastery"
    ],
    [
      "NORP",
      "brahmans"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Master Gotama"
    ],
    [
      "NORP",
      "brahmans"
    ],
    [
      "PERSON",
      "Master Gotama"
    ],
    [
      "PERSON",
      "Master Gotama"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One, on a wandering tour among the Kosalans with a large community of monks, arrived at a Kosalan brahman village named Icchanangala. There he stayed in the Icchanangala forest grove.",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Kosalans"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Kosalan"
    ],
    [
      "NORP",
      "brahman"
    ],
    [
      "NORP",
      "Icchanangala"
    ],
    [
      "NORP",
      "Icchanangala"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Rajagaha on Vulture's Peak Mountain, in the Boar's Cave. Then LongNails the wanderer [1] went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he stood to one side. As he was standing there, he said to the Blessed One, \"Master Gotama, I am of the view, of the opinion, that 'All is not pleasing to me.'\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Rajagaha"
    ],
    [
      "LOC",
      "Vulture's Peak Mountain"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Master Gotama"
    ]
  ]
}
{
  "text": ". Thus have I heard. Once the Blessed One was staying at Savatthi , in Jeta's Grove, Anathapindika 's monastery. There he addressed the monks thus: \"Monks.\" — \"Venerable sir,\" they replied. The Blessed One said this:",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika 's monastery"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "... Now at that time the Blessed One was sitting & exchanging courtesies & conversation with some very senior brahmans. It so happened that a brahman student named Kapadika was seated in the assembly: young, shaven-headed, sixteen years old, a master of the Three Vedas with their vocabularies, liturgy, phonology, & etymologies, and the histories as a fifth; skilled in philology & grammar, well-versed in cosmology & the marks of a great man. While the very senior brahmans were conversing with the Blessed One, he kept breaking in & interrupting their talk. So the Blessed One scolded him, \"Venerable Bharadvaja, don't break in & interrupt while the very senior brahmans are conversing. Wait until they are finished talking.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "brahmans"
    ],
    [
      "NORP",
      "brahman"
    ],
    [
      "PERSON",
      "Kapadika"
    ],
    [
      "NORP",
      "brahmans"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Venerable Bharadvaja"
    ],
    [
      "NORP",
      "brahmans"
    ]
  ]
}
{
  "text": "\"Monks, there are these four obscurations of the sun and moon, obscured by which the sun and moon don't glow, don't shine, don't dazzle. Which four?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, there are these four modes of practice. Which four? Painful practice with slow intuition, painful practice with quick intuition, pleasant practice with slow intuition, & pleasant practice with quick intuition.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, these two slander the Tathagata. Which two? He who explains what was not said or spoken by the Tathagata as said or spoken by the Tathagata. And he who explains what was said or spoken by the Tathagata as not said or spoken by the Tathagata. These are two who slander the Tathagata.\"",
  "entities": [
    [
      "NORP",
      "Monks"
    ],
    [
      "PERSON",
      "Tathagata"
    ],
    [
      "PERSON",
      "Tathagata"
    ],
    [
      "PERSON",
      "Tathagata"
    ],
    [
      "PERSON",
      "Tathagata"
    ],
    [
      "PERSON",
      "Tathagata"
    ],
    [
      "PERSON",
      "Tathagata"
    ]
  ]
}
{
  "text": "\"Monks, there are these five types of warriors who can be found existing in the world. Which five?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Live with a protector, monks, and not without a protector. He suffers, one who lives without a protector. And these ten are qualities creating a protector. Which ten?",
  "entities": [
    [
      "NORP",
      "monks"
    ]
  ]
}
{
  "text": "At one time, the Venerable Sāriputta was dwelling near the small village of Nālaka in Magadha . And then, there where Venerable Sāriputta was, there Sāmaṇḍakāni , the wanderer, approached. Having approached, he exchanged greetings with the Venerable Sāriputta. Having exchanged greetings, and courteous talk having passed between them, he sat to one side. Having sat to one side, Sāmaṇḍakāni, the wanderer, said this to Venerable Sāriputta:",
  "entities": [
    [
      "PERSON",
      "Venerable Sāriputta"
    ],
    [
      "GPE",
      "Magadha"
    ],
    [
      "PERSON",
      "Venerable Sāriputta"
    ],
    [
      "PERSON",
      "Venerable Sāriputta"
    ],
    [
      "PERSON",
      "Venerable Sāriputta"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying in Savatthi at the Eastern Monastery, the palace of Migara's mother . Now at that time — it being the Uposatha day — Visakha , Migara's mother, went to the Blessed One in the middle of the day and, on arrival, having bowed down to him, sat to one side. As she was sitting there the Blessed One said to her, \"Well now, Visakha, why are you coming in the middle of the day?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "at the"
    ],
    [
      "LOC",
      "Eastern Monastery"
    ],
    [
      "PERSON",
      "Visakha"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Visakha"
    ]
  ]
}
{
  "text": "\"Monks, these two bright qualities guard the world. Which two? Conscience & concern. [1] If these two bright qualities did not guard the world, there would be no recognition of 'mother' here, no recognition of 'mother's sister,' 'uncle's wife,' 'teacher's wife,' or 'wife of those who deserve respect.' The world would be immersed in promiscuity, like rams with goats, roosters with pigs, or dogs with jackals. But because these two bright qualities guard the world, there is recognition of 'mother,' 'mother's sister,' 'uncle's wife,' 'teacher's wife,' & 'wife of those who deserve respect.'\"",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, these four kinds of persons are to be found existing in the world. Which four? One who is engaged in promoting neither his own good nor in promoting the good of another; one who is engaged in promoting another's good but not in promoting his own good; one who is engaged in promoting his own good but not in promoting the good of another; and one who is engaged in promoting his own good and also in promoting the good of another.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, there are these four types of individuals to be found existing in the world. Which four?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery. Now at that time, Janussonin the brahman was driving out of Savatthi in the middle of the day in a totally white roofed-chariot. [1] He saw Pilotika the wanderer coming from afar and, on seeing him, said to him, \"Now where is Master Vacchayana [2] coming from in the middle of the day?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's monastery"
    ],
    [
      "NORP",
      "brahman"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "PERSON",
      "Master Vacchayana"
    ]
  ]
}
{
  "text": "\"Endowed with these six qualities, a person is incapable of alighting on the lawfulness, the rightness of skillful mental qualities even when listening to the true Dhamma. Which six?",
  "entities": [
  
  ]
}
{
  "text": "\"Monks, there are these three sectarian guilds that — when cross-examined, pressed for reasons, & rebuked by wise people — even though they may explain otherwise, remain stuck in [a doctrine of] inaction. Which three?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion, as the Blessed One was wandering among the Magadhans , he entered Rajagaha , went to the potter Bhaggava , and on arrival said to him, \"If it is no inconvenience for you, Bhaggava, I will stay for one night in your shed.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Magadhans"
    ],
    [
      "GPE",
      "Rajagaha"
    ],
    [
      "PERSON",
      "Bhaggava"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika 's monastery. There he addressed the monks: \"Monks!\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika 's monastery"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying among the Sakyans at Kapilavatthu in the Banyan Park. Then Mahanama the Sakyan [1] went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the Blessed One, \"For a long time now, lord, I have understood the Dhamma taught by the Blessed One thus: 'Greed is a defilement of the mind; aversion is a defilement of the mind; delusion is a defilement of the mind.' Yet even though I understand the Dhamma taught by the Blessed One that greed is a defilement of the mind, aversion is a defilement of the mind, delusion is a defilement of the mind, there are still times when the mental quality of greed invades my mind and remains, when the mental quality of aversion... the mental quality of delusion invades my mind and remains. The thought occurs to me: What mental quality is unabandoned within me so that there are times when the mental quality of greed invades my mind and remains, when the mental quality of aversion... the mental quality of delusion invades my mind and remains?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Sakyans"
    ],
    [
      "GPE",
      "Kapilavatthu"
    ],
    [
      "LOC",
      "Banyan Park"
    ],
    [
      "PERSON",
      "Mahanama"
    ],
    [
      "NORP",
      "Sakyan"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
  
    [
      "PERSON",
      "Blessed One"
    ],

    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "\"Endowed with five qualities, a king's elephant is worthy of a king, is a king's asset, counts as a very limb of his king. Which five? There is the case where a king's elephant is a listener, a destroyer, a protector, an endurer, and a goer.",
  "entities": [
    [
      "PERSON",
      "king. Which"
    ]
  ]
}
{
  "text": "\"Monks, there are these six rewards in realizing the fruit of stream-entry. Which six? One is certain of the true Dhamma. One is not subject to falling back. There is no suffering over what has had a limit placed on it. [1] One is endowed with uncommon knowledge. [2] One rightly sees cause, along with causally-originated phenomena.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
}
{
  "text": "\"Monks, there are these five hindrances. Which five? Sensual desire as a hindrance, ill will as a hindrance, sloth & drowsiness as a hindrance, restlessness & anxiety as a hindrance, and uncertainty as a hindrance. These are the five hindrances.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying at Rajagaha , in Jivaka Komarabhacca 's mango grove, with a large community of monks — 1,250 monks in all. Now at that time — it being the observance day, the full-moon night of the water-lily season, the fourth month of the rains — King Ajatasattu of Magadha, the son of Queen Videha , was sitting on the roof terrace of his palace surrounded by his ministers. Then he felt inspired to exclaim: \"How wonderful is this moonlit night! How beautiful... How lovely... How inspiring... How auspicious is this moonlit night! What brahman or contemplative should we visit tonight who might enlighten and bring peace to our mind?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Rajagaha"
    ],
    [
      "PERSON",
      "Jivaka Komarabhacca"
    ],
    [
      "LOC",
      "mango grove"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "PERSON",
      "King Ajatasattu of Magadha"
    ],
    [
      "PERSON",
      "Queen Videha"
    ],
    [
      "NORP",
      "brahman"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying in Sāvatthī , at Jeta's Grove, Anāthapiṇḍika's park. Now on that occasion this pernicious viewpoint (diṭṭhigata) had arisen in the monk Sāti the Fisherman's Son: \"As I understand the Dhamma taught by the Blessed One, it is just this consciousness that runs and wanders on [from birth to birth], not another.\" A large number of monks heard, \"They say that this pernicious viewpoint has arisen in the monk Sāti the Fisherman's Son: 'As I understand the Dhamma taught by the Blessed One, it is just this consciousness that runs and wanders on [from birth to birth], not another.'\" So they went to the monk Sāti the Fisherman's Son and on arrival said to him, \"Is it true, friend Sāti, that this pernicious viewpoint has arisen in you — 'As I understand the Dhamma taught by the Blessed One, it is just this consciousness that runs and wanders on, not another'?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Sāvatthī"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anāthapiṇḍika's park"
    ],
    
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "monks"
    ],
  
    [
      "PERSON",
      "Blessed One"
    ],
   
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "\"Monks, when a royal frontier fortress is well provided with the seven requisites of a fortress, and can obtain at will — without difficulty, without trouble — the four types of food, then it is said to be a royal frontier fortress that can't be undone by external foes or duplicitous allies.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": ". Thus have I heard. On one occasion the Blessed One was wandering in the Kosalan country with a large Sangha of bhikkhus, and eventually he arrived at a Kosalan brahman village called Sala .",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Kosalan"
    ],
    [
      "NORP",
      "Sangha"
    ],
    [
      "NORP",
      "bhikkhus"
    ],
    [
      "NORP",
      "Kosalan"
    ],
    [
      "NORP",
      "brahman"
    ]
  ]
}
{
  "text": "\"Monks, these eight causes, these eight requisite conditions lead to the acquiring of the as-yet-unacquired discernment that is basic to the holy life, and to the increase, plenitude, development, & culmination of that which has already been acquired. Which eight?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "On one occasion the Blessed One was staying near Varanasi in the Deer Park at Isipatana . There he addressed the monks: \"Monks!\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Varanasi"
    ],
    [
      "LOC",
      "Deer Park at Isipatana"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery . Then Subha the student, Todeyya's son , went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to the Blessed One: \"Master Gotama, what is the reason, what is the cause, why baseness & excellence are seen among human beings, among the human race? For short-lived & long-lived people are to be seen, sickly & healthy, ugly & beautiful, uninfluential & influential, poor & rich, low-born & high-born, stupid & discerning people are to be seen. So what is the reason, what is the cause, why baseness & excellence are seen among human beings, among the human race?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's monastery"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Master Gotama"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying at Kosambi , in Ghosita's Park. Now at that time Ven. Udayin was sitting surrounded by a large assembly of householders, teaching the Dhamma. Ven. Ananda saw Ven. Udayin sitting surrounded by a large assembly of householders, teaching the Dhamma, and on seeing him went to the Blessed One. On arrival, he bowed down to the Blessed One and sat to one side. As he was sitting there he said to the Blessed One: \"Ven. Udayin, lord, is sitting surrounded by a large assembly of householders, teaching the Dhamma.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Kosambi"
    ],
    [
      "LOC",
      "Ghosita's Park"
    ],
    [
      "PERSON",
      "Ven. Udayin"
    ],
    [
      "NORP",
      "householders"
    ],
  
    [
      "PERSON",
      "Ven. Ananda"
    ],
    [
      "PERSON",
      "Ven. Udayin"
    ],
    [
      "NORP",
      "householders"
    ],
  
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Ven. Udayin"
    ],
    [
      "NORP",
      "householders"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Rajagaha in the Bamboo Grove, the Squirrels' Sanctuary. Then Visakha the lay follower went to Dhammadinna the nun and, on arrival, having bowed down to her, sat to one side. As he was sitting there he said to her, \"'Self-identification, self-identification,' it is said, lady. Which self-identification is described by the Blessed One?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Rajagaha"
    ],
    [
      "LOC",
      "Bamboo Grove"
    ],
    [
      "LOC",
      "Squirrels' Sanctuary"
    ],
    [
      "PERSON",
      "Visakha"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Varanasi in the Game Refuge at Isipatana. There he addressed the monks: \"Monks!\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Varanasi"
    ],
    [
      "LOC",
      "Game Refuge"
    ],
    [
      "GPE",
      "Isipatana"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "On one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika 's monastery. Then two brahmans — feeble old men, aged, advanced in years, having come to the last stage of life, 120 years old — went to the Blessed One. On arrival, they exchanged courteous greetings with him and, after an exchange of friendly greetings & courtesies, sat to one side. As they were sitting there, they said to him: \"Master Gotama, we are brahmans — feeble old men, aged, advanced in years, having come to the last stage of life, 120 years old. And we have done no admirable deeds, no skillful deeds, no deeds that allay our fears. Teach us, Master Gotama. Instruct us, Master Gotama, for our long-term benefit & happiness.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika 's monastery"
    ],
    [
      "NORP",
      "brahmans"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Master Gotama"
    ],
    [
      "NORP",
      "brahmans"
    ],
    [
      "PERSON",
      "Master Gotama"
    ],
    [
      "PERSON",
      "Master Gotama"
    ]
  ]
}
{
  "text": "Then two brahman cosmologists went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, they sat to one side. As they were sitting there, they said to the Blessed One, \"Master Gotama, Purana Kassapa — all-knowing, all-seeing — claims exhaustive knowledge & vision: 'Whether I am standing or walking, awake or asleep, continual, unflagging knowledge & vision is established within me.' He says, 'I dwell with infinite knowledge, knowing & seeing the finite cosmos.' Yet Nigantha Nataputta — all-knowing, all-seeing — also claims exhaustive knowledge & vision: 'Whether I am standing or walking, awake or asleep, continual, unflagging knowledge & vision is established within me.' He says, 'I dwell with infinite knowledge, knowing & seeing the infinite cosmos.' Of these two speakers of knowledge, these two who contradict each other, which is telling the truth, and which is lying?\"",
  "entities": [
    [
      "NORP",
      "brahman"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Master Gotama"
    ],
    [
      "PERSON",
      "Kassapa"
    ],
    [
      "NORP",
      "Nigantha"
    ]
  ]
}
{
  "text": "Thus I have heard: At one time the Lord was staying near Savatthi in the palace of Migara's mother in the Eastern Monastery. Then the brahman Ganaka-Moggallana approached the Lord; having approached he exchanged greetings with the Lord; having conversed in a friendly and courteous way, he sat down at a respectful distance. As he was sitting down at a respectful distance, Ganaka-Moggallana the brahman spoke thus to the Lord: \"Just as, good Gotama, in this palace of Migara's mother there can be seen a gradual training, a gradual doing, a gradual practice, that is to say as far as the last flight of stairs, [1] so, too, good Gotama, for these brahmans there can be seen a gradual training, a gradual doing, a gradual practice, that is to say in the study [of the Vedas]; [2] so too, good Gotama, for these archers there can be seen a gradual... practice, that is to say in archery; so too, good Gotama, for us whose livelihood is calculation [3] there can be seen a gradual training, a gradual practice, that is to say in accountancy. For when we get a pupil, good Gotama, we first of all make him calculate: 'One one, two twos, three threes, four fours, five fives, six sixes, seven sevens, eight eights, nine nines, ten tens,' and we, good Gotama, also make him calculate a hundred. Is it not possible, good Gotama, to lay down a similar gradual training, gradual doing, gradual practice in respect of this dhamma and discipline?\"",
  "entities": [
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Eastern Monastery"
    ],
    [
      "NORP",
      "brahman"
    ],
    [
      "PERSON",
      "Moggallana"
    ],
    [
      "PERSON",
      "Lord"
    ],
    [
      "PERSON",
      "Lord"
    ],
    [
      "PERSON",
      "Moggallana"
    ],
    [
      "NORP",
      "brahman"
    ],
    [
      "PERSON",
      "Gotama"
    ],
    [
      "PERSON",
      "Gotama"
    ],
    [
      "NORP",
      "brahmans"
    ],
    [
      "PERSON",
      "Gotama"
    ],
    [
      "PERSON",
      "Gotama"
    ],
    [
      "PERSON",
      "Gotama"
    ],
    [
      "PERSON",
      "Gotama"
    ],
    [
      "PERSON",
      "Gotama"
    ]
  ]
}
{
  "text": "[ Udayin :] \"'Released both ways, released both ways,' it is said. To what extent is one described by the Blessed One as released both ways?\"",
  "entities": [
    [
      "PERSON",
      "Udayin"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was living among the Sakyans near Kapilavatthu in the Banyan Park. Then in the early morning, having put on his robes and carrying his bowl & outer robe, he went into Kapilavatthu for alms. Having gone for alms in Kapilavatthu, after the meal, returning from his alms round, he went to the Great Wood for the day's abiding. Plunging into the Great Wood, he sat down at the root of a bilva sapling for the day's abiding.",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Sakyans"
    ],
    [
      "GPE",
      "Kapilavatthu"
    ],
    [
      "LOC",
      "Banyan Park"
    ],
    [
      "GPE",
      "Kapilavatthu"
    ],
    [
      "GPE",
      "Kapilavatthu"
    ],
    [
      "LOC",
      "Great Wood"
    ],
    [
      "LOC",
      "Great Wood"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying in Rajagaha , on Vulture Peak Mountain. Then Sutavan the wanderer went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to the Blessed One: \"One day recently when I was staying right here in Rajagaha, at Giribbaja , I heard it in the Blessed One's presence, learned it in the Blessed One's presence: 'Sutavan, an arahant monk whose mental fermentations are ended, who has reached fulfillment, done the task, laid down the burden, attained the true goal, totally destroyed the fetter of becoming, and who is released through right gnosis, cannot possibly transgress these five principles. It is impossible for a monk whose mental fermentations are ended to intentionally deprive a living being of life. It is impossible for a monk whose mental fermentations are ended to take, in the manner of stealing, what is not given. It is impossible for a monk whose mental fermentations are ended to engage in sexual intercourse. It is impossible for a monk whose mental fermentations are ended to tell a conscious lie. It is impossible for a monk whose mental fermentations are ended to consume stored-up sensual things as he did before, when he was a householder.' Now, did I hear this rightly from the Blessed One? Did I learn it rightly, attend to it rightly, understand it rightly?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Rajagaha"
    ],
    [
      "LOC",
      "Vulture Peak Mountain"
    ],
    [
      "PERSON",
      "Sutavan"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "I was"
    ],
    [
      "GPE",
      "Rajagaha"
    ],
    [
      "GPE",
      "Giribbaja"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      ","
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Sutavan"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery. There he addressed the monks, \"Monks!\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's monastery"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "“Monks, there are four bonds. [1] Which four? The bond of sensual pleasure, [2] the bond of being, [3] the bond of opinion, [4] the bond of ignorance. [5]",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "On one occasion the householder Anathapindika was afflicted, suffering, and gravely ill. The venerable Sariputta dressed, and taking his bowl and outer robe, went to the residence of Anathapindika with Ananda as his attendant. Having gone there, he sat down on a seat made ready and said to Anathapindika: \"I hope you are getting well, I hope you are comfortable. I hope your painful feelings are subsiding and not increasing.\"",
  "entities": [
    [
      "PERSON",
      "Anathapindika"
    ],
    [
      "PERSON",
      "venerable Sariputta"
    ],
    [
      "PERSON",
      "Anathapindika"
    ],
    [
      "PERSON",
      "Ananda"
    ],
    [
      "PERSON",
      "Anathapindika"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying in the Kuru country. Now there is a town of the Kurus called Kammasadhamma . There the Blessed One addressed the monks, \"Monks.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Kuru"
    ],
    [
      "NORP",
      "Kurus"
    ],
    [
      "GPE",
      "Kammasadhamma"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying at Rajagaha in the Bamboo Grove, the Squirrels' Sanctuary. Then Vassakara the brahman, the minister to the king of Magadha , approached the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there he said to the Blessed One: \"I am of the view, of the opinion, that when anyone speaks of what he has seen, [saying,] 'Thus have I seen,' there is no fault in that. When anyone speaks of what he has heard, [saying,] 'Thus have I heard,' there is no fault in that. When anyone speaks of what he has sensed, [saying,] 'Thus have I sensed,' there is no fault in that. When anyone speaks of what he has cognized, [saying,] 'Thus have I cognized,' there is no fault in that.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Rajagaha"
    ],
    [
      "LOC",
      "Bamboo Grove"
    ],
    [
      "LOC",
      "Squirrels' Sanctuary"
    ],
    [
      "PERSON",
      "Vassakara"
    ],
    [
      "NORP",
      "brahman"
    ],
    [
      "GPE",
      "Magadha"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "Once the Blessed One was staying among the Bhaggas in the Deer Park at Bhesakala Grove, near Crocodile Haunt . At that time, Nakula's father , the householder, was diseased, in pain, severely ill. Then Nakula's mother said to him: \"Don't be worried as you die, householder. Death is painful for one who is worried. The Blessed One has criticized being worried at the time of death.",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Bhaggas"
    ],
    [
      "LOC",
      "Deer Park"
    ],
    [
      "LOC",
      "Bhesakala Grove"
    ],
    [
      "LOC",
      "Crocodile Haunt"
    ],
    [
      "PERSON",
      "Nakula"
    ],
    [
      "PERSON",
      "Nakula"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "Then Janussonin the brahman went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there he said to the Blessed One: \"I am of the view & opinion that there is no one who, subject to death, is not afraid or in terror of death.\"",
  "entities": [
    [
      "NORP",
      "brahman"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "\"There are these five rewards in listening to the Dhamma. Which five?",
  "entities": [
  
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying in Rajagaha , on Vulture Peak Mountain. There he addressed the monks: \"Monks, I will teach you the seven conditions that lead to no decline. Listen & pay close attention. I will speak.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Rajagaha"
    ],
    [
      "LOC",
      "Vulture Peak Mountain"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"To the extent that there are animals — footless, two-footed, four-footed, many footed; with form or formless; percipient, non-percipient, or neither percipient nor non-percipient — the Tathagata, worthy & rightly self-awakened, is reckoned the foremost among them. In the same way, all skillful qualities are rooted in heedfulness, converge in heedfulness, and heedfulness is reckoned the foremost among them.",
  "entities": [
    [
      "PERSON",
      "Tathagata"
    ]
  ]
}
{
  "text": "Then the brahman Sangarava went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there he said to the Blessed One: \"I say, Master Gotama. We brahmans perform sacrifices and get others to perform sacrifices. And whoever performs a sacrifice, whoever gets others to perform a sacrifice, they have all practiced a practice of merit — the business of a sacrifice — [that benefits] countless beings. But whoever, leaving his family, has gone forth from the home life into homelessness, and tames his single self, brings his single self into tune, brings his single self to Unbinding: his practice of merit — this business of going forth — is one [that benefits] only one being.\"",
  "entities": [
    [
      "NORP",
      "brahman"
    ],
    [
      "NORP",
      "Sangarava"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Master Gotama"
    ],
    [
      "NORP",
      "brahmans"
    ]
  ]
}
{
  "text": "On one occasion Ven. Ananda was staying in Kosambi at Ghosita's monastery . There he addressed the monks, \"Friend monks!\"",
  "entities": [
    [
      "PERSON",
      "Ven. Ananda"
    ],
    [
      "GPE",
      "Kosambi"
    ],
    [
      "LOC",
      "Ghosita's monastery"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "monks"
    ]
  ]
}
{
  "text": "I have heard that at one time the Blessed One was staying at Nadika , in the Brick Hall. There he addressed the monks, \"Monks!\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Nadika"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"A female disciple of the noble ones who grows in terms of these five types of growth grows in the noble growth, grasps hold of what is essential, what is excellent in the body. Which five? She grows in terms of conviction, in terms of virtue, in terms of learning, in terms of generosity, in terms of discernment. Growing in terms of these five types of growth, the female disciple of the noble ones grows in the noble growth, grasps hold of what is essential, what is excellent in the body.\"",
  "entities": [
    [
      "NORP",
      "ones"
    ]
  ]
}
{
  "text": "Once the Blessed One was staying among the Bhaggas in the Deer Park at Bhesakala Grove, near Crocodile Haunt . Then early in the morning the Blessed One put on his robes and, carrying his bowl and outer robe, went to the home of the householder, Nakula 's father. On arrival, he sat down on a seat made ready. Then Nakula's father & Nakula's mother went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As they were sitting there, Nakula's father said to the Blessed One: \"Lord, ever since Nakula's mother as a young girl was brought to me [to be my wife] when I was just a young boy, I am not conscious of being unfaithful to her even in mind, much less in body. We want to see one another not only in the present life but also in the life to come.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Bhaggas"
    ],
    [
      "LOC",
      "Deer Park"
    ],
    [
      "LOC",
      "Bhesakala Grove"
    ],
    [
      "LOC",
      "Crocodile Haunt"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Nakula"
    ],
    [
      "PERSON",
      "Nakula"
    ],
    [
      "PERSON",
      "Nakula"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Nakula"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Nakula"
    ]
  ]
}
{
  "text": "Then Ven. Samiddhi went to Ven. Sariputta and, on arrival, having bowed down to him, sat to one side. As he was sitting there, Ven. Sariputta said to him, \"Based on what, Samiddhi, do thoughts & resolves arise in a person?\"",
  "entities": [
    [
      "PERSON",
      "Ven. Samiddhi"
    ],
    [
      "PERSON",
      "Ven. Sariputta"
    ],
    [
      "PERSON",
      "Ven. Sariputta"
    ]
  ]
}
{
  "text": "Then a certain brahman approached the Blessed One. Having approached the Blessed One, he exchanged friendly greetings. After pleasant conversation had passed between them, he sat to one side. Having sat to one side, the brahman spoke to the Blessed One thus:",
  "entities": [
    [
      "NORP",
      "brahman"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "brahman"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying among the Vajjians at Bhanda Village. There he addressed the monks, \"Monks!\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "Vajjians"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "Then Vacchagotta the wanderer went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to the Blessed One: \"Master Gotama, I have heard that 'Gotama the contemplative says this: \"Only to me should a gift be given, and not to others. Only to my disciples should a gift be given, and not to others. Only what is given to me bears great fruit, and not what is given to others. Only what is given to my disciples bears great fruit, and not what is given to the disciples of others.\"' Now those who report this: Are they reporting the Master Gotama's actual words, are they not misrepresenting him with what is unfactual, are they answering in line with the Dhamma, so that no one whose thinking is in line with the Dhamma will have grounds for criticizing them? For we don't want to misrepresent the Master Gotama.\"",
  "entities": [
    [
      "PERSON",
      "Vacchagotta"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Master Gotama"
    ],
    [
      "PERSON",
      "Gotama"
    ],
    [
      "PERSON",
      "Master Gotama"
    ],
   
    
    [
      "PERSON",
      "Master Gotama"
    ]
  ]
}
{
  "text": "\"Once, monks, a battle between the devas & asuras was in full swing. And in that battle, the asuras won and the devas lost. Having lost, the devas simply fled while the asuras, heading north, attacked them. Then the thought occurred to the devas, 'The asuras are still attacking. Why don't we do battle a second time?'",
  "entities": [
    [
      "NORP",
      "monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was wandering on a tour of Kasi with a large community of monks. There he addressed the monks: \"I abstain from the night-time meal. [1] As I am abstaining from the night-time meal, I sense next-to-no illness, next-to-no affliction, lightness, strength, & a comfortable abiding. Come now. You too abstain from the night-time meal. As you are abstaining from the night-time meal, you, too, will sense next-to-no illness, next-to-no affliction, lightness, strength, & a comfortable abiding.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Kasi"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "monks"
    ]
  ]
}
{
  "text": "\"Monks, I have known two qualities through experience: discontent with regard to skillful qualities [1] and unrelenting exertion. Relentlessly I exerted myself, [thinking,] 'Gladly would I let the flesh & blood in my body dry up, leaving just the skin, tendons, & bones, but if I have not attained what can be reached through human firmness, human persistence, human striving, there will be no relaxing my persistence.' From this heedfulness of mine was attained Awakening. From this heedfulness of mine was attained the unexcelled freedom from bondage.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "Then Ven. Upali went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the Blessed One: \"It would be good, lord, if the Blessed One would teach me the Dhamma in brief such that, having heard the Dhamma from the Blessed One, I might dwell alone, secluded, heedful, ardent, & resolute.\"",
  "entities": [
    [
      "PERSON",
      "Ven. Upali"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery . There Ven. Sariputta addressed the monks, saying, \"Friend monks!\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's monastery"
    ],
    [
      "PERSON",
      "Ven. Sariputta"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Rajagaha in the Bamboo Grove, the Squirrels' Sanctuary.",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Rajagaha"
    ],
    [
      "LOC",
      "Bamboo Grove"
    ],
    [
      "LOC",
      "Squirrels' Sanctuary"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Savatthi at Jeta's Grove, Anathapindika 's monastery. Then Janussonin the brahman went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to the Blessed One, \"Master Gotama, the sons of good families who have gone forth from the home life into homelessness out of conviction in Master Gotama: is Master Gotama their leader? Is Master Gotama their helper? Is Master Gotama their inspirer? Do they take Master Gotama as their example?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika 's monastery"
    ],
    [
      "NORP",
      "brahman"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Master Gotama"
    ],
    [
      "PERSON",
      "Master Gotama"
    ],
    [
      "PERSON",
      "Master Gotama"
    ],
    [
      "PERSON",
      "Master Gotama"
    ],
    [
      "PERSON",
      "Master Gotama"
    ],
    [
      "PERSON",
      "Master Gotama"
    ]
  ]
}
{
  "text": "On one occasion the Blessed One was staying at Savatthi , in Jeta's Grove, Anathapindika's Monastery. There he addressed the monks, \"Monks!\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's Monastery"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying among the Udaññans , in the Deer Park at Kannakatthala. And at that time King Pasenadi Kosala had arrived at Udañña on some business or other. So King Pasenadi Kosala said to one of his men, \"Come, my good man. Go to the Blessed One and, on arrival, showing reverence with your head to his feet in my name, ask whether he is free from illness & affliction, is carefree, strong, & living in comfort, saying: 'King Pasenadi Kosala, lord, shows reverence with his head to your feet and asks whether you are free from illness & affliction, are carefree, strong, & living in comfort.' And then say: 'Lord, today King Pasenadi Kosala will come to see the Blessed One after his morning meal.'\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "LOC",
      "Deer Park"
    ],
    [
      "PERSON",
      "King Pasenadi Kosala"
    ],
    [
      "PERSON",
      "King Pasenadi Kosala"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "King Pasenadi Kosala"
    ],
    [
      "PERSON",
      "King Pasenadi Kosala"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery . Now on that occasion Potthapada the wanderer , together with a large following of about 300 wanderers, had taken up residence in the debating hall near the Tinduka tree in the single-pavilion park of Queen Mallika . Then the Blessed One, early in the morning, taking his robes & bowl, entered Savatthi for alms. Then the thought occurred to him, \"While it's still too early to go into Savatthi for alms, why don't I go to the debating hall near the Tinduka tree in the single-pavilion park of Queen Mallika to see Potthapada the wanderer?\" So he went to the debating hall near the Tinduka tree in the single-pavilion park of Queen Mallika.",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's monastery"
    ],
    [
      "NORP",
      "wanderers"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "GPE",
      "Savatthi"
    ]
  ]
}
{
  "text": "\"Bhikkhus, these two bright principles protect the world. What are the two? Shame and fear of wrongdoing. If, bhikkhus, these two bright principles did not protect the world, there would not be discerned respect for mother or maternal aunt or maternal uncle's wife or a teacher's wife or the wives of other honored persons, and the world would have fallen into promiscuity, as with goats, sheep, chickens, pigs, dogs, and jackals. But as these two bright principles protect the world, there is discerned respect for mother... and the wives of other honored persons.\"",
  "entities": [
    [
      "NORP",
      "Bhikkhus"
    ],
    [
      "NORP",
      "bhikkhus"
    ]
  ]
}
{
  "text": "\"Monks, with the abandoning & destruction of the seven obsessions, the holy life is fulfilled. Which seven? The obsession of sensual passion, the obsession of resistance, the obsession of views, the obsession of uncertainty, the obsession of conceit, the obsession of passion for becoming, the obsession of ignorance. With the abandoning & destruction of these seven obsessions, the holy life is fulfilled.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, this holy life is lived with training as a reward, with discernment as its surpassing state, with release as its heartwood, and with mindfulness as its governing principle.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
