{"text": "So the Blessed One, putting on his robe and taking up his bowl & outer robe, went together with a community of monks to the reception hall. On arrival he washed his feet, entered the hall, and sat with his back to the central post, facing east. The community of monks washed their feet, entered the hall, and sat with their backs to the western wall, facing east, ranged around the Blessed One. The Kapilavatthu Sakyans washed their feet, entered the hall, and sat with their backs to the eastern wall, facing west, ranged around the Blessed One. Then the Blessed One — having spent most of the night instructing, urging, rousing, & encouraging the Kapilavatthu Sakyans with a Dhamma talk — said to Ven. Ananda , \"Ananda, speak to the Kapilavatthu Sakyans about the person who follows the practice for one in training. [2] My back aches. I will rest it.\"", "entities": [["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["NORP", "Sakyans"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["NORP", "Sakyans"], ["PERSON", "Ananda"], ["PERSON", "Ananda"], ["NORP", "Sakyans"]]}
{"text": "Then Brahma Sahampati — having known with his own awareness the line of thinking in the Blessed One's awareness — just as a strong man might extend his flexed arm or flex his extended arm, disappeared from the Brahma-world and reappeared in front of the Blessed One.", "entities": [["PERSON", "Brahma Sahampati"], ["PERSON", "Blessed One"], ["LOC", "text", "Brahma-world"]]}
{"text": "So the Blessed One, putting on his robe and taking up his bowl & outer robe, went together with a community of monks to the reception hall. On arrival he washed his feet, entered the hall, and sat with his back to the central post, facing east. The community of monks washed their feet, entered the hall, and sat with their backs to the western wall, facing east, ranged around the Blessed One. The Kapilavatthu Sakyans washed their feet, entered the hall, and sat with their backs to the eastern wall, facing west, ranged around the Blessed One. Then the Blessed One — having spent most of the night instructing, urging, rousing, & encouraging the Kapilavatthu Sakyans with a Dhamma talk — dismissed them, saying, \"The night is far past, Gotamas. Do what you now think it is time to do.\"", "entities": [["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["NORP", "Sakyans"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["NORP", "Sakyans"]]}
{"text": "I have heard that on one occasion the Blessed One was staying at Savatthi in the Eastern Monastery, the palace of Migara 's mother, together with many well-known elder disciples — with Ven. Sariputta , Ven. Maha Moggallana , Ven. Maha Kassapa , Ven. Maha Kaccana , Ven. Maha Kotthita , Ven. Maha Kappina , Ven. Maha Cunda , Ven. Revata , Ven. Ananda , and other well-known elder disciples. On that occasion the elder monks were teaching & instructing. Some elder monks were teaching & instructing ten monks, some were teaching & instructing twenty monks, some were teaching & instructing thirty monks, some were teaching & instructing forty monks. The new monks, being taught & instructed by the elder monks, were discerning grand, successive distinctions.", "entities": [["PERSON", "Blessed One"], ["GPE", "Savatthi"], ["LOC", "Eastern Monastery"], ["PERSON", "Sariputta"], ["PERSON", "Moggallana"], ["PERSON", "Ven. Maha Kassapa"], ["PERSON", "Maha Kotthita"], ["PERSON", "Ven. Maha Kappina"], ["PERSON", "Cunda"], ["PERSON", "Ananda"]]}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi in the Eastern Monastery, the palace of Migara's mother. Now on that occasion the Blessed One, on emerging from seclusion in the late afternoon, sat warming his back in the western sun. Then Ven. Ananda went to the Blessed One and, on arrival, having bowed down to the Blessed One, massaged the Blessed One's limbs with his hand and said, \" It's amazing , lord. It's astounding, how the Blessed One's complexion is no longer so clear & bright; his limbs are flabby & wrinkled; his back, bent forward; there's a discernible change in his faculties — the faculty of the eye, the faculty of the ear, the faculty of the nose, the faculty of the tongue, the faculty of the body.\"", "entities": [["PERSON", "Blessed One"], ["GPE", "Savatthi"], ["LOC", "Eastern Monastery"], ["PERSON", "Blessed One"], ["PERSON", "Ananda"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"]]}
{"text": "I have heard that on one occasion the Blessed One was staying near Sāvatthī at the Eastern Monastery, the palace of Migāra's mother. And on that occasion, the Blessed One — it being the observance day — was sitting surrounded by the community of monks. Then Ven. Ānanda — when the night was far advanced, at the end of the first watch — got up from his seat, arranged his robe over one shoulder, stood facing the Blessed One, paying homage with his hands placed palm-to-palm over his heart, and said to him, \"Lord, the night is far advanced. The first watch has ended. The community of monks has been sitting here long. May the Blessed One recite the Pāṭimokkha to them.\" When this was said, the Blessed One remained silent.", "entities": [["PERSON", "Blessed One"], ["GPE", "Sāvatthī"], ["LOC", "Eastern Monastery"], ["PERSON", "Blessed One"], ["PERSON", "Ānanda"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"]]}
{"text": "I have heard that on one occasion the Blessed One was staying at Savatthi in the Eastern Monastery, the palace of Migara 's mother. Then in the evening, Ven. Ananda , coming out of seclusion, went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there, he said to the Blessed One: \"On one occasion, when the Blessed One was staying among the Sakyans in a Sakyan town named Nagaraka , there — face-to-face with the Blessed One — I heard this, face-to-face I learned this: 'I now remain fully in a dwelling of emptiness.' Did I hear that correctly, learn it correctly, attend to it correctly, remember it correctly?\"", "entities": [["PERSON", "Blessed One"], ["GPE", "Savatthi"], ["LOC", "Eastern Monastery"], ["PERSON", "Ananda"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["NORP", "Sakyans"], ["PERSON", "Nagaraka"], ["PERSON", "Blessed One"]]}
{"text": "Thus have I heard. At one time the Lord was staying near Savatthi in the Eastern Park at Migara's mother's mansion. On that occasion the Lord was sitting surrounded by the Order of bhikkhus, as it was the day of the Uposatha observance. Then, when the night was far advanced and the first watch had ended, the Venerable Ananda arose from his seat, arranged his robe over one shoulder, raised his folded hands, and said to the Lord: \"The night is far advanced, revered sir, the first watch has ended and the bhikkhus have been sitting for a long time. Revered sir, let the Lord recite the Patimokkha to the bhikkhus.\" When this was said the Lord remained silent.", "entities": [["GPE", "Savatthi"], ["LOC", "Eastern Park"], ["PERSON", "Venerable Ananda"]]}
{"text": "22. And the Blessed One got ready, and taking his bowl and robe, went to the council hall together with the company of bhikkhus. After rinsing his feet, the Blessed One entered the council hall and took his seat close to the middle pillar, facing east. The community of bhikkhus, after rinsing their feet, also entered the council hall and took seats near the western wall, facing east, so that the Blessed One was before them. And the devotees of Pataligama, after rinsing their feet and entering the council hall, sat down near the eastern wall, facing west, so that the Blessed One was in front of them.", "entities": [["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["GPE", "Pataligama"], ["PERSON", "Blessed One"]]}
{"text": "Now, during the following Rains Retreat, Ven. Anuruddha stayed right there in the Eastern Bamboo Park among the Cetis. Dwelling alone, secluded, heedful, ardent, & resolute, he in no long time reached & remained in the supreme goal of the holy life for which clansmen rightly go forth from home into homelessness, knowing & realizing it for himself in the here & now. He knew: \"Birth is ended, the holy life fulfilled, the task done. There is nothing further for the sake of this world.\" And thus Ven. Anuruddha became another one of the arahants. Then, on attaining arahantship, he uttered this verse:", "entities": [["LOC", "Bamboo Park"], ["NORP", "Cetis"]]}
{"text": "I have heard that on one occasion the Blessed One was staying near Sāvatthī at the Eastern Monastery, the palace of Migāra's mother. And on that occasion a dear and beloved grandson of Visākhā, Migāra's mother, had died. So Visākhā, Migāra's mother — her clothes wet, her hair wet — went to the Blessed One in the middle of the day and, on arrival, having bowed down to him, sat to one side. As she was sitting there the Blessed One said to her: \"Why have you come here, Visākhā — your clothes wet, your hair wet — in the middle of the day?\"", "entities": [["PERSON", "Blessed One"], ["GPE", "Sāvatthī"], ["LOC", "Eastern Monastery"], ["PERSON", "Visākhā"], ["PERSON", "Visākhā"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["PERSON", "Visākhā"]]}
{"text": "I have heard that on one occasion the Blessed One was staying in Savatthi , at the Eastern Gatehouse. There he addressed Ven. Sariputta : \"Sariputta, do you take it on conviction that the faculty of conviction, when developed & pursued, gains a footing in the Deathless, has the Deathless as its goal & consummation? Do you take it on conviction that the faculty of persistence... mindfulness... concentration... discernment, when developed & pursued, gains a footing in the Deathless, has the Deathless as its goal & consummation?\"", "entities": [["PERSON", "Blessed One"], ["GPE", "Savatthi"], ["PERSON", "Sariputta"], ["PERSON", "Sariputta"]]}
{"text": "I have heard that on one occasion the Blessed One was staying near Sāvatthī at the Eastern Monastery, the palace of Migāra's mother. [1] And on that occasion, Visākhā, Migāra's mother, had some dealings with King Pasenadi Kosala that he did not settle as she had wished. So in the middle of the day she went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As she was sitting there the Blessed One said to her, \"Well now, Visākhā, where are you coming from in the middle of the day?\"", "entities": [["PERSON", "Blessed One"], ["GPE", "Sāvatthī"], ["LOC", "Eastern Monastery"], ["PERSON", "Visākhā"], ["PERSON", "King Pasenadi Kosala"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["PERSON", "Visākhā"]]}
{"text": "Then, having given this exhortation to Ven. Anuruddha, the Blessed One — as a strong man might extend his flexed arm or flex his extended arm — disappeared from the Eastern Bamboo Park of the Cetis and reappeared among the Bhaggas in the Deer Park at Bhesakala Grove, near Crocodile Haunt. He sat down on a prepared seat and, as he was sitting there, he addressed the monks: \"Monks, I will teach you the eight thoughts of a great person. Listen & pay close attention. I will speak.\"", "entities": [["PERSON", "Blessed One"], ["LOC", "Bamboo Park"], ["NORP", "Cetis"], ["NORP", "Bhaggas"], ["LOC", "Deer Park"], ["LOC", "Bhesakala Grove"], ["LOC", "Crocodile Haunt"]]}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi in the Eastern Monastery, the palace of Migara's mother . And on that occasion — the uposatha of the fifteenth, the night of a very full moon — he was sitting out in the open with the community of monks. Then, having surveyed the silent community of monks, he addressed them: \"Monks, could a person of no integrity know of a person of no integrity: 'This is a person of no integrity'?\"", "entities": [["PERSON", "Blessed One"], ["GPE", "Savatthi"], ["LOC", "Eastern Monastery"]]}
{"text": "\"When the Tathagata — worthy & rightly self-awakened — was still just an unawakened bodhisatta, this great earth was his great bed. The Himalayas , king of mountains, was his pillow. His left hand rested in the eastern sea, his right hand in the western sea, and both feet in the southern sea. When the Tathagata — worthy & rightly self-awakened — was still just an unawakened bodhisatta, this was the first great dream that appeared to him.", "entities": [["PERSON", "Tathagata"], ["PERSON", "Tathagata"]]}
{"text": "I have heard that on one occasion the Blessed One was staying in Savatthi at the Eastern Monastery, the palace of Migara's mother . Now at that time — it being the Uposatha day — Visakha , Migara's mother, went to the Blessed One in the middle of the day and, on arrival, having bowed down to him, sat to one side. As she was sitting there the Blessed One said to her, \"Well now, Visakha, why are you coming in the middle of the day?\"", "entities": [["PERSON", "Blessed One"], ["GPE", "Savatthi"], ["LOC", "Eastern Monastery"], ["PERSON", "Visakha"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["PERSON", "Visakha"]]}
{"text": "\"Now, when the Tathagata — worthy & rightly self-awakened — was still just an unawakened bodhisatta, and this great earth was his great bed, the Himalayas, king of mountains, was his pillow, his left hand rested in the eastern sea, his right hand in the western sea, and both feet in the southern sea: this first great dream appeared to let him know that he would awaken to the unexcelled right self-awakening.", "entities": [["PERSON", "Tathagata"]]}
{"text": "I have heard that on one occasion the Blessed One was staying near Sāvatthī at the Eastern Monastery, the palace of Migāra's mother. And on that occasion the Blessed One, having emerged from his seclusion in the late afternoon, was sitting outside the doorway of the porch. Then King Pasenadi Kosala went to the Blessed One and, on arrival, having bowed down to him, sat to one side.", "entities": [["PERSON", "Blessed One"], ["GPE", "Sāvatthī"], ["LOC", "Eastern Monastery"], ["PERSON", "Blessed One"], ["PERSON", "King Pasenadi Kosala"], ["PERSON", "Blessed One"]]}
{"text": "Thus I heard. On one occasion the venerable Nandaka was living at Savatthi in the Eastern Monastery, Migara 's Mother's Palace. Then Migara 's grandson, Salha , and Pekhuniya 's grandson, Rohana , went to the venerable Nandaka, and after salutation they sat down at one side. When they had done so the venerable Nandaka said to Migara's grandson Salha:", "entities": [["GPE", "Savatthi"], ["LOC", "Eastern Monastery"]]}
{"text": "Thus have I heard: At one time the Exalted One was staying near Savatthi at the Eastern monastery in the mansion (given by) Migara 's mother. Then Visakha , [1] Migara's mother, approached the Exalted One; having approached and bowed down she sat down in a suitable place. When she was seated the Exalted One spoke thus to Visakha, Migara's Mother:", "entities": [["GPE", "Savatthi"], ["LOC", "Eastern monastery"], ["PERSON", "Visakha"], ["PERSON", "Visakha"]]}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi in the Eastern Monastery, the palace of Migara's mother . And on that occasion — the uposatha of the fifteenth, the night of a very full moon — he was sitting out in the open with the community of monks.", "entities": [["PERSON", "Blessed One"], ["GPE", "Savatthi"], ["LOC", "Eastern Monastery"]]}
{"text": "Then the Blessed One, having gone for alms, after his meal, on returning from his alms round, said to Ven. Ananda, \"Ananda, let's go to the Eastern Park, the palace of Migara's mother , for the day's abiding.\"", "entities": [["PERSON", "Blessed One"], ["PERSON", "Ananda"], ["PERSON", "Ananda"], ["LOC", "Eastern Park"]]}
{"text": "In the eastern region of the excellent country of Magadha there is a village called Nalaka, venerable sir. There I lived formerly as a daughter-in-law and they knew me there as Sesavati.", "entities": [["GPE", "Magadha"], ["GPE", "Nalaka"], ["PERSON", "Sesavati"]]}
{"text": "The lay followers of Pāṭali Village washed their feet, entered the hall, and sat with their backs to the eastern wall, facing west, ranged around the Blessed One.", "entities": [["GPE", "Pāṭali Village"], ["PERSON", "Blessed One"]]}
{"text": "\"There is the case where the brahmans of the Western lands... get their disciples to undertake their practice thus: 'Come, now, my good man: Get up at the proper time from your bed and touch the earth. If you don't touch the earth, touch wet cow dung. If you don't touch wet cow dung, touch green grass. If you don't touch green grass, worship a fire. If you don't worship a fire, pay homage to the sun with clasped hands. If you don't pay homage to the sun with clasped hands, go down into the water three times by nightfall.' These are the purification rites declared by the brahmans of the Western lands... of which I approve.\"", "entities": []}
{"text": "\"Yes, sir,\" the brahmans responded to the Blessed One, and the Blessed One said, \" Suppose that there were four men standing at the four directions, endowed with supreme speed & stride. Like that of a strong archer — well-trained, a practiced hand, a practiced sharp-shooter — shooting a light arrow across the shadow of a palm tree: Such would be the speed with which they were endowed. As far as the east sea is from the west: Such would be the stride with which they were endowed. Then the man standing at the eastern direction would say, 'I, by walking, will reach the end of the cosmos.' He — with a one-hundred year life, a one-hundred year span — would spend one hundred years traveling — apart from the time spent on eating, drinking, chewing & tasting, urinating & defecating, and sleeping to fight off weariness — but without reaching the end of the cosmos he would die along the way. [Similarly with the men standing at the western, southern, & northern directions.] Why is that? I tell you, it isn't through that sort of traveling that the end of the cosmos is known, seen, or reached. But at the same time, I tell you that there is no making an end of suffering & stress without reaching the end of the cosmos.", "entities": [["PERSON", "Blessed One"], ["PERSON", "Blessed One"]]}
{"text": "So the Blessed One, putting on his robe and taking up his bowl & outer robe, went together with a community of monks to the reception hall. On arrival he washed his feet, entered the hall, and sat with his back to the central post, facing east. The community of monks washed their feet, entered the hall, and sat with their backs to the western wall, facing east, ranged around the Blessed One. The Kapilavatthu Sakyans washed their feet, entered the hall, and sat with their backs to the eastern wall, facing west, ranged around the Blessed One. Then the Blessed One — having spent most of the night instructing, urging, rousing, & encouraging the Kapilavatthu Sakyans with a Dhamma talk — said to Ven. Ananda , \"Ananda, speak to the Kapilavatthu Sakyans about the person who follows the practice for one in training. [2] My back aches. I will rest it.\"", "entities": [["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["NORP", "Sakyans"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["NORP", "Sakyans"], ["PERSON", "Ananda"], ["PERSON", "Ananda"], ["NORP", "Sakyans"]]}
{"text": "So the Blessed One, putting on his robe and taking up his bowl & outer robe, went together with a community of monks to the reception hall. On arrival he washed his feet, entered the hall, and sat with his back to the central post, facing east. The community of monks washed their feet, entered the hall, and sat with their backs to the western wall, facing east, ranged around the Blessed One. The Kapilavatthu Sakyans washed their feet, entered the hall, and sat with their backs to the eastern wall, facing west, ranged around the Blessed One. Then the Blessed One — having spent most of the night instructing, urging, rousing, & encouraging the Kapilavatthu Sakyans with a Dhamma talk — dismissed them, saying, \"The night is far past, Gotamas. Do what you now think it is time to do.\"", "entities": [["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["NORP", "Sakyans"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["NORP", "Sakyans"]]}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi in the Eastern Monastery, the palace of Migara's mother. Now on that occasion the Blessed One, on emerging from seclusion in the late afternoon, sat warming his back in the western sun. Then Ven. Ananda went to the Blessed One and, on arrival, having bowed down to the Blessed One, massaged the Blessed One's limbs with his hand and said, \" It's amazing , lord. It's astounding, how the Blessed One's complexion is no longer so clear & bright; his limbs are flabby & wrinkled; his back, bent forward; there's a discernible change in his faculties — the faculty of the eye, the faculty of the ear, the faculty of the nose, the faculty of the tongue, the faculty of the body.\"", "entities": [["PERSON", "Blessed One"], ["GPE", "Savatthi"], ["LOC", "Eastern Monastery"], ["PERSON", "Blessed One"], ["PERSON", "Ananda"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"]]}
{"text": "On one occasion the Blessed One was staying near Nalanda in the Pavarika Mango Grove . Then Asibandhakaputta the headman went to the Blessed One and on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the Blessed One: \"The brahmans of the Western lands, lord — those who carry water pots, wear garlands of water plants, purify with water, & worship fire — can take [the spirit of] a dead person, lift it out, instruct it, & send it to heaven. But the Blessed One, worthy & rightly self-awakened, can arrange it so that all the world, at the break-up of the body, after death, reappears in a good destination, the heavenly world.\"", "entities": [["PERSON", "Blessed One"], ["GPE", "Nalanda"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"]]}
{"text": "22. And the Blessed One got ready, and taking his bowl and robe, went to the council hall together with the company of bhikkhus. After rinsing his feet, the Blessed One entered the council hall and took his seat close to the middle pillar, facing east. The community of bhikkhus, after rinsing their feet, also entered the council hall and took seats near the western wall, facing east, so that the Blessed One was before them. And the devotees of Pataligama, after rinsing their feet and entering the council hall, sat down near the eastern wall, facing west, so that the Blessed One was in front of them.", "entities": [["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["GPE", "Pataligama"], ["PERSON", "Blessed One"]]}
{"text": "\"When the Tathagata — worthy & rightly self-awakened — was still just an unawakened bodhisatta, this great earth was his great bed. The Himalayas , king of mountains, was his pillow. His left hand rested in the eastern sea, his right hand in the western sea, and both feet in the southern sea. When the Tathagata — worthy & rightly self-awakened — was still just an unawakened bodhisatta, this was the first great dream that appeared to him.", "entities": [["PERSON", "Tathagata"], ["PERSON", "Tathagata"]]}
{"text": "What is most interesting about the Milindapañha is that it is the product of the encounter of two great civilizations — Hellenistic Greece and Buddhist India — and is thus of continuing relevance as the wisdom of the East meets the modern Western world. King Milinda poses questions about dilemmas raised by Buddhist philosophy that we might ask today. And Nagasena's responses are full of wisdom, wit, and helpful analogies.", "entities": [["PERSON", "Greece"], ["PERSON", "King Milinda"]]}
{"text": "\"Now, when the Tathagata — worthy & rightly self-awakened — was still just an unawakened bodhisatta, and this great earth was his great bed, the Himalayas, king of mountains, was his pillow, his left hand rested in the eastern sea, his right hand in the western sea, and both feet in the southern sea: this first great dream appeared to let him know that he would awaken to the unexcelled right self-awakening.", "entities": [["PERSON", "Tathagata"]]}
{"text": "So the Blessed One, adjusting his under robe and — carrying his bowl & robes [1] — went together with a community of monks to the rest-house hall. On arrival he washed his feet, entered the hall, and sat with his back to the central post, facing east. The community of monks washed their feet, entered the hall, and sat with their backs to the western wall, facing east, ranged around the Blessed One.", "entities": [["PERSON", "Blessed One"], ["PERSON", "Blessed One"]]}
{"text": "\"The brahmans of the Western lands, lord — those who carry water pots, wear garlands of water plants, worship fire, & purify with water: they have declared purification rites of which I approve.\"", "entities": []}
{"text": "\"And what kind of purification rites have they declared, those brahmans of the Western lands who carry water pots, wear garlands of water plants, worship fire, & purify with water?\"", "entities": []}
{"text": "\"Cunda, the purification rites declared by the brahmans of the Western lands... are one thing; the purification in the discipline of the noble ones is something else entirely.\"", "entities": [["PERSON", "Cunda"]]}
{"text": "So the Blessed One, putting on his robe and taking up his bowl & outer robe, went together with a community of monks to the reception hall. On arrival he washed his feet, entered the hall, and sat with his back to the central post, facing east. The community of monks washed their feet, entered the hall, and sat with their backs to the western wall, facing east, ranged around the Blessed One. The Kapilavatthu Sakyans washed their feet, entered the hall, and sat with their backs to the eastern wall, facing west, ranged around the Blessed One. Then the Blessed One — having spent most of the night instructing, urging, rousing, & encouraging the Kapilavatthu Sakyans with a Dhamma talk — said to Ven. Ananda , \"Ananda, speak to the Kapilavatthu Sakyans about the person who follows the practice for one in training. [2] My back aches. I will rest it.\"", "entities": [["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["NORP", "Sakyans"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["NORP", "Sakyans"], ["PERSON", "Ananda"], ["PERSON", "Ananda"], ["NORP", "Sakyans"]]}
{"text": "So the Blessed One, putting on his robe and taking up his bowl & outer robe, went together with a community of monks to the reception hall. On arrival he washed his feet, entered the hall, and sat with his back to the central post, facing east. The community of monks washed their feet, entered the hall, and sat with their backs to the western wall, facing east, ranged around the Blessed One. The Kapilavatthu Sakyans washed their feet, entered the hall, and sat with their backs to the eastern wall, facing west, ranged around the Blessed One. Then the Blessed One — having spent most of the night instructing, urging, rousing, & encouraging the Kapilavatthu Sakyans with a Dhamma talk — dismissed them, saying, \"The night is far past, Gotamas. Do what you now think it is time to do.\"", "entities": [["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["NORP", "Sakyans"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["NORP", "Sakyans"]]}
{"text": "\"When the Tathagata — worthy & rightly self-awakened — was still just an unawakened bodhisatta, this great earth was his great bed. The Himalayas , king of mountains, was his pillow. His left hand rested in the eastern sea, his right hand in the western sea, and both feet in the southern sea. When the Tathagata — worthy & rightly self-awakened — was still just an unawakened bodhisatta, this was the first great dream that appeared to him.", "entities": [["PERSON", "Tathagata"], ["PERSON", "Tathagata"]]}
{"text": "Then, soon after Nakula's father the householder had recovered from being sick, not long after his recovery from his illness, he went leaning on a stick to the Blessed One. On arrival, having bowed down to the Blessed One, he sat to one side. As he was sitting there, the Blessed One said to him, \"It is your gain, your great gain, householder, that you have Nakula's mother — sympathetic & wishing for your welfare — as your counselor & instructor. To the extent that I have white-clad householder female disciples who act fully in accordance with the precepts, she is one of them. To the extent that I have white-clad householder female disciples who attain inner tranquillity of awareness, she is one of them. To the extent that I have white-clad householder female disciples who reach firm ground in this Doctrine & Discipline, attain a firm foothold, attain consolation, overcome their doubts, dispel their perplexity, reach fearlessness, & gain independence from others with regard to the Teacher's message, she is one of them. It is your gain, your great gain, householder, that you have Nakula's mother — sympathetic & wishing for your welfare — as your counselor & instructor.\"", "entities": [["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"]]}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi, in Jeta's Grove, Anathapindika's monastery. And on that occasion Anathapindika the householder was diseased, in pain, severely ill. Then Anathapindika the householder said to one of his men, \"Come, my good man. Go to the Blessed One and, on arrival, pay homage to his feet with your head in my name and say 'Lord, Anathapindika the householder is diseased, in pain, severely ill. He pays homage with his head to the Blessed One's feet.' Then go to Ven. Sariputta and, on arrival, pay homage to his feet with your head in my name and say 'Venerable sir, Anathapindika the householder is diseased, in pain, severely ill. He pays homage with his head to your feet.' Then say: 'It would be good if Ven. Sariputta would visit Anathapindika's home, out of sympathy for him.'\"", "entities": [["PERSON", "Blessed One"], ["GPE", "Savatthi"], ["LOC", "Jeta's Grove"], ["LOC", "Anathapindika's monastery"], ["PERSON", "Anathapindika"], ["PERSON", "Anathapindika"], ["PERSON", "Blessed One"], ["PERSON", "Anathapindika"], ["PERSON", "Blessed One"], ["PERSON", "Sariputta"], ["PERSON", "Anathapindika"], ["PERSON", "Sariputta"], ["PERSON", "Anathapindika"]]}
{"text": "[The Blessed One said:] \"Well done, householder. Well done. That is how you should periodically refute those foolish men with the Dhamma.\" Then he instructed, urged, roused, and encouraged Anathapindika the householder with a talk on Dhamma. When Anathapindika the householder had been instructed, urged, roused and encouraged by the Blessed One with a talk on Dhamma, he got up from his seat and, having bowed down to the Blessed One, left, keeping the Blessed One on his right side. Not long afterward, the Blessed One addressed the monks: \"Monks, even a monk who has long penetrated the Dhamma in this Doctrine and Discipline would do well to refute the wanderers of other persuasions with the Dhamma periodically in just the way Anathapindika the householder has done.\"", "entities": [["PERSON", "Blessed One"], ["PERSON", "Anathapindika"], ["PERSON", "Anathapindika"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["PERSON", "Anathapindika"]]}
{"text": "\"A householder or householder's son, hearing the Dhamma, gains conviction in the Tathagata and reflects: ' Household life is confining , a dusty path. The life gone forth is like the open air. It is not easy living at home to practice the holy life totally perfect, totally pure, like a polished shell . What if I were to shave off my hair and beard, put on the ochre robes, and go forth from the household life into homelessness?'", "entities": [["PERSON", "Tathagata"]]}
{"text": "\"A householder or householder's son, hearing the Dhamma, gains conviction in the Tathagata and reflects: ' Household life is confining , a dusty path. The life gone forth is like the open air. It is not easy living at home to practice the holy life totally perfect, totally pure, like a polished shell . What if I were to shave off my hair and beard, put on the ochre robes, and go forth from the household life into homelessness?'", "entities": [["PERSON", "Tathagata"]]}
{"text": "\"A householder or householder's son, hearing the Dhamma, gains conviction in the Tathagata and reflects: ' Household life is confining , a dusty path. The life gone forth is like the open air. It is not easy living at home to practice the holy life totally perfect, totally pure, like a polished shell . What if I were to shave off my hair & beard, put on the ochre robes, and go forth from the household life into homelessness?'", "entities": [["PERSON", "Tathagata"]]}
{"text": "\"A householder or householder's son, hearing the Dhamma, gains conviction in the Tathagata and reflects: 'Household life is confining, a dusty path. Life gone forth is the open air. It isn't easy, living at home, to practice the holy life totally perfect, totally pure, a polished shell. What if I, having shaved off my hair & beard and putting on the ochre robe, were to go forth from the household life into homelessness?'", "entities": [["PERSON", "Tathagata"]]}
{"text": "\"A householder or householder's son, hearing the Dhamma, gains conviction in the Tathagata and reflects: 'Household life is confining, a dusty path. Life gone forth is the open air. It isn't easy, living at home, to practice the holy life totally perfect, totally pure, a polished shell. What if I, having shaved off my hair & beard and putting on the ochre robe, were to go forth from the household life into homelessness?'", "entities": [["PERSON", "Tathagata"]]}
{"text": "\"A householder or householder's son, hearing the Dhamma, gains conviction in the Tathagata and reflects: 'Household life is confining, a dusty path. Life gone forth is the open air. It isn't easy, living at home, to practice the holy life totally perfect, totally pure, a polished shell. What if I, having shaved off my hair & beard and putting on the ochre robe, were to go forth from the household life into homelessness?'", "entities": [["PERSON", "Tathagata"]]}
{"text": "\"Even so, Aggivessana, does a Tathagata arise here in the world, a perfected one, fully Self-Awakened One, endowed with right knowledge and conduct, well-farer, knower of the worlds, the matchless charioteer of men to be tamed, the Awakened One, the Lord. He makes known this world with the devas, with Mara, with Brahma, the creation with its recluses and brahmans, its devas and men, having realized them by his own super-knowledge. He teaches dhamma which is lovely at the beginning, lovely in the middle, lovely at the ending, with the spirit and the letters; he proclaims the Brahma-faring, [3] wholly fulfilled, quite purified. A householder or a householder's son or one born in another family hears that dhamma. Having heard that dhamma he gains faith in the Tathagata. Endowed with this faith that he has acquired, he reflects in this way: ' The household life is confined and dusty , going forth is in the open; it is not easy for one who lives in a house to fare the Brahma-faring wholly fulfilled, wholly pure, polished like a conch-shell. Suppose now that I, having cut off hair and beard, having put on saffron robes, should go forth from home into homelessness?' After a time, getting rid of his wealth, be it small or great, getting rid of his circle of relations, be it small or great, having cut off his hair and beard, having put on saffron robes, he goes forth from home into homelessness. To this extent, Aggivessana, the ariyan disciple gets out into the open.", "entities": [["PERSON", "Aggivessana"], ["PERSON", "Tathagata"], ["PERSON", "Awakened One"], ["PERSON", "Awakened One"], ["PERSON", "Mara"], ["PERSON", "Tathagata"], ["PERSON", "Aggivessana"]]}
{"text": "\"And how is a monk one with a sense of social gatherings ? There is the case where a monk knows his social gathering: 'This is a social gathering of noble warriors; this, a social gathering of brahmans; this, a social gathering of householders; this, a social gathering of contemplatives; here one should approach them in this way, stand in this way, act in this way, sit in this way, speak in this way, stay silent in this way.' If he didn't know his social gathering — 'This is a social gathering of noble warriors; this, a social gathering of brahmans; this, a social gathering of householders; this, a social gathering of contemplatives; here one should approach them in this way, stand in this way, act in this way, sit in this way, speak in this way, stay silent in this way' — he wouldn't be said to be one with a sense of social gatherings. So it's because he does know his social gathering — 'This is a social gathering of noble warriors; this, a social gathering of brahmans; this, a social gathering of householders; this, a social gathering of contemplatives; here one should approach them in this way, stand in this way, act in this way, sit in this way, speak in this way, stay silent in this way' — that he is said to be one with a sense of social gatherings. This is one with a sense of Dhamma, a sense of meaning, a sense of himself, a sense of moderation, a sense of time, & a sense of social gatherings.", "entities": []}
{"text": "Then Ven. Ananda , together with Tapussa the householder, went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the Blessed One: \"Tapussa the householder, here, has said to me, 'Venerable Ananda, sir, we are householders who indulge in sensuality, delight in sensuality, enjoy sensuality, rejoice in sensuality. For us — indulging in sensuality, delighting in sensuality, enjoying sensuality, rejoicing in sensuality — renunciation seems like a sheer drop-off. Yet I've heard that in this doctrine & discipline the hearts of the very young monks leap up at renunciation, grow confident, steadfast, & firm, seeing it as peace. So right here is where this doctrine & discipline is contrary to the great mass of people: i.e., [this issue of] renunciation.'\"", "entities": [["PERSON", "Ananda"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["PERSON", "Venerable Ananda"]]}
{"text": "\"Yes, it is, great king. But first, with regard to that, I will ask you a counter-question. Answer however you please. Suppose there were a man of yours: a farmer, a householder, a taxpayer swelling the royal treasury. The thought would occur to him: 'Isn't it amazing? Isn't it astounding? — the destination, the results, of meritorious deeds! For this King Ajatasattu is a human being, and I, too, am a human being, yet King Ajatasattu enjoys himself supplied and replete with the five strings of sensuality — like a deva, as it were — while I am a farmer, a householder, a taxpayer swelling the royal treasury. I, too, should do meritorious deeds. What if I were to shave off my hair and beard, put on the ochre robes, and go forth from the household life into homelessness?'", "entities": [["PERSON", "King Ajatasattu"], ["PERSON", "King Ajatasattu"]]}
{"text": "Responding, \"As you say, lord,\" to Anathapindika the householder, the man went to the Blessed One and, on arrival, bowed down to him and sat to one side. As he was sitting there he said, \"Lord, Anathapindika the householder is diseased, in pain, severely ill. He pays homage with his head to the Blessed One's feet.\" Then he went to Ven. Sariputta and, on arrival, bowed down to him and sat to one side. As he was sitting there he said, 'Venerable sir, Anathapindika the householder is diseased, in pain, severely ill. He pays homage with his head to Ven. Sariputta's feet.\" Then he said, \"It would be good if Ven. Sariputta would visit Anathapindika's home, out of sympathy for him.\" Ven. Sariputta acquiesced through silence.", "entities": [["PERSON", "Anathapindika"], ["PERSON", "Blessed One"], ["PERSON", "Anathapindika"], ["PERSON", "Blessed One"], ["PERSON", "Sariputta"], ["PERSON", "Anathapindika"], ["PERSON", "Sariputta"], ["PERSON", "Sariputta"], ["PERSON", "Anathapindika"], ["PERSON", "Sariputta"]]}
{"text": "\"As, Aggivessana, an elephant tamer, driving a great post into the ground, ties a forest elephant to it by his neck so as to subdue his forest ways, so as to subdue his forest aspirations, and so as to subdue his distress, his fretting and fever for the forest, so as to make him pleased with villages and accustom him to human ways — even so, Aggivessana, these four applications of mindfulness are ties of the mind so as to subdue the ways of householders and to subdue the aspirations of householders and to subdue the distress, the fretting and fever of householders; they are for leading to the right path, for realizing nibbana.", "entities": [["PERSON", "Aggivessana"], ["PERSON", "Aggivessana"]]}
{"text": "I have heard that on one occasion the Blessed One was staying at Kosambi , in Ghosita's Park. Now at that time Ven. Udayin was sitting surrounded by a large assembly of householders, teaching the Dhamma. Ven. Ananda saw Ven. Udayin sitting surrounded by a large assembly of householders, teaching the Dhamma, and on seeing him went to the Blessed One. On arrival, he bowed down to the Blessed One and sat to one side. As he was sitting there he said to the Blessed One: \"Ven. Udayin, lord, is sitting surrounded by a large assembly of householders, teaching the Dhamma.\"", "entities": [["PERSON", "Blessed One"], ["GPE", "Kosambi"], ["LOC", "Ghosita's Park"], ["PERSON", "Ananda"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"]]}
{"text": "\"Now it may be that you are thinking, 'Nakula's mother will not be able to support the children or maintain the household after I'm gone,' but you shouldn't see things in that way. I am skilled at spinning cotton, at carding matted wool. I can support the children and maintain the household after you are gone. So don't be worried as you die, householder. Death is painful for one who is worried. The Blessed One has criticized being worried at the time of death.", "entities": [["PERSON", "Blessed One"]]}
{"text": "Then Ven. Sariputta, having put on his robes and, taking his bowl & outer robe, went to the home of Anathapindika the householder with Ven. Ananda as his attendant. On arrival, he sat down on a prepared seat and said to Anathapindika the householder: \"I trust you are getting better, householder? I trust you are comfortable? I trust that your pains are lessening and not increasing? I trust that there are signs of their lessening, and not of their increasing?\"", "entities": [["PERSON", "Sariputta"], ["PERSON", "Anathapindika"], ["PERSON", "Ananda"], ["PERSON", "Anathapindika"]]}
{"text": "At that time Citta the householder was a sick man, suffering from a serious illness. Then a number of devas that dwell in gardens, forests and trees, the devas of healing herbs and of great trees in the forest, gathered together and said to Citta the householder: [1] \"Make a resolve, householder: 'In some future time may I be a king, a world-ruler!'\" [2]", "entities": []}
{"text": "\"And how is there the undoing of one who leads the holy life? There is the case where a Tathagata arises in the world, worthy and rightly self-awakened, consummate in knowledge & conduct, well-gone, an expert with regard to the world, unexcelled as a trainer for those people fit to be tamed, the Teacher of divine & human beings, awakened, blessed. He resorts to a secluded dwelling: a wilderness, the shade of a tree, a mountain, a glen, a hillside cave, a charnel ground, a forest grove, the open air, a heap of straw. While he is living thus secluded, brahmans & householders from town & countryside visit him. When they visit him, he doesn't get smitten with things that infatuate, doesn't fall into greed, doesn't revert to luxury. A student of that teacher, imitating his teacher's seclusion, resorts to a secluded dwelling: a wilderness, the shade of a tree... a heap of straw. While he is living thus secluded, brahmans & householders from town & countryside visit him. When they visit him, he gets smitten with things that infatuate, falls into greed, and reverts to luxury. This is called one following the holy life who is undone with the undoing of one who leads the holy life. He has been struck down by evil, unskillful qualities that defile, that lead to further becoming, are troublesome, ripen in pain, and lead to future birth, aging, & death. Such is the undoing of one who leads the holy life.", "entities": [["PERSON", "Tathagata"]]}
{"text": "\"Now it may be that you are thinking, 'Nakula's mother will not reach firm ground in this Doctrine & Discipline, will not attain a firm foothold, will not attain consolation, overcome her doubts, dispel her perplexity, reach fearlessness or gain independence from others with regard to the Teacher's message,' [2] but you shouldn't see things in that way. To the extent that the Blessed One has white-clad householder female disciples who reach firm ground in this Doctrine & Discipline, attain a firm foothold, attain consolation, overcome their doubts, dispel their perplexity, reach fearlessness, & gain independence from others with regard to the Teacher's message, I am one of them. If anyone doubts or denies this, let him go ask the Blessed One, the worthy one, the rightly self-awakened one who is staying among the Bhaggas in the Deer Park at Bhesakala Grove, near Crocodile Haunt. So don't be worried as you die, householder. Death is painful for one who is worried. The Blessed One has criticized being worried at the time of death.\"", "entities": [["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["NORP", "Bhaggas"], ["LOC", "Deer Park"], ["LOC", "Bhesakala Grove"], ["LOC", "Crocodile Haunt"], ["PERSON", "Blessed One"]]}
{"text": "\"There is the case, Bharadvaja, where a monk lives in dependence on a certain village or town. Then a householder or householder's son goes to him and observes him with regard to three mental qualities — qualities based on greed, qualities based on aversion, qualities based on delusion: 'Are there in this venerable one any such qualities based on greed that, with his mind overcome by these qualities, he might say, \"I know,\" while not knowing, or say, \"I see,\" while not seeing; or that he might urge another to act in a way that was for his/her long-term harm & pain?' As he observes him, he comes to know, 'There are in this venerable one no such qualities based on greed... His bodily behavior & verbal behavior are those of one not greedy. And the Dhamma he teaches is deep, hard to see, hard to realize, tranquil, refined, beyond the scope of conjecture, subtle, to-be-experienced by the wise. This Dhamma can't easily be taught by a person who's greedy.", "entities": [["PERSON", "Bharadvaja"]]}
{"text": "[2] \"What do you think, monks? Which would in fact be the better? If a strong man, having twisted a firm horse-hair rope around both calves, were to rub, so that the rope cut the skin, and having cut the skin it cut the under-skin, and having cut the under-skin it cut the flesh, and having cut the flesh it cut the sinew, and having cut the sinew it cut the bone, and having cut the bone it left the marrow exposed? Or, to derive enjoyment from the homage of rich kshatriyas, or rich brahmans, or rich householders?\" — \"This, venerable Sir, is surely the better: To derive enjoyment from the homage of rich kshatriyas, or rich brahmans, or rich householders. For it would be painful, venerable Sir, if a strong man, having twisted a firm hair-rope around both calves, were to rub, so that the rope cut the skin and so on until it left the marrow exposed.\"", "entities": []}
{"text": "\"Again, it is with sensuality for the reason, sensuality for the source, sensuality for the cause, the reason being simply sensuality, that kings quarrel with kings, nobles with nobles, brahmans with brahmans, householders with householders, mother with child, child with mother, father with child, child with father, brother with brother, sister with sister, brother with sister, sister with brother, friend with friend. And then in their quarrels, brawls, & disputes, they attack one another with fists or with clods or with sticks or with knives, so that they incur death or deadly pain. Now this drawback too in the case of sensuality, this mass of stress visible here & now, has sensuality for its reason, sensuality for its source, sensuality for its cause, the reason being simply sensuality.", "entities": []}
{"text": "\"Again, it is with sensuality for the reason, sensuality for the source, sensuality for the cause, the reason being simply sensuality, that kings quarrel with kings, nobles with nobles, brahmans with brahmans, householders with householders, mother with child, child with mother, father with child, child with father, brother with brother, sister with sister, brother with sister, sister with brother, friend with friend. And then in their quarrels, brawls, & disputes, they attack one another with fists or with clods or with sticks or with knives, so that they incur death or deadly pain. Now this drawback too in the case of sensuality, this mass of stress visible here & now, has sensuality for its reason, sensuality for its source, sensuality for its cause, the reason being simply sensuality.", "entities": []}
{"text": "Then Anathapindika the householder went to the Blessed One and, on arrival, having bowed to him, sat to one side. As he was sitting there, the Blessed One said to him: \"Householder, when the mind is unprotected, bodily actions are unprotected as well, verbal actions are unprotected as well, mental actions are unprotected as well. When one's bodily actions, verbal actions, & mental actions are unprotected, one's bodily actions get soggy, one's verbal actions get soggy, one's mental actions get soggy. When one's bodily actions, verbal actions, & mental actions are soggy, one's bodily actions... verbal actions... mental actions rot. When one's bodily actions, verbal actions, & mental actions rot, one's death is not auspicious, the mode of one's dying not good.", "entities": [["PERSON", "Anathapindika"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"]]}
{"text": "Then Tapussa the householder went to Ven. Ananda and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to Ven. Ananda: \"Venerable Ananda, sir, we are householders who indulge in sensuality, delight in sensuality, enjoy sensuality, rejoice in sensuality. For us — indulging in sensuality, delighting in sensuality, enjoying sensuality, rejoicing in sensuality — renunciation seems like a sheer drop-off. Yet I've heard that in this doctrine & discipline the hearts of the very young monks leap up at renunciation, grow confident, steadfast, & firm, seeing it as peace. So right here is where this doctrine & discipline is contrary to the great mass of people: i.e., [this issue of] renunciation.\"", "entities": [["PERSON", "Ananda"], ["PERSON", "Ananda"], ["PERSON", "Venerable Ananda"]]}
{"text": "Then Anathapindika the householder, surrounded by about 500 lay followers, went to the Blessed One and, on arrival, having bowed down to him, sat to one side. So the Blessed One said to Ven. Sariputta : \"Sariputta, when you know of a householder clothed in white, that he is restrained in terms of the five training rules and that he obtains at will, without difficulty, without hardship, four pleasant mental abidings in the here & now, then if he wants he may state about himself: 'Hell is ended; animal wombs are ended; the state of the hungry shades is ended; states of deprivation, destitution, the bad bourns are ended! I am a stream-winner, steadfast, never again destined for states of woe, headed for self-awakening!'", "entities": [["PERSON", "Anathapindika"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["PERSON", "Sariputta"], ["PERSON", "Sariputta"]]}
{"text": "Now on that occasion the wanderers of other persuasions had come together in a gathering and were sitting, discussing many kinds of bestial topics, [1] making a great noise & racket. They saw Vajjiya Mahita the householder coming from afar, and on seeing him, hushed one another: \"Be quiet, good sirs. Don't make any noise. Here comes Vajjiya Mahita the householder, a disciple of Gotama the contemplative. He is one of those disciples of Gotama the contemplative, clad in white, who lives in Savatthi . These people are fond of quietude and speak in praise of quietude. Maybe, if he perceives our group as quiet, he will consider it worth his while to come our way.\" So the wanderers fell silent.", "entities": [["PERSON", "Vajjiya"], ["PERSON", "Vajjiya"], ["GPE", "Savatthi"]]}
{"text": "Now on that occasion the wanderers of other persuasions had come together in a gathering and were sitting, discussing many kinds of bestial topics, [1] making a great noise and racket. They saw Anathapindika the householder coming from afar, and on seeing him, hushed one another: \"Be quiet, good sirs. Don't make any noise. Here comes Anathapindika the householder, a disciple of Gotama the contemplative. He is one of those disciples of Gotama the contemplative, clad in white, who lives in Savatthi. These people are fond of quietude and speak in praise of quietude. Maybe, if he perceives our group as quiet, he will consider it worth his while to come our way.\" So the wanderers fell silent.", "entities": [["PERSON", "Anathapindika"], ["PERSON", "Anathapindika"], ["GPE", "Savatthi"]]}
{"text": "\"Now it may be that you are thinking, 'Nakula's mother will not act fully in accordance with the precepts after I'm gone,' but you shouldn't see things in that way. To the extent that the Blessed One has white-clad householder female disciples who act fully in accordance with the precepts, I am one of them. If anyone doubts or denies this, let him go ask the Blessed One, the worthy one, the rightly self-awakened one who is staying among the Bhaggas in the Deer Park at Bhesakala Grove, near Crocodile Haunt. So don't be worried as you die, householder. Death is painful for one who is worried. The Blessed One has criticized being worried at the time of death.", "entities": [["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["NORP", "Bhaggas"], ["LOC", "Deer Park"], ["LOC", "Bhesakala Grove"], ["LOC", "Crocodile Haunt"], ["PERSON", "Blessed One"]]}
{"text": "\"Now it may be that you are thinking, 'Nakula's mother will not attain inner tranquillity of awareness after I'm gone,' but you shouldn't see things in that way. To the extent that the Blessed One has white-clad householder female disciples who attain inner tranquillity of awareness, I am one of them. If anyone doubts or denies this, let him go ask the Blessed One, the worthy one, the rightly self-awakened one who is staying among the Bhaggas in the Deer Park at Bhesakala Grove, near Crocodile Haunt. So don't be worried as you die, householder. Death is painful for one who is worried. The Blessed One has criticized being worried at the time of death.", "entities": [["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["NORP", "Bhaggas"], ["LOC", "Deer Park"], ["LOC", "Bhesakala Grove"], ["LOC", "Crocodile Haunt"], ["PERSON", "Blessed One"]]}
{"text": "This was said by the Blessed One, said by the Arahant, so I have heard: \"Monks, brahmans & householders are very helpful to you, as they provide you with the requisites of robes, alms food, lodgings, & medical requisites for the sick. And you, monks, are very helpful to brahmans & householders, as you teach them the Dhamma admirable in the beginning, admirable in the middle, admirable in the end; as you expound the holy life both in letter & meaning, entirely complete, surpassingly pure. In this way the holy life is lived in mutual dependence, for the purpose of crossing over the flood, for making a right end to stress.\"", "entities": [["PERSON", "Blessed One"]]}
{"text": "Then Anathapindika the householder, surrounded by about 500 lay followers, went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there the Blessed One said to him, \"Householder, you have provided the community of monks with robes, alms food, lodgings, & medicinal requisites for the sick, but you shouldn't rest content with the thought, 'We have provided the community of monks with robes, alms food, lodgings, & medicinal requisites for the sick.' So you should train yourself, 'Let's periodically enter & remain in seclusion & rapture.' That's how you should train yourself.\"", "entities": [["PERSON", "Anathapindika"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"]]}
{"text": "[1] \"What do you think, monks? Which would in fact be the better? Embracing that great mass of fire, burning, blazing, glowing, and sitting or lying down close to it? Or, embracing a kshatriya or brahman or householder woman with young and tender hands and feet, and sitting or lying down close to her?\" — \"This, venerable Sir, would surely be the better: Embracing a kshatriya or brahman or householder woman with young and tender hands and feet, and sitting or lying down close to her. For it would be painful, venerable Sir, to embrace that great, burning, blazing, glowing mass of fire, and sit or lie down close to it.\"", "entities": []}
{"text": "\"Then the Blessed One gave the householder Upāli a step-by-step discourse, that is, talk on giving, talk on moral virtue, talk on the heaven worlds; he made known the danger, the inferior nature of and tendency to defilement in sense-pleasures, and the advantage of renouncing them. When the Blessed One knew that the householder Upāli's mind was ready, open, without hindrances, inspired and confident, then he expounded to him the elevated Dhamma-teaching of the buddhas: dukkha, its origination, its cessation, the path.\" [M i 379-80]", "entities": [["PERSON", "Blessed One"], ["PERSON", "Blessed One"]]}
{"text": "Then Ratthapala, not long after the brahmans & householders of Thullakotthita had left, approached the Blessed One and, on arrival, said to him,", "entities": [["PERSON", "Ratthapala"],["GPE", "Thullakotthita"],["PERSON", "Blessed One"]]}
{"text": "When Vajjiya Mahita the householder had been instructed, urged, roused & encouraged by the Blessed One with a talk on Dhamma, he got up from his seat and, having bowed down to the Blessed One, left, keeping the Blessed One on his right side.", "entities": [["PERSON", "Vajjiya Mahita"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"]]}
{"text": "Then Ven. Sariputta and Ven. Ananda, having given this instruction to Anathapindika the householder, got up from their seats and left. Then, not long after they left, Anathapindika the householder died and reappeared in the Tusita heaven. Then Anathapindika the deva's son, in the far extreme of the night, his extreme radiance lighting up the entirety of Jeta's Grove, went to the Blessed One and, on arrival, bowed down to him and stood to one side. As he was standing there, he addressed the Blessed One with this verse:", "entities": [["PERSON", "Ven. Sariputta"], ["PERSON", "Ven. Ananda"], ["PERSON", "Anathapindika"], ["PERSON", "Anathapindika"], ["LOC", "Tusita"], ["PERSON", "Anathapindika"], ["LOC", "Jeta's Grove"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"]]}
{"text": "Then the householder Nakulapita, delighting in & approving of the Blessed One's words, rose from his seat and — bowing down to the Blessed One and circumambulating him, keeping him to his right — went to Ven. Sariputta and on arrival, having bowed down to him, sat to one side. As he was sitting there, Ven. Sariputta said to him, \"Your faculties are clear & calm, householder, your complexion pure. Have you had the opportunity today of listening to a Dhamma talk in the presence of the Blessed One?\"", "entities": [["GPE", "Nakulapita"],["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["PERSON", "Ven. Sariputta"], ["PERSON", "Ven. Sariputta"], ["PERSON", "Blessed One"]]}
{"text": "23. Thereupon the Blessed One addressed the devotees of Pataligama thus: \"The immoral man, householders, by falling away from virtue, encounters five perils: great loss of wealth through heedlessness; an evil reputation; a timid and troubled demeanor in every society, be it that of nobles, brahmans, householders, or ascetics; death in bewilderment; and, at the breaking up of the body after death, rebirth in a realm of misery, in an unhappy state, in the nether world, in hell.", "entities": [["PERSON", "Blessed One"], ["GPE", "Pataligama"]]}
{"text": "\"Why wouldn't it have, Aggivessana? Before my Awakening, when I was still an unawakened Bodhisatta, the thought occurred to me: ' Household life is confining, a dusty path. Life gone forth is the open air. It isn't easy, living in a home, to practice the holy life totally perfect, totally pure, a polished shell. What if I, having shaved off my hair & beard and putting on the ochre robe, were to go forth from the household life into homelessness?'", "entities": [["PERSON", "Aggivessana"], ["EVENT", "Awakening"]]}
{"text": "Then Vajjiya Mahita the householder went to where the wanderers of other persuasions were staying. On arrival he greeted them courteously. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, the wanderers said to him, \"Is it true, householder, that Gotama the contemplative criticizes all asceticism, that he categorically denounces & disparages all ascetics who live the rough life?\"", "entities": [ ["PERSON", "Vajjiya Mahita"], ["PERSON", "Gotama"]]}
{"text": "\"He [the person discussed above], hearing the Dhamma, gains conviction in the Tathāgata and reflects: 'Household life is confining, a dusty path. Life gone forth is the open air. It isn't easy, living at home, to practice the holy life totally perfect, totally pure, a polished shell. What if I, having shaved off my hair & beard and putting on the ochre robe, were to go forth from the household life into homelessness?'", "entities": [["PERSON", "Tathāgata"]]}
{"text": "Once the Blessed One was staying among the Bhaggas in the Deer Park at Bhesakala Grove, near Crocodile Haunt . At that time, Nakula's father , the householder, was diseased, in pain, severely ill. Then Nakula's mother said to him: \"Don't be worried as you die, householder. Death is painful for one who is worried. The Blessed One has criticized being worried at the time of death.", "entities": [["PERSON", "Blessed One"], ["NORP", "Bhaggas"], ["LOC", "Deer Park"], ["LOC", "Bhesakala Grove"], ["LOC", "Crocodile Haunt"], ["PERSON", "Blessed One"]]}
{"text": "\"From where would our Dhanañjanin the brahman get any heedfulness, friend?", "entities": [["PERSON", "Dhanañjanin"]]}
{"text": "Then Anathapindika the householder went to where the wanderers of other persuasions were staying. On arrival he greeted them courteously. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, the wanderers said to him, \"Tell us, householder, what views Gotama the contemplative has.\"", "entities": [["PERSON", "Anathapindika"], ["PERSON", "Gotama"]]}
{"text": "At Savatthi . Then, early in the morning, Soma the nun put on her robes and, taking her bowl & outer robe, went into Savatthi for alms. When she had gone for alms in Savatthi and had returned from her alms round, after her meal she went to the Grove of the Blind to spend the day. Having gone deep into the Grove of the Blind, she sat down at the foot of a tree for the day's abiding.", "entities": [["GPE", "Savatthi" ], ["GPE", "Savatthi" ], ["GPE", "Savatthi" ], ["LOC", "Grove of the Blind" ], ["LOC", "Grove of the Blind" ] ] }
{"text": "[ At Saavatthii the Blessed One said: ] \"Monks, there are these five groups of clinging. What five? The body-group of clinging, the feeling-group, the perception-group, the mental-formation-group, the consciousness-group of clinging.", "entities": [["GPE", "Saavatthii" ], ["PERSON", "Blessed One" ] ] }
{"text": "[ The Pupils of the Brahman Lohicca abused the Ven. Kaccaana the Great ( Mahaa-Kaccaana. ) He addressed them in these verses :]", "entities": [["PERSON", "Brahman Lohicca" ], ["PERSON", "Ven. Kaccaana the Great" ], ["PERSON", "Mahaa-Kaccaana" ] ] }
{"text": "Staying at Savatthi. Then King Ajatasattu of Magadha, the son of Queen Videha, raising a fourfold army, marched toward Kasi against King Pasenadi Kosala. King Pasenadi heard, \"King Ajatasattu of Magadha, the son of Queen Videha, they say, has raised a fourfold army and is marching toward Kasi against me.\" So King Pasenadi, raising a fourfold army, launched a counter-attack toward Kasi against King Ajatasattu. Then King Ajatasattu & King Pasenadi fought a battle, and in that battle King Ajatasattu defeated King Pasenadi. King Pasenadi, defeated, marched back to his capital at Savatthi.", "entities": [["GPE", "Savatthi" ], ["PERSON", "King Ajatasattu of Magadha" ], ["PERSON", "Queen Videha" ], [ "GPE", "Kasi"], ["PERSON", "King Pasenadi Kosala" ], ["PERSON", "King Pasenadi" ], ["PERSON", "King Ajatasattu of Magadha" ], ["PERSON", "Queen Videha" ], [ "GPE", "Kasi"], ["PERSON", "King Pasenadi" ], [ "GPE", "Kasi"], ["PERSON", "King Ajatasattu" ], ["PERSON", "King Ajatasattu" ], ["PERSON", "King Pasenadi" ], ["PERSON", "King Ajatasattu" ], ["PERSON", "King Pasenadi" ], ["PERSON", "King Pasenadi" ], ["GPE", "Savatthi" ] ] }
 {"text": "Dwelling at Savatthi ... \"Monks, before my Awakening, when I was just an unawakened Bodhisatta, the realization came to me: 'How this world has fallen on difficulty! It is born, it ages, it dies, it falls away & rearises, but it does not discern the escape from this stress, from this aging & death. O when will it discern the escape from this stress, from this aging & death?'", "entities": [["GPE", "Savatthi" ], ["NORP", "Monks" ], ["EVENT", "Awakening" ] ] }
{"text": "[ At Saavatthii a certain monk said to the Ven. Saariputta: ]", "entities": [["GPE", "Saavatthii" ],["PERSON","Ven. Saariputta" ] ] }
{"text": "Standing to one side, a devata addressed the Blessed One with a verse:", "entities":[["NORP", "devata" ],["PERSON", "Blessed One" ] ] }
{"text": "Thus have I heard. Once a large number of bhikkhus were living among the Kosalans, on the slopes of the Himalayas, in a forest-lodging. And they were haughty, unsteady, garrulous, of loose speech, unmindful, thoughtless, without concentration, with wandering minds and faculties uncontrolled. Now Jantu, son of the devas, on a fifteenth-day Uposatha, [1] came into the presence of those bhikkhus and addressed them in verse:", "entities": [["NORP", "Kosalans" ], [ "LOC", "Himalayas"], ["PERSON", "Jantu" ], ["EVENT", "Uposatha"] ] }
 {"text": "Thus I heard. On one occasion the Blessed One was living at Benares in the Deer Park at Isipatana (the Resort of Seers). There he addressed the bhikkhus of the group of five.", "entities": [["PERSON", "Blessed One" ], ["GPE", "Benares" ], ["LOC", "Deer Park at Isipatana" ], ["LOC", "Resort of Seers" ] ] } 
{"text": "On one occasion the Blessed One was staying among the Kosalans in a certain forest thicket. Now at that time the brahman Navakammika [1] Bharadvaja was getting some work done in that forest thicket. He saw the Blessed One sitting under a sala tree — his legs folded crosswise, his body held erect, with mindfulness set to the fore. On seeing him, the thought occurred to the brahman: \"Here I am, taking delight in getting work done in this forest thicket. But what does this contemplative take delight in getting done?\"", "entities": [["PERSON", "Blessed One" ], ["NORP", "Kosalans" ],["PERSON", "Navakammika" ], ["PERSON", "Bharadvaja" ], ["PERSON", "Blessed One" ] ] }
{"text": "372. Thus have I heard: The Bhagava was at one time residing at the market-town called Kammasadhamma in the Kuru Country. There the Bhagava addressed the bhikkhus, saying: \"O Bhikkhus,\" and they replied to him, \"Venerable Sir.\" The Bhagava said:", "entities": [["PERSON", "Bhagava" ], ["GPE", "Kammasadhamma" ], ["PERSON", "Kuru Country" ], ["PERSON", "Bhagava" ], ["NORP", "Bhikkhus" ], ["PERSON", "Venerable Sir" ], ["PERSON", "Bhagava" ] ] }
{"text": "Thus have I heard: At one time the Lord was staying near Rajagaha in the Bamboo Grove at the squirrels' feeding place. Now at that time the novice Aciravata was staying in the Forest Hut. [1] Then Prince Jayasena, [2] who was always pacing up and down, always roaming about on foot, approached the novice Aciravata; having approached he exchanged greetings with the novice Aciravata; having exchanged greetings of friendliness and courtesy, he sat down at a respectful distance. While he was sitting down at a respectful distance, Prince Jayasena spoke thus to the novice Aciravata:", "entities": [["GPE", "Rajagaha" ], ["LOC", "Bamboo Grove" ], ["PERSON", "Aciravata" ], ["LOC", "Forest Hut" ], [ "PERSON", "Prince Jayasena"] ["PERSON", "Aciravata" ], ["PERSON", "Aciravata" ], [ "PERSON", "Prince Jayasena"] ["PERSON", "Aciravata" ] ] } 
{"text": "[1] [ At Saavatthii the Blessed One said: ] \"Monks, what a man wills, what he plans, what he dwells on forms the basis for the continuation of consciousness. [2] This basis being present, consciousness has a lodgment. Consciousness being lodged there and growing, rebirth of renewed existence takes place in the future, and from this renewed existence arise birth, decay-and-death, grief, lamentation, suffering, sorrow and despair. Such is the uprising of this entire mass of suffering.", "entities": [["GPE", "Saavatthii" ], ["PERSON", "Blessed One" ] ] }
{"text": "On one occasion Ven. Godatta was living near Macchikasanda in the Wild Mango Grove. Then Citta the householder went to him and, on arrival, having bowed down to him, sat to one side. As he was sitting there, Ven. Godatta said to him, \"Householder, the immeasurable awareness-release, the nothingness awareness-release, the emptiness awareness-release, the themeless awareness-release: Are these phenomena different in meaning and different in name, or are they one in meaning and different only in name?\"", "entities": [["PERSON", "Ven. Godatta" ], ["GPE", "Macchikasanda" ], ["LOC", "Wild Mango Grove"], ["PERSON", "Citta" ], ["PERSON", "Ven. Godatta" ] ] }
{"text": "Then, there where the Venerable Kāmabhū was, there Citta, the householder, approached. Having approached and having saluted the Venerable Kāmabhū, he sat to one side. Having sat to one side, the Venerable Kāmabhū then said this to Citta, the householder:", "entities": [["PERSON", "Venerable Kāmabhū"], ["PERSON", "Citta"], ["PERSON", "Venerable Kāmabhū"], ["PERSON", "Venerable Kāmabhū"] ["PERSON", "Citta"]]}
{"text": "When this was said, one of the wanderers said to Vajjiya Mahita the householder, \"Now wait a minute, householder. This contemplative Gotama whom you praise is a nihilist, one who doesn't declare anything.\"", "entities": [[ "PERSON", "Vajjiya Mahita" ] , ["PERSON", "Gotama"]]}
{"text": "When this was said, Anathapindika the householder wept and shed tears. Ven. Ananda said to him, \"Are you sinking, householder? Are you foundering?\"", "entities": [["PERSON", "Anathapindika"], ["PERSON", "Ven. Ananda"]]}
{"text": "I have heard that on one occasion the Blessed One was staying in Rajagaha , on Vulture Peak Mountain. Then Sutavan the wanderer went to the Blessed One and, on arrival, exchanged courteous greetings with him.", "entities": [["PERSON", "Blessed One"], ["GPE", "Rajagaha"], ["LOC", "Vulture Peak Mountain"], ["PERSON", "Sutavan"], ["PERSON", "Blessed One"] ] }
{"text": "\"That's the way it is, great king. That's the way it is. Once in the past that money-lending householder provided alms for the Private Buddha named Tagarasikhi . Saying [to his servant], 'Give alms to the contemplative,' he got up from his seat and left. After giving, though, he felt regret: 'It would have been better if my slaves or servants had eaten those alms.' And he also murdered his brother's only heir for the sake of his fortune. Now, the result of his action in having provided alms for the Private Buddha named Tagarasikhi was that he appeared seven times in a good destination, the heavenly world. And through the remaining result of that action he acted as money-lender seven times in this very same Savatthi. But the result of his action in feeling regret after giving [those] alms — 'It would have been better if my slaves or servants had eaten those alms' — was that his mind didn't lend itself to the lavish enjoyment of food, didn't lend itself to the lavish enjoyment of clothing, didn't lend itself to the lavish enjoyment of a vehicle, didn't lend itself to the lavish enjoyment of the five strings of sensuality. The result of his action in having murdered his brother's only heir for the sake of his fortune was that he boiled in hell for many years, many hundreds of years, many thousands of years, many hundred-thousands of years. And through the remaining result of that action he has left this seventh heirless fortune to the royal treasury.", "entities": [["PERSON", "Private Buddha"], ["PERSON", "Tagarasikhi"], ["PERSON", "Private Buddha"], ["PERSON", "Tagarasikhi"], ["GPE", "Savatthi"]]}
{"text": "Then, in the evening, Ven. Udayin left seclusion and went to the Blessed One. On arrival, having bowed down to him, he sat to one side.", "entities": [  ["PERSON", "Ven. Udayin"], ["PERSON", "Blessed One"]]}
{"text": "I have heard that on one occasion, when the Blessed One was on a wandering tour among the Kosalans with a large community of monks, he arrived at the brahman village called Sala . The brahman householders heard, \"Master Gotama the contemplative — the son of the Sakyans, having gone forth from the Sakyan clan — on a wandering tour among the Kosalans with a large community of monks — has arrived at Sala. And of that master Gotama this fine reputation has spread: 'He is indeed a Blessed One, an arahant, rightly self-awakened: consummate in knowledge & conduct, well-gone, a knower of the cosmos, an unexcelled trainer of those persons ready to be tamed, teacher of human & divine beings, awakened, blessed. He has made known — having realized it through direct knowledge — this world with its devas, maras, & brahmas, its generations with their contemplatives & brahmans, their rulers & common people. He has explained the Dhamma admirable in the beginning, admirable in the middle, admirable in the end; has expounded the holy life both in its particulars & in its essence, entirely perfect, surpassingly pure. It is good to see such a worthy one.'\"", "entities": [["PERSON", "Blessed One"], ["NORP", "Kosalans" ], ["GPE", "Sala" ] , ["PERSON", "Gotama"], ["NORP", "Sakyans"], [ "NORP", "Sakyan clan"], ["NORP", "Kosalans"], ["GPE", "Sala"], ["PERSON", "Gotama"], ["PERSON", "Blessed One"], [ "NORP", "devas"], ["NORP" , "maras"] , ["NORP", "brahmas"] ]}