
{
  "text": "Thus have I heard. Once the Blessed One was wandering among the Kosala people together with a large company of monks. Entering a major path, the Blessed One saw in a certain spot a great mass of fire, burning, blazing, glowing. After seeing it and stepping down from the path he sat on the appointed seat at the root of a tree. After sitting down the Blessed One said to the monks: \"Do you see, monks, that great mass of fire, burning, blazing, glowing?\" — \" Yes, venerable Sir.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "PERSON",
      "venerable Sir"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying at Rajagaha , in Jivaka Komarabhacca 's mango grove, with a large community of monks — 1,250 monks in all. Now at that time — it being the observance day, the full-moon night of the water-lily season, the fourth month of the rains — King Ajatasattu of Magadha, the son of Queen Videha , was sitting on the roof terrace of his palace surrounded by his ministers. Then he felt inspired to exclaim: \"How wonderful is this moonlit night! How beautiful... How lovely... How inspiring... How auspicious is this moonlit night! What brahman or contemplative should we visit tonight who might enlighten and bring peace to our mind?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Rajagaha"
    ],
    [
      "PERSON",
      "Jivaka Komarabhacca"
    ],
    [
      "LOC",
      "mango grove"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "PERSON",
      "King Ajatasattu of Magadha"
    ],
    [
      "PERSON",
      "Queen Videha"
    ],
    [
      "NORP",
      "brahman"
    ]
  ]
}
{
  "text": "\"Monks, these are the four developments of concentration. Which four? There is the development of concentration that, when developed & pursued, leads to a pleasant abiding in the here & now. There is the development of concentration that, when developed & pursued, leads to the attainment of knowledge & vision. There is the development of concentration that, when developed & pursued, leads to mindfulness & alertness. There is the development of concentration that, when developed & pursued, leads to the ending of the effluents.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, these four things are born. Which four? Affection is born of affection. Aversion is born of affection. Affection is born of aversion. Aversion is born of aversion.",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Vesālī , at the Gabled Hall in the Great Forest. And on that occasion Saccaka the Nigaṇṭha-son was dwelling in Vesālī — a debater, a sophist, [1] well-regarded by people at large. He made this statement before the assembly in Vesālī: \"I see no contemplative or brahman, the head of an order, the head of a group, or even one who claims to be an arahant, rightly self-awakened, who — engaged in debate with me — would not shiver, quiver, shake, & break out in sweat under the armpits. Even if I were to engage a senseless stump in debate, it — engaged with me in debate — would shiver, quiver, & shake, to say nothing of a human being.\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Vesālī"
    ],
    [
      "GPE",
      "Vesālī"
    ],
    [
      "GPE",
      "Vesālī"
    ],
    [
      "NORP",
      "brahman"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Rajagaha on Vulture's Peak Mountain. Then early in the morning, Ven. Sariputta put on his robes and, carrying his bowl and outer robe, was coming down from Vulture's Peak Mountain with a large group of monks when he saw a large wood pile off to one side. Seeing it, he said to the monks, \"Friends, do you see that large wood pile over there?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Rajagaha"
    ],
    [
      "LOC",
      "Vulture's Peak Mountain"
    ],
    [
      "PERSON",
      "Ven. Sariputta"
    ],
    [
      "LOC",
      "Vulture's Peak Mountain"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Rajagaha in the Bamboo Grove, the Squirrels' Sanctuary.",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Rajagaha"
    ],
    [
      "LOC",
      "Bamboo Grove"
    ]
  ]
}
{
  "text": "\"Monks, there are these five types of warriors who can be found existing in the world. Which five?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "\"Monks, these four types of individuals are to be found existing in the world. Which four?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying in Savatthi at Jeta's Grove, Anathapindika's monastery . Now at that time a large number of monks, after the meal, on returning from their alms round, had gathered at the meeting hall and were engaged in many kinds of bestial topics of conversation: conversation about kings, robbers, & ministers of state; armies, alarms, & battles; food & drink; clothing, furniture, garlands, & scents; relatives; vehicles; villages, towns, cities, the countryside; women & heroes; the gossip of the street & the well; tales of the dead; tales of diversity, the creation of the world & of the sea; talk of whether things exist or not.",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's monastery"
    ],
    [
      "NORP",
      "monks"
    ],
    [
      "NORP",
      "kings"
    ]
  ]
}
{
  "text": "On one occasion Ven. Ananda was staying in Kosambi at Ghosita's Park. Then Ven. Udayin went to him and, on arrival, exchanged courteous greetings. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to Ven. Ananda, \"This has been said by Pañcalacanda the deva's son:",
  "entities": [
    [
      "PERSON",
      "Ven. Ananda"
    ],
    [
      "GPE",
      "in"
    ],
    [
      "GPE",
      "Kosambi"
    ],
    [
      "LOC",
      "Ghosita's Park"
    ],
    [
      "PERSON",
      "Ven. Udayin"
    ],
    [
      "PERSON",
      "Ven. Ananda"
    ]
  ]
}
{
  "text": "[ Udayin :] \"'Released both ways, released both ways,' it is said. To what extent is one described by the Blessed One as released both ways?\"",
  "entities": [
    [
      "PERSON",
      "Udayin"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Vesali , in the Great Forest, at the Gabled Pavilion. Then, in the late afternoon, he left his seclusion and went to the sick ward, where he saw a monk who was weak & sickly. Seeing him, he sat down on a prepared seat. As he was sitting there, he addressed the monks: \"When these five things don't leave a monk who is weak & sickly, it can be expected of him that, before long — with the ending of the fermentations — he will enter & remain in the fermentation-free awareness-release & discernment-release, having realized & directly known them for himself in the here & now. Which five?",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Vesali"
    ],
    [
      "NORP",
      "monks"
    ]
  ]
}
{
  "text": "\"Monks, there are these four types of individuals to be found existing in the world. Which four?",
  "entities": [
    [
      "NORP",
      "Monks"
    ]
  ]
}
{
  "text": "1. Thus have I heard. On one occasion the Exalted One was travelling along the highway between Rājagaha and Nālandā together with a great company of bhikkhus, with about five hundred bhikkhus. At the same time the wanderer Suppiya was also travelling along the highway between Rājagaha and Nālandā together with his pupil, the youth Brahmadatta. Along the way, the wanderer Suppiya spoke in many ways in dispraise of the Buddha, the Dhamma, and the Sangha. But his pupil, the youth Brahmadatta, spoke in many ways in praise of the Buddha, the Dhamma, and the Sangha. Thus these two, teacher and pupil, followed closely behind the Exalted One and the company of bhikkhus, making assertions in direct contradiction to each other.",
  "entities": [
    [
      "GPE",
      "Rājagaha"
    ],
    [
      "GPE",
      "Nālandā"
    ],
    [
      "NORP",
      "bhikkhus"
    ],
    [
      "NORP",
      "bhikkhus"
    ],
    [
      "GPE",
      "Rājagaha"
    ],
    [
      "GPE",
      "Nālandā"
    ],
    [
      "NORP",
      "bhikkhus"
    ]
  ]
}
{
  "text": "I have heard that at one time the Blessed One was staying at Vesali , in the Peaked Roof Hall in the Great Forest.",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Vesali"
    ]
  ]
}
{
  "text": "Thus have I heard. Once the Blessed One was staying at Savatthi, in Jeta's Grove, Anathapindika's monastery. [1] Then Carpenter Fivetools went to see the Venerable Udayi . Having saluted him respectfully, he sat down at one side. Thus seated, he asked the Venerable Udayi:",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Savatthi"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anathapindika's monastery"
    ],
    [
      "PERSON",
      "Venerable Udayi"
    ],
    [
      "PERSON",
      "Venerable Udayi"
    ]
  ]
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Sāvatthī in Jeta's Grove, Anāthapiṇḍika's monastery. Then Piṅgalakoccha the brahman went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there, he said to the Blessed One, \"Master Gotama, these contemplatives & brahmans, each with his group, each with his community, each the teacher of his group, an honored leader, well-regarded by people at large — i.e., Pūraṇa Kassapa , Makkhali Gosāla , Ajita Kesakambalin , Pakudha Kaccāyana , Sañjaya Velaṭṭhaputta , & the Nigaṇṭha Nāṭaputta : Do they all have direct knowledge as they themselves claim, or do they all not have direct knowledge, or do some of them have direct knowledge and some of them not?\"",
  "entities": [
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "GPE",
      "Sāvatthī"
    ],
    [
      "LOC",
      "Jeta's Grove"
    ],
    [
      "LOC",
      "Anāthapiṇḍika's monastery"
    ],
    [
      "NORP",
      "brahman"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Master Gotama"
    ],
    [
      "NORP",
      "brahmans"
    ]
  ]
}
{
  "text": "Then Anathapindika the householder went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there the Blessed One said to him: \"These five things, householder, are welcome, agreeable, pleasant, & hard to obtain in the world. Which five?",
  "entities": [
    [
      "PERSON",
      "Anathapindika"
    ],
    [
      "PERSON",
      "Blessed One"
    ],
    [
      "PERSON",
      "Blessed One"
    ]
  ]
}
