{"text": ". \"If a householder who observes conduct is accordance with the Dhamma, righteous conduct, should wish: 'Oh, that on the dissolution of the body, after death, I might reappear in the company of the brahmans of great property!' it is possible..."}
{"text": "[1] \"What do you think, monks? Which would in fact be the better? Embracing that great mass of fire, burning, blazing, glowing, and sitting or lying down close to it? Or, embracing a kshatriya or brahman or householder woman with young and tender hands and feet, and sitting or lying down close to her?\" — \"This, venerable Sir, would surely be the better: Embracing a kshatriya or brahman or householder woman with young and tender hands and feet, and sitting or lying down close to her. For it would be painful, venerable Sir, to embrace that great, burning, blazing, glowing mass of fire, and sit or lie down close to it.\""}
{"text": "[2] \"What do you think, monks? Which would in fact be the better? If a strong man, having twisted a firm horse-hair rope around both calves, were to rub, so that the rope cut the skin, and having cut the skin it cut the under-skin, and having cut the under-skin it cut the flesh, and having cut the flesh it cut the sinew, and having cut the sinew it cut the bone, and having cut the bone it left the marrow exposed? Or, to derive enjoyment from the homage of rich kshatriyas, or rich brahmans, or rich householders?\" — \"This, venerable Sir, is surely the better: To derive enjoyment from the homage of rich kshatriyas, or rich brahmans, or rich householders. For it would be painful, venerable Sir, if a strong man, having twisted a firm hair-rope around both calves, were to rub, so that the rope cut the skin and so on until it left the marrow exposed.\""}
{"text": "[3] \"What do you think, monks? Which would in fact be the better? If a strong man were to strike the nether-quarters with a sharp, oil-cleaned sword? Or, to derive enjoyment when rich kshatriyas, brahmans, or householders press the palms together in prayer?\""}
{"text": "[4] \"What do you think, monks? Which would in fact be the better? If a strong man were to wrap the body with a red-hot sheet of iron, burning, blazing, glowing? Or, to derive enjoyment from the robes given in faith by rich kshatriyas, brahmans, or householders?\""}
{"text": "[5] \"What do you think, monks? Which would in fact be the better? If a strong man, having opened the mouth with a red-hot iron spike, were to hurl into the mouth a red-hot iron ball, burning, blazing, glowing, so that one's lips would burn, then the mouth would burn, then the tongue would burn, then the throat would burn, then the chest would burn, and when it was received by the lower intestine, it would be expelled from the lower part of the body? Or, to derive enjoyment from the food received on alms-round and given in faith by rich kshatriyas, brahmans, or householders?\""}
{"text": "[6] \"What do you think, monks? Which would in fact be the better? If a strong man, having gripped the head or shoulder, were to force one sit or lie on a red-hot iron bed or chair? Or, to derive enjoyment from a chair given in faith by rich kshatriyas, or brahmans, or householders?\""}
{"text": "[7] \"What do you think, monks? Which would in fact be the better? If a strong man, having gripped one, heels up, head down, were to force one down into a red-hot iron cauldron, burning, blazing, glowing, and where there is boiling scum on top, he were to go once up, once down, and then once sideways? Or, to derive enjoyment from an abode given in faith by rich kshatriyas, or brahmans, or householders?\""}
{"text": "\"Again, it is with sensuality for the reason, sensuality for the source, sensuality for the cause, the reason being simply sensuality, that kings quarrel with kings, nobles with nobles, brahmans with brahmans, householders with householders, mother with child, child with mother, father with child, child with father, brother with brother, sister with sister, brother with sister, sister with brother, friend with friend. And then in their quarrels, brawls, & disputes, they attack one another with fists or with clods or with sticks or with knives, so that they incur death or deadly pain. Now this drawback too in the case of sensuality, this mass of stress visible here & now, has sensuality for its reason, sensuality for its source, sensuality for its cause, the reason being simply sensuality."}
{"text": "\"And how is a monk one with a sense of social gatherings ? There is the case where a monk knows his social gathering: 'This is a social gathering of noble warriors; this, a social gathering of brahmans; this, a social gathering of householders; this, a social gathering of contemplatives; here one should approach them in this way, stand in this way, act in this way, sit in this way, speak in this way, stay silent in this way.' If he didn't know his social gathering — 'This is a social gathering of noble warriors; this, a social gathering of brahmans; this, a social gathering of householders; this, a social gathering of contemplatives; here one should approach them in this way, stand in this way, act in this way, sit in this way, speak in this way, stay silent in this way' — he wouldn't be said to be one with a sense of social gatherings. So it's because he does know his social gathering — 'This is a social gathering of noble warriors; this, a social gathering of brahmans; this, a social gathering of householders; this, a social gathering of contemplatives; here one should approach them in this way, stand in this way, act in this way, sit in this way, speak in this way, stay silent in this way' — that he is said to be one with a sense of social gatherings. This is one with a sense of Dhamma, a sense of meaning, a sense of himself, a sense of moderation, a sense of time, & a sense of social gatherings."}
{"text": "\"And how is there the student's undoing? A student of that teacher, imitating his teacher's seclusion, resorts to a secluded dwelling: a wilderness, the shade of a tree... a heap of straw. While he is living thus secluded, brahmans & householders from town & countryside visit him. When they visit him, he gets smitten with things that infatuate, falls into greed, and reverts to luxury. This is called a student undone with a student's undoing. He has been struck down by evil, unskillful qualities that defile, that lead to further becoming, are troublesome, ripen in pain, and lead to future birth, aging, & death. Such is the student's undoing."}
{"text": "\"And how is there the teacher's undoing? There is the case where a certain teacher [4] resorts to a secluded dwelling: a wilderness, the shade of a tree, a mountain, a glen, a hillside cave, a charnel ground, a forest grove, the open air, a heap of straw. While he is living thus secluded, brahmans & householders from town & countryside visit him. When they visit him, he gets smitten with things that infatuate, falls into greed, and reverts to luxury. This is called a teacher undone with a teacher's undoing. He has been struck down by evil, unskillful qualities that defile, that lead to further becoming, are troublesome, ripen in pain, and lead to future birth, aging, & death. Such is the teacher's undoing. [5]"}
{"text": "\"And what kind of purification rites have they declared, those brahmans of the Western lands who carry water pots, wear garlands of water plants, worship fire, & purify with water?\""}
{"text": "\"But what compelling reason do those garden devas, forest devas, tree devas, and devas inhabiting herbs, grasses, & forest giants see, master, that they say to you, 'Make a wish, householder: \"In the future, may I become a king, a wheel-turning monarch!\"'?\""}
{"text": "\"But, monks, if one who is of poor conduct, an evil-minded one, a filthy doer of complete wickedness who acts in an underhand manner, who pretends to be a recluse yet is not a recluse, who pretends to lead the holy life yet does not lead the holy life, an inwardly-putrid, impure-natured one, were to embrace a kshatriya or brahman or householder woman with young and tender hands and feet, and sit or lie down close to her — for him, monks, there would be a long period of harm and suffering, and on the break-up of the body after death he would be reborn into a place of woe, a realm of misery, a place of suffering, a purgatory.\""}
{"text": "\"But, monks, if one who is of poor conduct, an evil-minded one, a filthy doer of complete wickedness, an impure-natured one, were to derive enjoyment from the homage of rich kshatriyas, or rich brahmans, or rich householders — for him, monks, there would be a long period of harm and suffering, and on the break-up of the body after death he would be reborn into a place of woe, a realm of misery, a place of suffering, a purgatory.\""}
{"text": "\"Furthermore, whatever assembly the unvirtuous person, failing in virtue, approaches — whether of noble warriors, brahmans, householders, or contemplatives — he/she does so without confidence & abashed. This is the third drawback coming from an unvirtuous person's failure in virtue."}
{"text": "\"Furthermore, whatever assembly the virtuous person, consummate in virtue, approaches — whether of noble warriors, brahmans, householders, or contemplatives — he/she does so with confidence & unabashed. This is the third reward coming from a virtuous person's consummation in virtue."}
{"text": "\"Furthermore, when one who gives, who is a master of giving, approaches any assembly of people — noble warriors, brahmans, householders, or contemplatives — he/she does so confidently & without embarrassment. And the fact that when one who gives, who is a master of giving, approaches any assembly of people — noble warriors, brahmans, householders, or contemplatives — he/she does so confidently & without embarrassment: this, too, is a fruit of generosity visible in the here & now."}
{"text": "\"Having thus been answered, there may be wise nobles & brahmans, householders & contemplatives... who will question you further, 'And seeing what benefit does your teacher teach the subduing of passion & desire for form... for feeling... for perception... for fabrications. Seeing what benefit does your teacher teach the subduing of passion & desire for consciousness?'"}
{"text": "\"Having thus been answered, there may be wise nobles & brahmans, householders & contemplatives... who will question you further, 'And seeing what danger does your teacher teach the subduing of passion & desire for form... for feeling... for perception... for fabrications. Seeing what danger does your teacher teach the subduing of passion & desire for consciousness?'"}
{"text": "\"Having thus been answered, there may be wise nobles & brahmans, householders & contemplatives... who will question you further, 'And your teacher teaches the subduing of passion & desire for what?'"}
{"text": "\"Herein, Vyagghapajja, by whatsoever activity a householder earns his living, whether by farming, by trading, by rearing cattle, by archery, by service under the king, or by any other kind of craft — at that he becomes skillful and is not lazy. He is endowed with the power of discernment as to the proper ways and means; he is able to carry out and allocate (duties). This is called the accomplishment of persistent effort."}
{"text": "\"In these six ways do ascetics and brahmans show their compassion towards a householder who ministers to them as the Zenith . Thus is the Zenith covered by him and made safe and secure.\" Thus spoke the Exalted One. And when the Master had thus spoken, he spoke yet again:"}
{"text": "\"Now what, monks, is the allure of forms? Suppose there were a maiden of the noble caste, the brahman caste, or the householder class, fifteen or sixteen years old, neither too tall nor too short, neither too thin nor too plump, neither too dark nor too pale. Is her beauty & charm at that time at its height?\""}
{"text": "\"That was because garden devas, forest devas, tree devas, and devas inhabiting herbs, grasses, & forest giants have assembled and said to me: 'Make a wish, householder: \"In the future, may I become a king, a wheel-turning monarch!\"' And I said to them: 'Even that is inconstant; even that is impermanent; one must abandon even that when one passes on.'\""}
{"text": "\"That's the way it is, great king! That's the way it is! Even affluent nobles, affluent brahmans, & affluent householders... tell deliberate lies with sensual pleasures as the cause, sensual pleasures as the reason, simply for the sake of sensual pleasures. That will lead to their long-term harm & pain.\""}
{"text": "\"The ascetics and brahmans thus ministered to as the Zenith by a householder show their compassion towards him in six ways:"}
{"text": "\"The brahmans of the Western lands, lord — those who carry water pots, wear garlands of water plants, worship fire, & purify with water: they have declared purification rites of which I approve.\""}
{"text": "\"There are some contemplatives & brahmans who hold this doctrine, hold this view: 'There is no total cessation of becoming.' Some contemplatives & brahmans, speaking in direct opposition to those contemplatives & brahmans, say this: 'There is total cessation of becoming.' What do you think, householders? Don't these contemplatives & brahmans speak in direct opposition to each other?\""}
{"text": "On that occasion Citta the householder was diseased, in pain, severely ill. Then a large number of garden devas, forest devas, tree devas, and devas inhabiting herbs, grasses, & forest giants assembled and said to him: \"Make a wish, householder: 'In the future, may I become a king, a wheel-turning monarch!'\""}
{"text": "One portion was enjoyed by the king, along with his household of women; one portion was enjoyed by the army; one portion was enjoyed by the people of the town and village; one portion was enjoyed by brahmans and ascetics; and one portion was enjoyed by the beasts and birds. Nobody guarded the fruits of that royal tree, and neither did anyone harm one another for the sake of its fruits."}
