{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi at Jeta's Grove, Anathapindika 's monastery. Now at that time a certain householder's dear & beloved little son, his only child, had died. Because of his death, the father had no desire to work or to eat. He kept going to the cemetery and crying out, \"Where have you gone, my only little child? Where have you gone, my only little child?\"", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 67, "end": 75, "label": "GPE", "text": "Savatthi"}, {"start": 79, "end": 91, "label": "LOC", "text": "Jeta's Grove"}, {"start": 93, "end": 119, "label": "LOC", "text": "Anathapindika 's monastery"}], "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [79, 91, "LOC"], [93, 119, "LOC"]], "meta": {}, "source": null}
{"text": "\"Now what, monks, is the allure of forms? Suppose there were a maiden of the noble caste, the brahman caste, or the householder class, fifteen or sixteen years old, neither too tall nor too short, neither too thin nor too plump, neither too dark nor too pale. Is her beauty & charm at that time at its height?\"", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "Then Anathapindika the householder went to the Blessed One and, on arrival, having bowed to him, sat to one side. As he was sitting there, the Blessed One said to him: \"Householder, when the mind is unprotected, bodily actions are unprotected as well, verbal actions are unprotected as well, mental actions are unprotected as well. When one's bodily actions, verbal actions, & mental actions are unprotected, one's bodily actions get soggy, one's verbal actions get soggy, one's mental actions get soggy. When one's bodily actions, verbal actions, & mental actions are soggy, one's bodily actions... verbal actions... mental actions rot. When one's bodily actions, verbal actions, & mental actions rot, one's death is not auspicious, the mode of one's dying not good.", "spans": [{"start": 5, "end": 18, "label": "PERSON", "text": "Anathapindika"}, {"start": 47, "end": 58, "label": "PERSON", "text": "Blessed One"}, {"start": 143, "end": 154, "label": "PERSON", "text": "Blessed One"}], "entities": [[5, 18, "PERSON"], [47, 58, "PERSON"], [143, 154, "PERSON"]], "meta": {}, "source": null}
{"text": "[The Blessed One said:] \"Well done, householder. Well done. That is how you should periodically refute those foolish men with the Dhamma.\" Then he instructed, urged, roused, and encouraged Anathapindika the householder with a talk on Dhamma. When Anathapindika the householder had been instructed, urged, roused and encouraged by the Blessed One with a talk on Dhamma, he got up from his seat and, having bowed down to the Blessed One, left, keeping the Blessed One on his right side. Not long afterward, the Blessed One addressed the monks: \"Monks, even a monk who has long penetrated the Dhamma in this Doctrine and Discipline would do well to refute the wanderers of other persuasions with the Dhamma periodically in just the way Anathapindika the householder has done.\"", "spans": [{"start": 5, "end": 16, "label": "PERSON", "text": "Blessed One"}, {"start": 189, "end": 202, "label": "PERSON", "text": "Anathapindika"}, {"start": 247, "end": 260, "label": "PERSON", "text": "Anathapindika"}, {"start": 334, "end": 345, "label": "PERSON", "text": "Blessed One"}, {"start": 423, "end": 434, "label": "PERSON", "text": "Blessed One"}, {"start": 454, "end": 465, "label": "PERSON", "text": "Blessed One"}, {"start": 509, "end": 520, "label": "PERSON", "text": "Blessed One"}, {"start": 733, "end": 746, "label": "PERSON", "text": "Anathapindika"}], "entities": [[5, 16, "PERSON"], [189, 202, "PERSON"], [247, 260, "PERSON"], [334, 345, "PERSON"], [423, 434, "PERSON"], [454, 465, "PERSON"], [509, 520, "PERSON"], [733, 746, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying at Savatthi , in Jeta's Grove, Anathapindika's Monastery. Then Ven. Maha Kotthita , arising from his seclusion in the late afternoon, went to Ven. Sariputta and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side.", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 65, "end": 73, "label": "GPE", "text": "Savatthi"}, {"start": 79, "end": 91, "label": "LOC", "text": "Jeta's Grove"}, {"start": 93, "end": 118, "label": "LOC", "text": "Anathapindika's Monastery"}, {"start": 125, "end": 143, "label": "PERSON", "text": "Ven. Maha Kotthita"}, {"start": 204, "end": 218, "label": "PERSON", "text": "Ven. Sariputta"}], "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [79, 91, "LOC"], [93, 118, "LOC"], [125, 143, "PERSON"], [204, 218, "PERSON"]], "meta": {}, "source": null}
{"text": "Then Ven. Sariputta and Ven. Ananda, having given this instruction to Anathapindika the householder, got up from their seats and left. Then, not long after they left, Anathapindika the householder died and reappeared in the Tusita heaven. Then Anathapindika the deva's son, in the far extreme of the night, his extreme radiance lighting up the entirety of Jeta's Grove, went to the Blessed One and, on arrival, bowed down to him and stood to one side. As he was standing there, he addressed the Blessed One with this verse:", "spans": [{"start": 10, "end": 19, "label": "PERSON", "text": "Sariputta"}, {"start": 29, "end": 35, "label": "PERSON", "text": "Ananda"}, {"start": 70, "end": 83, "label": "PERSON", "text": "Anathapindika"}, {"start": 167, "end": 180, "label": "PERSON", "text": "Anathapindika"}, {"start": 224, "end": 230, "label": "LOC", "text": "Tusita"}, {"start": 244, "end": 257, "label": "PERSON", "text": "Anathapindika"}, {"start": 356, "end": 368, "label": "LOC", "text": "Jeta's Grove"}, {"start": 382, "end": 393, "label": "PERSON", "text": "Blessed One"}, {"start": 495, "end": 506, "label": "PERSON", "text": "Blessed One"}], "entities": [[10, 19, "PERSON"], [29, 35, "PERSON"], [70, 83, "PERSON"], [167, 180, "PERSON"], [224, 230, "LOC"], [244, 257, "PERSON"], [356, 368, "LOC"], [382, 393, "PERSON"], [495, 506, "PERSON"]], "meta": {}, "source": null}
{"text": "[6] \"What do you think, monks? Which would in fact be the better? If a strong man, having gripped the head or shoulder, were to force one sit or lie on a red-hot iron bed or chair? Or, to derive enjoyment from a chair given in faith by rich kshatriyas, or brahmans, or householders?\"", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying in the Kuru country. Now there is a town of the Kurus called Kammasadhamma. There the Blessed One addressed the monks: \"Monks.\"", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 69, "end": 81, "label": "LOC", "text": "Kuru country"}, {"start": 110, "end": 115, "label": "NORP", "text": "Kurus"}, {"start": 123, "end": 136, "label": "GPE", "text": "Kammasadhamma"}, {"start": 148, "end": 159, "label": "PERSON", "text": "Blessed One"}], "entities": [[38, 49, "PERSON"], [69, 81, "LOC"], [110, 115, "NORP"], [123, 136, "GPE"], [148, 159, "PERSON"]], "meta": {}, "source": null}
{"text": "Then the Blessed One addressed the lay followers of Pāṭali Village, \"Householders, there are these five drawbacks coming from an unvirtuous person's failure in virtue. Which five?", "spans": [{"start": 9, "end": 20, "label": "PERSON", "text": "Blessed One"}, {"start": 52, "end": 66, "label": "GPE", "text": "Pāṭali Village"}], "entities": [[9, 20, "PERSON"], [52, 66, "GPE"]], "meta": {}, "source": null}
{"text": "\"Having thus been answered, there may be wise nobles & brahmans, householders & contemplatives... who will question you further, 'And your teacher teaches the subduing of passion & desire for what?'", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "When this was said, Anathapindika the householder wept and shed tears. Ven. Ananda said to him, \"Are you sinking, householder? Are you foundering?\"", "spans": [{"start": 20, "end": 33, "label": "PERSON", "text": "Anathapindika"}, {"start": 76, "end": 82, "label": "PERSON", "text": "Ananda"}], "entities": [[20, 33, "PERSON"], [76, 82, "PERSON"]], "meta": {}, "source": null}
{"text": "At one time the Lord was staying near Savatthi at Jeta Grove, Anathapindika's Monastery. Then King Pasenadi of Kosala approached the Lord and having done so, paid his respects and sat down nearby. Now at that time Queen Mallika died.", "spans": [{"start": 16, "end": 20, "label": "PERSON", "text": "Lord"}, {"start": 38, "end": 46, "label": "GPE", "text": "Savatthi"}, {"start": 50, "end": 60, "label": "LOC", "text": "Jeta Grove"}, {"start": 62, "end": 87, "label": "LOC", "text": "Anathapindika's Monastery"}, {"start": 94, "end": 107, "label": "PERSON", "text": "King Pasenadi"}, {"start": 111, "end": 117, "label": "GPE", "text": "Kosala"}, {"start": 133, "end": 137, "label": "PERSON", "text": "Lord"}, {"start": 214, "end": 227, "label": "PERSON", "text": "Queen Mallika"}], "entities": [[16, 20, "PERSON"], [38, 46, "GPE"], [50, 60, "LOC"], [62, 87, "LOC"], [94, 107, "PERSON"], [111, 117, "GPE"], [133, 137, "PERSON"], [214, 227, "PERSON"]], "meta": {}, "source": null}
{"text": "\"Endowed with these five qualities, a lay follower is an outcaste of a lay follower, a stain of a lay follower, a dregs of a lay follower. Which five? He/she does not have conviction [in the Buddha's Awakening]; is unvirtuous; is eager for protective charms & ceremonies; trusts protective charms & ceremonies, not kamma; and searches for recipients of his/her offerings outside [of the Sangha], and gives offerings there first. Endowed with these five qualities, a lay follower is an outcaste of a lay follower, a stain of a lay follower, a dregs of a lay follower.", "spans": [{"start": 191, "end": 209, "label": "EVENT", "text": "Buddha's Awakening"}, {"start": 387, "end": 393, "label": "NORP", "text": "Sangha"}], "entities": [[191, 209, "EVENT"], [387, 393, "NORP"]], "meta": {}, "source": null}
{"text": "As they were sitting there, the Blessed One asked them, \"Householders, is there any teacher agreeable to you, in whom you have found grounded conviction?\"", "spans": [{"start": 32, "end": 43, "label": "PERSON", "text": "Blessed One"}], "entities": [[32, 43, "PERSON"]], "meta": {}, "source": null}
{"text": "\"What, sire, is the Blessed One's jewel of the analytical knowledges? Four, sire, are the analytical knowledges: of meanings, of Dhamma, of language, and of perspicuity in expression and knowledge. Sire, whatever the company a monk approaches who is adorned with these four analytical knowledges, whether it be a company of nobles, a company of brahmans, a company of householders or a company of recluses, he approaches it with confidence, untroubled, without fear, undismayed, without nervousness. As, sire, a warrior, a hero in battle, when he is armed with his five weapons, enters the battle undaunted and thinks: 'If the enemy are far off I shall destroy them with arrows, if they are nearer than that I shall strike them with my sword, if they are nearer than that I shall strike them with my spear, if they come right up I shall hew them in two with my saber, if they come against my body I shall pierce them through and through with my knife' — even so, sire, the monk who is embellished with the jewel of the four analytical knowledges approaches a company fearlessly, thinking: 'Whoever shall ask me a question on the analytical knowledge of meaning, to him I shall speak comparing meaning with meaning, reason with reason, cause with cause, method with method. I shall resolve his doubts, dispel his perplexity, I shall delight him with explanations of his question. Whoever shall ask me a question on the analytical knowledge of Dhamma, to him I shall speak comparing doctrine with doctrine, the deathless with the deathless, the unconditioned with the unconditioned, Nibbana with Nibbana, emptiness with emptiness, the signless with the signless, the undirected with the undirected, the imperturbable with the imperturbable. I shall resolve his doubts, dispel his perplexity, I shall delight him with explanations of his question. Whoever shall ask me a question on the analytical knowledge of language, to him I shall speak comparing word with word, the next following word with the next following word, syllable with syllable, liaison with liaison, consonant with consonant, the next following expression with the next following expression, sound with sound, vowel with vowel, concept with concept, common usage with common usage. I shall resolve his doubts, dispel his perplexity, I shall delight him with explanations of his question. Whoever shall ask me a question on the analytical knowledge of perspicuity, to him I shall speak comparing perspicuity with perspicuity, simile with simile, characteristic mark with characteristic mark, essence with essence. I shall resolve his doubts, dispel his perplexity, I shall delight him with explanations of his question. This, sire, is called the Blessed One's jewel of analytical knowledge.", "spans": [{"start": 20, "end": 33, "label": "PERSON", "text": "Blessed One's"}, {"start": 2710, "end": 2723, "label": "PERSON", "text": "Blessed One's"}], "entities": [[20, 33, "PERSON"], [2710, 2723, "PERSON"]], "meta": {}, "source": null}
{"text": "\"Lord, when wise nobles or brahmans, householders or contemplatives, having formulated questions, come to the Tathagata and ask him, does this line of reasoning appear to his awareness beforehand — 'If those who approach me ask this, I — thus asked — will answer in this way' — or does the Tathagata come up with the answer on the spot?\"", "spans": [{"start": 110, "end": 119, "label": "PERSON", "text": "Tathagata"}, {"start": 290, "end": 299, "label": "PERSON", "text": "Tathagata"}], "entities": [[110, 119, "PERSON"], [290, 299, "PERSON"]], "meta": {}, "source": null}
{"text": "Then a second time the Lord addressed the Venerable Ananda: \"Come, Ananda, fetch me some water...\" And a second time the Venerable Ananda said to the Lord: \"Just now, revered sir, the brahman householders filled the well to the brim with grass and chaff...\"", "spans": [{"start": 42, "end": 58, "label": "PERSON", "text": "Venerable Ananda"}, {"start": 67, "end": 73, "label": "PERSON", "text": "Ananda"}, {"start": 121, "end": 137, "label": "PERSON", "text": "Venerable Ananda"}], "entities": [[42, 58, "PERSON"], [67, 73, "PERSON"], [121, 137, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that at one time the Blessed One was staying at Nadika , in the Brick Hall. There he addressed the monks, \"Monks!\"", "spans": [{"start": 34, "end": 45, "label": "PERSON", "text": "Blessed One"}, {"start": 61, "end": 67, "label": "GPE", "text": "Nadika"}], "entities": [[34, 45, "PERSON"], [61, 67, "GPE"]], "meta": {}, "source": null}
{"text": "The Blessed One said, \"Monks, it's as if there were two households with doors, and a man of good eyesight, standing there between them, would see people entering & leaving a house, wandering out & about. In the same way, I — by means of the divine eye, purified & surpassing the human — see beings passing away & re-appearing, and I discern how they are inferior & superior, beautiful & ugly, fortunate & unfortunate in accordance with their actions: 'O, how these beings — who were endowed with good conduct of body, speech, & mind, who did not revile noble ones, who held right views and undertook actions under the influence of right views — with the break-up of the body, after death, have re-appeared in a good destination, the heavenly world. Or how these beings — who were endowed with bad conduct of body, speech & mind, who reviled noble ones, held wrong views and undertook actions under the influence of wrong views — with the break-up of the body, after death, have re-appeared in the realm of the hungry ghosts. Or how these beings — who were endowed with bad conduct of body, speech & mind, who reviled noble ones, held wrong views and undertook actions under the influence of wrong views — with the break-up of the body, after death, have re-appeared in the animal womb. Or how these beings — who were endowed with bad conduct of body, speech & mind, who reviled noble ones, held wrong views and undertook actions under the influence of wrong views — with the break-up of the body, after death, have re-appeared in a plane of deprivation, a bad destination, a lower realm, hell.'", "spans": [{"start": 4, "end": 15, "label": "PERSON", "text": "Blessed One"}], "entities": [[4, 15, "PERSON"]], "meta": {}, "source": null}
{"text": "Then, there where the Venerable Kāmabhū was, there Citta , the householder, approached. Having approached and having saluted the Venerable Kāmabhū, he sat to one side. Having sat to one side, the Venerable Kāmabhū then said this to Citta, the householder:", "spans": [{"start": 22, "end": 39, "label": "PERSON", "text": "Venerable Kāmabhū"}, {"start": 129, "end": 146, "label": "PERSON", "text": "Venerable Kāmabhū"}, {"start": 196, "end": 213, "label": "PERSON", "text": "Venerable Kāmabhū"}], "entities": [[22, 39, "PERSON"], [129, 146, "PERSON"], [196, 213, "PERSON"]], "meta": {}, "source": null}
{"text": "Once the Blessed One was staying among the Bhaggas in the Deer Park at Bhesakala Grove, near Crocodile Haunt . At that time, Nakula's father , the householder, was diseased, in pain, severely ill. Then Nakula's mother said to him: \"Don't be worried as you die, householder. Death is painful for one who is worried. The Blessed One has criticized being worried at the time of death.", "spans": [{"start": 9, "end": 20, "label": "PERSON", "text": "Blessed One"}, {"start": 43, "end": 50, "label": "NORP", "text": "Bhaggas"}, {"start": 58, "end": 67, "label": "LOC", "text": "Deer Park"}, {"start": 71, "end": 86, "label": "LOC", "text": "Bhesakala Grove"}, {"start": 93, "end": 108, "label": "LOC", "text": "Crocodile Haunt"}, {"start": 319, "end": 330, "label": "PERSON", "text": "Blessed One"}], "entities": [[9, 20, "PERSON"], [43, 50, "NORP"], [58, 67, "LOC"], [71, 86, "LOC"], [93, 108, "LOC"], [319, 330, "PERSON"]], "meta": {}, "source": null}
{"text": "\"There is the case, Bharadvaja, where a monk lives in dependence on a certain village or town.", "spans": [{"start": 20, "end": 30, "label": "PERSON", "text": "Bharadvaja"}], "entities": [[20, 30, "PERSON"]], "meta": {}, "source": null}
{"text": "Thereupon the Venerable Ananda said to the Lord: \"Just now, revered sir, the brahman householders living in Thuna filled the well to the brim with grass and chaff, thinking, 'Don't let those shaven-headed recluses get water to drink.'\"", "spans": [{"start": 14, "end": 30, "label": "PERSON", "text": "Venerable Ananda"}], "entities": [[14, 30, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that at one time the Blessed One was staying at Nadika , in the Brick Hall. There he addressed the monks, \"Monks, mindfulness of death — when developed & pursued — is of great fruit & great benefit. It gains a footing in the Deathless, has the Deathless as its final end. And how is mindfulness of death developed & pursued so that it is of great fruit & great benefit, gains a footing in the Deathless, and has the Deathless as its final end?", "spans": [{"start": 34, "end": 45, "label": "PERSON", "text": "Blessed One"}, {"start": 61, "end": 67, "label": "GPE", "text": "Nadika"}, {"start": 77, "end": 87, "label": "LOC", "text": "Brick Hall"}], "entities": [[34, 45, "PERSON"], [61, 67, "GPE"], [77, 87, "LOC"]], "meta": {}, "source": null}
{"text": "Once the Blessed One was staying among the Bhaggas in the Deer Park at Bhesakala Grove, near Crocodile Haunt . Then early in the morning the Blessed One put on his robes and, carrying his bowl and outer robe, went to the home of the householder, Nakula 's father. On arrival, he sat down on a seat made ready. Then Nakula's father & Nakula's mother went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As they were sitting there, Nakula's father said to the Blessed One: \"Lord, ever since Nakula's mother as a young girl was brought to me [to be my wife] when I was just a young boy, I am not conscious of being unfaithful to her even in mind, much less in body. We want to see one another not only in the present life but also in the life to come.\"", "spans": [{"start": 9, "end": 20, "label": "PERSON", "text": "Blessed One"}, {"start": 43, "end": 50, "label": "NORP", "text": "Bhaggas"}, {"start": 58, "end": 67, "label": "LOC", "text": "Deer Park"}, {"start": 71, "end": 86, "label": "LOC", "text": "Bhesakala Grove"}, {"start": 93, "end": 108, "label": "LOC", "text": "Crocodile Haunt"}, {"start": 141, "end": 152, "label": "PERSON", "text": "Blessed One"}, {"start": 361, "end": 372, "label": "PERSON", "text": "Blessed One"}, {"start": 489, "end": 500, "label": "PERSON", "text": "Blessed One"}], "entities": [[9, 20, "PERSON"], [43, 50, "NORP"], [58, 67, "LOC"], [71, 86, "LOC"], [93, 108, "LOC"], [141, 152, "PERSON"], [361, 372, "PERSON"], [489, 500, "PERSON"]], "meta": {}, "source": null}
{"text": ". Thus have I heard. On one occasion the Blessed One was living in the Koliyan country: there is a town of the Koliyans called Haliddavasana.", "spans": [{"start": 41, "end": 52, "label": "PERSON", "text": "Blessed One"}, {"start": 71, "end": 86, "label": "LOC", "text": "Koliyan country"}, {"start": 111, "end": 119, "label": "NORP", "text": "Koliyans"}, {"start": 127, "end": 140, "label": "GPE", "text": "Haliddavasana"}], "entities": [[41, 52, "PERSON"], [71, 86, "LOC"], [111, 119, "NORP"], [127, 140, "GPE"]], "meta": {}, "source": null}
{"text": "When this had been said, Anathapindika the householder said to the wanderers, \"As for the venerable one who says, ' The cosmos is eternal. Only this is true; anything otherwise is worthless. This is the sort of view I have,' his view arises from his own inappropriate attention or in dependence on the words of another. Now this view has been brought into being, is fabricated, willed, dependently originated. Whatever has been brought into being, is fabricated, willed, dependently originated, that is inconstant. Whatever is inconstant is stress. This venerable one thus adheres to that very stress, submits himself to that very stress.\" (Similarly for the other positions.)", "spans": [{"start": 25, "end": 38, "label": "PERSON", "text": "Anathapindika"}], "entities": [[25, 38, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion, when the Blessed One was on a wandering tour among the Kosalans with a large community of monks, he arrived at the brahman village called Sala . The brahman householders heard, \"Master Gotama the contemplative — the son of the Sakyans, having gone forth from the Sakyan clan — on a wandering tour among the Kosalans with a large community of monks — has arrived at Sala. And of that master Gotama this fine reputation has spread: 'He is indeed a Blessed One, an arahant, rightly self-awakened: consummate in knowledge & conduct, well-gone, a knower of the cosmos, an unexcelled trainer of those persons ready to be tamed, teacher of human & divine beings, awakened, blessed. He has made known — having realized it through direct knowledge — this world with its devas, maras, & brahmas, its generations with their contemplatives & brahmans, their rulers & common people. He has explained the Dhamma admirable in the beginning, admirable in the middle, admirable in the end; has expounded the holy life both in its particulars & in its essence, entirely perfect, surpassingly pure. It is good to see such a worthy one.'\"", "spans": [{"start": 44, "end": 55, "label": "PERSON", "text": "Blessed One"}, {"start": 220, "end": 226, "label": "PERSON", "text": "Gotama"}, {"start": 262, "end": 269, "label": "NORP", "text": "Sakyans"}, {"start": 425, "end": 431, "label": "PERSON", "text": "Gotama"}, {"start": 481, "end": 492, "label": "PERSON", "text": "Blessed One"}], "entities": [[44, 55, "PERSON"], [220, 226, "PERSON"], [262, 269, "NORP"], [425, 431, "PERSON"], [481, 492, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying among the Mallans near a Mallan town named Uruvelakappa. Then early in the morning the Blessed One, having put on his robes and carrying his bowl and outer robe, went into Uruvelakappa for alms. Having gone into Uruvelakappa for alms, after his meal, on his return from his alms round, he said to Ven. Ananda , \"Stay right here, Ananda, while I go into the Great Wood for the day's abiding.\"", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 72, "end": 79, "label": "NORP", "text": "Mallans"}, {"start": 87, "end": 98, "label": "LOC", "text": "Mallan town"}, {"start": 105, "end": 117, "label": "GPE", "text": "Uruvelakappa"}, {"start": 149, "end": 160, "label": "PERSON", "text": "Blessed One"}, {"start": 234, "end": 246, "label": "GPE", "text": "Uruvelakappa"}, {"start": 274, "end": 286, "label": "GPE", "text": "Uruvelakappa"}, {"start": 359, "end": 370, "label": "PERSON", "text": "Ven. Ananda"}, {"start": 391, "end": 397, "label": "PERSON", "text": "Ananda"}, {"start": 419, "end": 429, "label": "LOC", "text": "Great Wood"}], "entities": [[38, 49, "PERSON"], [72, 79, "NORP"], [87, 98, "LOC"], [105, 117, "GPE"], [149, 160, "PERSON"], [234, 246, "GPE"], [274, 286, "GPE"], [359, 370, "PERSON"], [391, 397, "PERSON"], [419, 429, "LOC"]], "meta": {}, "source": null}
{"text": "\"Furthermore, whatever assembly the unvirtuous person, failing in virtue, approaches — whether of noble warriors, brahmans, householders, or contemplatives — he/she does so without confidence & abashed. This is the third drawback coming from an unvirtuous person's failure in virtue.", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "Then a certain monk went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the Blessed One: \"It would be good if the Blessed One would teach me the Dhamma in brief so that, having heard the Dhamma from the Blessed One, I might dwell alone in seclusion: heedful, ardent, & resolute.\"", "spans": [{"start": 32, "end": 43, "label": "PERSON", "text": "Blessed One"}, {"start": 143, "end": 154, "label": "PERSON", "text": "Blessed One"}, {"start": 181, "end": 192, "label": "PERSON", "text": "Blessed One"}, {"start": 270, "end": 281, "label": "PERSON", "text": "Blessed One"}], "entities": [[32, 43, "PERSON"], [143, 154, "PERSON"], [181, 192, "PERSON"], [270, 281, "PERSON"]], "meta": {}, "source": null}
{"text": "As he was sitting there, he said to Ven. Ananda, \"This has been said by Pañcalacanda the deva's son:\"", "spans": [{"start": 36, "end": 47, "label": "PERSON", "text": "Ven. Ananda"}, {"start": 72, "end": 84, "label": "PERSON", "text": "Pañcalacanda"}], "entities": [[36, 47, "PERSON"], [72, 84, "PERSON"]], "meta": {}, "source": null}
{"text": "On one occasion Ven. Ananda was staying near Vesali at Veluvagamaka. Now on that occasion Dasama the householder from Atthakanagara had arrived at Pataliputta on some business. Then he went to a certain monk at Kukkata Monastery and on arrival said to him, \"Where is Ven. Ananda staying now? I'd like to see him.\"", "spans": [{"start": 21, "end": 27, "label": "PERSON", "text": "Ananda"}, {"start": 45, "end": 51, "label": "GPE", "text": "Vesali"}, {"start": 55, "end": 67, "label": "GPE", "text": "Veluvagamaka"}, {"start": 90, "end": 96, "label": "PERSON", "text": "Dasama"}, {"start": 118, "end": 131, "label": "GPE", "text": "Atthakanagara"}, {"start": 147, "end": 158, "label": "GPE", "text": "Pataliputta"}, {"start": 211, "end": 228, "label": "LOC", "text": "Kukkata Monastery"}, {"start": 272, "end": 278, "label": "PERSON", "text": "Ananda"}], "entities": [[21, 27, "PERSON"], [45, 51, "GPE"], [55, 67, "GPE"], [90, 96, "PERSON"], [118, 131, "GPE"], [147, 158, "GPE"], [211, 228, "LOC"], [272, 278, "PERSON"]], "meta": {}, "source": null}
{"text": "\"That's the way it is, great king! That's the way it is! Even affluent nobles, affluent brahmans, & affluent householders... tell deliberate lies with sensual pleasures as the cause, sensual pleasures as the reason, simply for the sake of sensual pleasures. That will lead to their long-term harm & pain.\"", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "[4] \"What do you think, monks? Which would in fact be the better? If a strong man were to wrap the body with a red-hot sheet of iron, burning, blazing, glowing? Or, to derive enjoyment from the robes given in faith by rich kshatriyas, brahmans, or householders?\"", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "Then Kesi the horsetrainer went to the Blessed One and, on arrival, having bowed down, sat to one side", "spans": [{"start": 5, "end": 26, "label": "PERSON", "text": "Kesi the horsetrainer"}, {"start": 39, "end": 50, "label": "PERSON", "text": "Blessed One"}], "entities": [[5, 26, "PERSON"], [39, 50, "PERSON"]], "meta": {}, "source": null}
{"text": "\"Once, monks, there was a teacher named Araka, a sectarian leader who was free of passion for sensual pleasures. He had many hundreds of students and he taught them the Dhamma in this way: 'Next to nothing, brahmans, is the life of human beings — limited, trifling, of much stress & many despairs. One should touch this [truth] like a sage, do what is skillful, follow the holy life. For one who is born there is no freedom from death.", "spans": [{"start": 40, "end": 45, "label": "PERSON", "text": "Araka"}], "entities": [[40, 45, "PERSON"]], "meta": {}, "source": null}
{"text": "\"Friends, in foreign lands there are wise nobles & brahmans, householders & contemplatives — for the people there are wise & discriminating — who will question a monk: 'What is your teacher's doctrine? What does he teach?' Have you listened well to the teachings — grasped them well, attended to them well, considered them well, penetrated them well by means of discernment — so that in answering you will speak in line with what the Blessed One has said, will not misrepresent the Blessed One with what is unfactual, will answer in line with the Dhamma, and no one whose thinking is in line with the Dhamma will have grounds for criticizing you?\"", "spans": [{"start": 434, "end": 445, "label": "PERSON", "text": "Blessed One"}, {"start": 482, "end": 493, "label": "PERSON", "text": "Blessed One"}], "entities": [[434, 445, "PERSON"], [482, 493, "PERSON"]], "meta": {}, "source": null}
{"text": "Then Anathapindika the householder went to the Blessed One and, on arrival, having bowed down to the Blessed One, sat to one side. As he was sitting there, the Blessed One said to him, \"When, for a disciple of the noble ones, five forms of fear & animosity are stilled; when he is endowed with the four factors of stream-entry; and when, through discernment, he has rightly seen & rightly ferreted out the noble method, then if he wants he may state about himself: 'Hell is ended; animal wombs are ended; the state of the hungry shades is ended; states of deprivation, destitution, the bad bourns are ended! I am a stream-winner, steadfast, never again destined for states of woe, headed for self-awakening!'", "spans": [{"start": 5, "end": 18, "label": "PERSON", "text": "Anathapindika"}, {"start": 47, "end": 58, "label": "PERSON", "text": "Blessed One"}, {"start": 101, "end": 112, "label": "PERSON", "text": "Blessed One"}, {"start": 160, "end": 171, "label": "PERSON", "text": "Blessed One"}], "entities": [[5, 18, "PERSON"], [47, 58, "PERSON"], [101, 112, "PERSON"], [160, 171, "PERSON"]], "meta": {}, "source": null}
{"text": "\"As for those delusion-born fevers — burned with which the householder or householder's son would sleep miserably — that delusion has been abandoned by the Tathagata, its root destroyed, made like a palmyra stump, deprived of the conditions of development, not destined for future arising. Therefore he sleeps in ease.", "spans": [{"start": 156, "end": 165, "label": "PERSON", "text": "Tathagata"}], "entities": [[156, 165, "PERSON"]], "meta": {}, "source": null}
{"text": "23. Thereupon the Blessed One addressed the devotees of Pataligama thus: \"The immoral man, householders, by falling away from virtue, encounters five perils: great loss of wealth through heedlessness; an evil reputation; a timid and troubled demeanor in every society, be it that of nobles, brahmans, householders, or ascetics; death in bewilderment; and, at the breaking up of the body after death, rebirth in a realm of misery, in an unhappy state, in the nether world, in hell.", "spans": [{"start": 18, "end": 29, "label": "PERSON", "text": "Blessed One"}], "entities": [[18, 29, "PERSON"]], "meta": {}, "source": null}
{"text": "One day recently when I was staying right here in Rajagaha, at Giribbaja, I heard it in the Blessed One's presence, learned it in the Blessed One's presence: 'Sutavan, an arahant monk whose mental fermentations are ended, who has reached fulfillment, done the task, laid down the burden, attained the true goal, totally destroyed the fetter of becoming, and who is released through right gnosis, cannot possibly transgress these five principles. It is impossible for a monk whose mental fermentations are ended to intentionally deprive a living being of life. It is impossible for a monk whose mental fermentations are ended to take, in the manner of stealing, what is not given. It is impossible for a monk whose mental fermentations are ended to engage in sexual intercourse. It is impossible for a monk whose mental fermentations are ended to tell a conscious lie. It is impossible for a monk whose mental fermentations are ended to consume stored-up sensual things as he did before, when he was a householder.' Now, did I hear this rightly from the Blessed One? Did I learn it rightly, attend to it rightly, understand it rightly?\"", "spans": [{"start": 50, "end": 58, "label": "GPE", "text": "Rajagaha"}, {"start": 63, "end": 72, "label": "GPE", "text": "Giribbaja"}, {"start": 92, "end": 105, "label": "PERSON", "text": "Blessed One's"}, {"start": 134, "end": 147, "label": "PERSON", "text": "Blessed One's"}, {"start": 159, "end": 166, "label": "PERSON", "text": "Sutavan"}, {"start": 1053, "end": 1064, "label": "PERSON", "text": "Blessed One"}], "entities": [[50, 58, "GPE"], [63, 72, "GPE"], [92, 105, "PERSON"], [134, 147, "PERSON"], [159, 166, "PERSON"], [1053, 1064, "PERSON"]], "meta": {}, "source": null}
{"text": "So they went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As they were sitting there, they told him, \"Ven. Bhaddiya, Kāḷigodhā's son, lord, on going to the wilderness, to the root of a tree, or to an empty dwelling, repeatedly exclaims, 'What bliss! What bliss!' There's no doubt but that Ven. Bhaddiya doesn't enjoy leading the holy life, for when he was a householder he knew the bliss of kingship, so that now, on recollecting that when going to the wilderness, to the root of a tree, or to an empty dwelling, he is repeatedly exclaiming, 'What bliss! What bliss!'\"", "spans": [{"start": 20, "end": 31, "label": "PERSON", "text": "Blessed One"}, {"start": 136, "end": 149, "label": "PERSON", "text": "Ven. Bhaddiya"}, {"start": 323, "end": 336, "label": "PERSON", "text": "Ven. Bhaddiya"}], "entities": [[20, 31, "PERSON"], [136, 149, "PERSON"], [323, 336, "PERSON"]], "meta": {}, "source": null}
{"text": "\"Now it may be that you are thinking, 'Nakula's mother will take another husband after I'm gone,' but you shouldn't see things in that way. You know as well as I how my fidelity [1] has been constant for the past sixteen years. So don't be worried as you die, householder. Death is painful for one who is worried. The Blessed One has criticized death when one is worried.", "spans": [{"start": 318, "end": 329, "label": "PERSON", "text": "Blessed One"}], "entities": [[318, 329, "PERSON"]], "meta": {}, "source": null}
{"text": "Then Vajjiya Mahita the householder went to where the wanderers of other persuasions were staying. On arrival he greeted them courteously. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, the wanderers said to him, \"Is it true, householder, that Gotama the contemplative criticizes all asceticism, that he categorically denounces & disparages all ascetics who live the rough life?\"", "spans": [{"start": 296, "end": 302, "label": "PERSON", "text": "Gotama"}], "entities": [[296, 302, "PERSON"]], "meta": {}, "source": null}
{"text": "A second time, Ven. Udayin said to Pañcakanga the carpenter, \"Householder, the Blessed One has not spoken of two feelings. He has spoken of three feelings...", "spans": [{"start": 79, "end": 90, "label": "PERSON", "text": "Blessed One"}], "entities": [[79, 90, "PERSON"]], "meta": {}, "source": null}
{"text": ". \"I recall having approached many hundred assemblies of nobles... many hundred assemblies of brahmans... many hundred assemblies of householders... many hundred assemblies of recluses... many hundred assemblies of gods of the heaven of the Four Great Kings... many hundred assemblies of gods of the heaven of the Thirty-three... many hundred assemblies of Mara's retinue... many hundred assemblies of Brahmas. And formerly I had sat with them there and talked with them and held conversations with them, yet I see no ground for thinking that fear or timidity might come upon me there. And seeing no ground for that, I abide in safety, fearlessness and intrepidity. [73]", "spans": [{"start": 357, "end": 363, "label": "PERSON", "text": "Mara's"}], "entities": [[357, 363, "PERSON"]], "meta": {}, "source": null}
{"text": "A third time, the Blessed One said to Kevatta the householder, \"Kevatta, I don't teach the monks in this way: 'Come, monks, display a miracle of psychic power to the lay people clad in white.'", "spans": [{"start": 18, "end": 29, "label": "PERSON", "text": "Blessed One"}, {"start": 38, "end": 45, "label": "PERSON", "text": "Kevatta"}, {"start": 64, "end": 71, "label": "PERSON", "text": "Kevatta"}], "entities": [[18, 29, "PERSON"], [38, 45, "PERSON"], [64, 71, "PERSON"]], "meta": {}, "source": null}
{"text": "\"This too, householder, is a single quality declared by the Blessed One — the one who knows, the one who sees, worthy & rightly self-awakened — where the unreleased mind of a monk who dwells there heedful, ardent, & resolute becomes released, or his unended fermentations go to their total ending, or he attains the unexcelled security from the yoke that he had not attained before.", "spans": [{"start": 60, "end": 71, "label": "PERSON", "text": "Blessed One"}], "entities": [[60, 71, "PERSON"]], "meta": {}, "source": null}
{"text": "On one occasion the Blessed One was staying near Nalanda in the Pavarika Mango Grove . Then Asibandhakaputta the headman went to the Blessed One and on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the Blessed One: \"The brahmans of the Western lands, lord — those who carry water pots, wear garlands of water plants, purify with water, & worship fire — can take [the spirit of] a dead person, lift it out, instruct it, & send it to heaven. But the Blessed One, worthy & rightly self-awakened, can arrange it so that all the world, at the break-up of the body, after death, reappears in a good destination, the heavenly world.\"", "spans": [{"start": 20, "end": 31, "label": "PERSON", "text": "Blessed One"}, {"start": 49, "end": 56, "label": "GPE", "text": "Nalanda"}, {"start": 133, "end": 144, "label": "PERSON", "text": "Blessed One"}, {"start": 243, "end": 254, "label": "PERSON", "text": "Blessed One"}, {"start": 489, "end": 500, "label": "PERSON", "text": "Blessed One"}], "entities": [[20, 31, "PERSON"], [49, 56, "GPE"], [133, 144, "PERSON"], [243, 254, "PERSON"], [489, 500, "PERSON"]], "meta": {}, "source": null}
{"text": "\"Sariputta, when you know of a householder clothed in white, that he is restrained in terms of the five training rules and that he obtains at will, without difficulty, without hardship, four pleasant mental abidings in the here & now, then if he wants he may state about himself: 'Hell is ended; animal wombs are ended; the state of the hungry shades is ended; states of deprivation, destitution, the bad bourns are ended! I am a stream-winner, steadfast, never again destined for states of woe, headed for self-awakening!'", "spans": [{"start": 1, "end": 10, "label": "PERSON", "text": "Sariputta"}, {"start": 337, "end": 350, "label": "NORP", "text": "hungry shades"}], "entities": [[1, 10, "PERSON"], [337, 350, "NORP"]], "meta": {}, "source": null}
{"text": "[3] \"What do you think, monks? Which would in fact be the better? If a strong man were to strike the nether-quarters with a sharp, oil-cleaned sword? Or, to derive enjoyment when rich kshatriyas, brahmans, or householders press the palms together in prayer?\"", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying at Savatthi in the Eastern Monastery, the palace of Migara 's mother, together with many well-known elder disciples — with Ven. Sariputta , Ven. Maha Moggallana , Ven. Maha Kassapa , Ven. Maha Kaccana , Ven. Maha Kotthita , Ven. Maha Kappina , Ven. Maha Cunda , Ven. Revata , Ven. Ananda , and other well-known elder disciples. On that occasion the elder monks were teaching & instructing. Some elder monks were teaching & instructing ten monks, some were teaching & instructing twenty monks, some were teaching & instructing thirty monks, some were teaching & instructing forty monks. The new monks, being taught & instructed by the elder monks, were discerning grand, successive distinctions.", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 65, "end": 73, "label": "GPE", "text": "Savatthi"}, {"start": 81, "end": 98, "label": "LOC", "text": "Eastern Monastery"}, {"start": 190, "end": 199, "label": "PERSON", "text": "Sariputta"}, {"start": 212, "end": 222, "label": "PERSON", "text": "Moggallana"}, {"start": 225, "end": 242, "label": "PERSON", "text": "Ven. Maha Kassapa"}, {"start": 270, "end": 283, "label": "PERSON", "text": "Maha Kotthita"}, {"start": 286, "end": 303, "label": "PERSON", "text": "Ven. Maha Kappina"}, {"start": 316, "end": 321, "label": "PERSON", "text": "Cunda"}, {"start": 343, "end": 349, "label": "PERSON", "text": "Ananda"}], "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [81, 98, "LOC"], [190, 199, "PERSON"], [212, 222, "PERSON"], [225, 242, "PERSON"], [270, 283, "PERSON"], [286, 303, "PERSON"], [316, 321, "PERSON"], [343, 349, "PERSON"]], "meta": {}, "source": null}
{"text": "\"Even so, Aggivessana, does a Tathagata arise here in the world, a perfected one, fully Self-Awakened One, endowed with right knowledge and conduct, well-farer, knower of the worlds, the matchless charioteer of men to be tamed, the Awakened One, the Lord. He makes known this world with the devas, with Mara, with Brahma, the creation with its recluses and brahmans, its devas and men, having realized them by his own super-knowledge. He teaches dhamma which is lovely at the beginning, lovely in the middle, lovely at the ending, with the spirit and the letters; he proclaims the Brahma-faring, [3] wholly fulfilled, quite purified. A householder or a householder's son or one born in another family hears that dhamma. Having heard that dhamma he gains faith in the Tathagata. Endowed with this faith that he has acquired, he reflects in this way: ' The household life is confined and dusty , going forth is in the open; it is not easy for one who lives in a house to fare the Brahma-faring wholly fulfilled, wholly pure, polished like a conch-shell. Suppose now that I, having cut off hair and beard, having put on saffron robes, should go forth from home into homelessness?' After a time, getting rid of his wealth, be it small or great, getting rid of his circle of relations, be it small or great, having cut off his hair and beard, having put on saffron robes, he goes forth from home into homelessness. To this extent, Aggivessana, the ariyan disciple gets out into the open.", "spans": [{"start": 10, "end": 21, "label": "PERSON", "text": "Aggivessana"}, {"start": 30, "end": 39, "label": "PERSON", "text": "Tathagata"}, {"start": 93, "end": 105, "label": "PERSON", "text": "Awakened One"}, {"start": 232, "end": 244, "label": "PERSON", "text": "Awakened One"}, {"start": 303, "end": 307, "label": "PERSON", "text": "Mara"}, {"start": 767, "end": 776, "label": "PERSON", "text": "Tathagata"}, {"start": 1426, "end": 1437, "label": "PERSON", "text": "Aggivessana"}], "entities": [[10, 21, "PERSON"], [30, 39, "PERSON"], [93, 105, "PERSON"], [232, 244, "PERSON"], [303, 307, "PERSON"], [767, 776, "PERSON"], [1426, 1437, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion Ven. Ananda was staying near Vesali at Veluvagamaka. Now on that occasion Dasama the householder from Atthakanagara had arrived at Pataliputta on some business. Then he went to a certain monk at Kukkata Monastery and on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the monk, \"Where is Ven. Ananda staying now? I'd like to see him.\"", "spans": [{"start": 34, "end": 45, "label": "PERSON", "text": "Ven. Ananda"}, {"start": 63, "end": 69, "label": "GPE", "text": "Vesali"}, {"start": 73, "end": 85, "label": "GPE", "text": "Veluvagamaka"}, {"start": 108, "end": 114, "label": "PERSON", "text": "Dasama"}, {"start": 136, "end": 149, "label": "GPE", "text": "Atthakanagara"}, {"start": 165, "end": 176, "label": "GPE", "text": "Pataliputta"}, {"start": 229, "end": 246, "label": "LOC", "text": "Kukkata Monastery"}, {"start": 361, "end": 372, "label": "PERSON", "text": "Ven. Ananda"}], "entities": [[34, 45, "PERSON"], [63, 69, "GPE"], [73, 85, "GPE"], [108, 114, "PERSON"], [136, 149, "GPE"], [165, 176, "GPE"], [229, 246, "LOC"], [361, 372, "PERSON"]], "meta": {}, "source": null}
{"text": "\"In the same way, householder, a disciple of the noble ones considers this point: 'The Blessed One has compared sensuality to a chain of bones, of much stress, much despair, & greater drawbacks.' Seeing this with right discernment, as it actually is, then avoiding the equanimity coming from multiplicity, dependent on multiplicity, he develops the equanimity coming from singleness, dependent on singleness, [1] where sustenance/clinging for the baits of the world ceases without trace.", "spans": [{"start": 87, "end": 98, "label": "PERSON", "text": "Blessed One"}], "entities": [[87, 98, "PERSON"]], "meta": {}, "source": null}
{"text": "Then Anathapindika the householder went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there the Blessed One said to him: \"These five things, householder, are welcome, agreeable, pleasant, & hard to obtain in the world. Which five?", "spans": [{"start": 5, "end": 18, "label": "PERSON", "text": "Anathapindika"}, {"start": 47, "end": 58, "label": "PERSON", "text": "Blessed One"}, {"start": 147, "end": 158, "label": "PERSON", "text": "Blessed One"}], "entities": [[5, 18, "PERSON"], [47, 58, "PERSON"], [147, 158, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying in Savatthi, at the Eastern Gatehouse. There he addressed Ven. Sariputta : \"Sariputta, do you take it on conviction that the faculty of conviction, when developed & pursued, gains a footing in the Deathless, has the Deathless as its goal & consummation? Do you take it on conviction that the faculty of persistence... mindfulness... concentration... discernment, when developed & pursued, gains a footing in the Deathless, has the Deathless as its goal & consummation?\"", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 65, "end": 73, "label": "GPE", "text": "Savatthi"}, {"start": 82, "end": 99, "label": "LOC", "text": "Eastern Gatehouse"}, {"start": 120, "end": 134, "label": "PERSON", "text": "Ven. Sariputta"}, {"start": 138, "end": 147, "label": "PERSON", "text": "Sariputta"}], "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [82, 99, "LOC"], [120, 134, "PERSON"], [138, 147, "PERSON"]], "meta": {}, "source": null}
{"text": "\"In the same way, householder, a disciple of the noble ones considers this point: 'The Blessed One has compared sensuality to the fruits of a tree, of much stress, much despair, & greater drawbacks.' Seeing this with right discernment, as it actually is present, then avoiding the equanimity coming from multiplicity, dependent on multiplicity, he develops the equanimity coming from singleness, dependent on singleness, where sustenance/clinging for the baits of the world ceases without trace.", "spans": [{"start": 87, "end": 98, "label": "PERSON", "text": "Blessed One"}], "entities": [[87, 98, "PERSON"]], "meta": {}, "source": null}
{"text": "On one occasion the householder Anathapindika was afflicted, suffering, and gravely ill. The venerable Sariputta dressed, and taking his bowl and outer robe, went to the residence of Anathapindika with Ananda as his attendant. Having gone there, he sat down on a seat made ready and said to Anathapindika: \"I hope you are getting well, I hope you are comfortable. I hope your painful feelings are subsiding and not increasing.\"", "spans": [{"start": 32, "end": 45, "label": "PERSON", "text": "Anathapindika"}, {"start": 183, "end": 196, "label": "PERSON", "text": "Anathapindika"}, {"start": 202, "end": 208, "label": "PERSON", "text": "Ananda"}, {"start": 291, "end": 304, "label": "PERSON", "text": "Anathapindika"}], "entities": [[32, 45, "PERSON"], [183, 196, "PERSON"], [202, 208, "PERSON"], [291, 304, "PERSON"]], "meta": {}, "source": null}
{"text": "\"In the same way, householder, a disciple of the noble ones considers this point: 'The Blessed One has compared sensuality to a lump of flesh, of much stress, much despair, & greater drawbacks.' Seeing this with right discernment, as it actually is, then avoiding the equanimity coming from multiplicity, dependent on multiplicity, he develops the equanimity coming from singleness, dependent on singleness, where sustenance/clinging for the baits of the world ceases without trace.", "spans": [{"start": 87, "end": 98, "label": "PERSON", "text": "Blessed One"}], "entities": [[87, 98, "PERSON"]], "meta": {}, "source": null}
{"text": "Then Anathapindika the householder, surrounded by about 500 lay followers, went to the Blessed One and, on arrival, having bowed down to him, sat to one side. So the Blessed One said to Ven. Sariputta : \"Sariputta, when you know of a householder clothed in white, that he is restrained in terms of the five training rules and that he obtains at will, without difficulty, without hardship, four pleasant mental abidings in the here & now, then if he wants he may state about himself: 'Hell is ended; animal wombs are ended; the state of the hungry shades is ended; states of deprivation, destitution, the bad bourns are ended! I am a stream-winner, steadfast, never again destined for states of woe, headed for self-awakening!'", "spans": [{"start": 5, "end": 18, "label": "PERSON", "text": "Anathapindika"}, {"start": 87, "end": 98, "label": "PERSON", "text": "Blessed One"}, {"start": 166, "end": 177, "label": "PERSON", "text": "Blessed One"}, {"start": 191, "end": 200, "label": "PERSON", "text": "Sariputta"}, {"start": 204, "end": 213, "label": "PERSON", "text": "Sariputta"}], "entities": [[5, 18, "PERSON"], [87, 98, "PERSON"], [166, 177, "PERSON"], [191, 200, "PERSON"], [204, 213, "PERSON"]], "meta": {}, "source": null}
{"text": "\"As, Aggivessana, an elephant tamer, driving a great post into the ground, ties a forest elephant to it by his neck so as to subdue his forest ways, so as to subdue his forest aspirations, and so as to subdue his distress, his fretting and fever for the forest, so as to make him pleased with villages and accustom him to human ways — even so, Aggivessana, these four applications of mindfulness are ties of the mind so as to subdue the ways of householders and to subdue the aspirations of householders and to subdue the distress, the fretting and fever of householders; they are for leading to the right path, for realizing nibbana.", "spans": [{"start": 5, "end": 16, "label": "PERSON", "text": "Aggivessana"}, {"start": 344, "end": 355, "label": "PERSON", "text": "Aggivessana"}], "entities": [[5, 16, "PERSON"], [344, 355, "PERSON"]], "meta": {}, "source": null}
{"text": "Then the Blessed One — having instructed, urged, roused, & encouraged the lay followers of Pāṭali Village for a large part of the night with Dhamma-talk — dismissed them, saying, \"The night is far gone, householders. Do what you think it is now time to do.\"", "spans": [{"start": 9, "end": 20, "label": "PERSON", "text": "Blessed One"}, {"start": 91, "end": 105, "label": "GPE", "text": "Pāṭali Village"}], "entities": [[9, 20, "PERSON"], [91, 105, "GPE"]], "meta": {}, "source": null}
{"text": "Once, monks, in this very Rājagaha, Suppabuddha the leper was the son of a rich money-lender. While being escorted to a pleasure park, he saw Tagarasikhin the Private Buddha going for alms in the city. On seeing him, the thought occurred to him, 'Who is this leper prowling about?' Spitting and disrespectfully turning his left side to Tagarasikhin the Private Buddha, he left. As a result of that deed he boiled in hell for many years, many hundreds of years, many thousands of years, many hundreds of thousands of years. And then as a remainder of the result of that deed he became a poor, miserable wretch of a person in this very Rājagaha. But on encountering the Dhamma & Vinaya made known by the Tathāgata, he acquired conviction, virtue, learning, relinquishment, & discernment. Having acquired conviction, virtue, learning, relinquishment, & discernment on encountering the Dhamma & Vinaya made known by the Tathāgata, now — on the break-up of the body, after death — he has reappeared in a good destination, the heavenly world, in company with the devas of the heaven of the Thirty-three. There he outshines the other devas both in beauty & in rank.\"\n", "spans": [{"start": 26, "end": 34, "label": "GPE", "text": "Rājagaha"}, {"start": 36, "end": 47, "label": "PERSON", "text": "Suppabuddha"}, {"start": 142, "end": 154, "label": "PERSON", "text": "Tagarasikhin"}, {"start": 159, "end": 173, "label": "PERSON", "text": "Private Buddha"}, {"start": 336, "end": 348, "label": "PERSON", "text": "Tagarasikhin"}, {"start": 353, "end": 367, "label": "PERSON", "text": "Private Buddha"}, {"start": 634, "end": 642, "label": "GPE", "text": "Rājagaha"}, {"start": 702, "end": 711, "label": "PERSON", "text": "Tathāgata"}, {"start": 916, "end": 925, "label": "PERSON", "text": "Tathāgata"}], "entities": [[26, 34, "GPE"], [36, 47, "PERSON"], [142, 154, "PERSON"], [159, 173, "PERSON"], [336, 348, "PERSON"], [353, 367, "PERSON"], [634, 642, "GPE"], [702, 711, "PERSON"], [916, 925, "PERSON"]], "meta": {}, "source": null}
{"text": "[The Blessed One said:] \"Well done, householder. Well done. That is how you should periodically & righteously refute those foolish men. I don't say that all asceticism is to be pursued, nor do I say that all asceticism is not to be pursued. I don't say that all observances should be observed, nor do I day that all observances should not be observed. I don't say that all exertions are to be pursued, nor do I say that all exertions are not to be pursued. I don't say that all forfeiture should be forfeited, nor do I say that all forfeiture should not be forfeited. I don't say that all release is to be used for release, nor do I say that all release is not to be used for release.", "spans": [{"start": 5, "end": 16, "label": "PERSON", "text": "Blessed One"}], "entities": [[5, 16, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying in Savatthi , at the Eastern Gatehouse. There he addressed Ven. Sariputta : \"Sariputta, do you take it on conviction that the faculty of conviction, when developed & pursued, gains a footing in the Deathless, has the Deathless as its goal & consummation? Do you take it on conviction that the faculty of persistence... mindfulness... concentration... discernment, when developed & pursued, gains a footing in the Deathless, has the Deathless as its goal & consummation?\"", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 65, "end": 73, "label": "GPE", "text": "Savatthi"}, {"start": 126, "end": 135, "label": "PERSON", "text": "Sariputta"}, {"start": 139, "end": 148, "label": "PERSON", "text": "Sariputta"}], "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [126, 135, "PERSON"], [139, 148, "PERSON"]], "meta": {}, "source": null}
{"text": "When Vajjiya Mahita the householder had been instructed, urged, roused & encouraged by the Blessed One with a talk on Dhamma, he got up from his seat and, having bowed down to the Blessed One, left, keeping the Blessed One on his right side. Not long afterward, the Blessed One addressed the monks: \"Monks, even a monk who has long penetrated the Dhamma in this Doctrine & Discipline would do well periodically & righteously to refute the wanderers of other persuasions in just the way Vajjiya Mahita the householder has done.\"", "spans": [{"start": 91, "end": 102, "label": "PERSON", "text": "Blessed One"}, {"start": 180, "end": 191, "label": "PERSON", "text": "Blessed One"}, {"start": 211, "end": 222, "label": "PERSON", "text": "Blessed One"}, {"start": 266, "end": 277, "label": "PERSON", "text": "Blessed One"}], "entities": [[91, 102, "PERSON"], [180, 191, "PERSON"], [211, 222, "PERSON"], [266, 277, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying at Rajagaha in the Bamboo Grove, the Squirrels' Sanctuary. Then Vassakara the brahman, the minister to the king of Magadha , approached the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side.", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 65, "end": 73, "label": "GPE", "text": "Rajagaha"}, {"start": 81, "end": 93, "label": "LOC", "text": "Bamboo Grove"}, {"start": 99, "end": 119, "label": "LOC", "text": "Squirrels' Sanctuary"}, {"start": 126, "end": 135, "label": "PERSON", "text": "Vassakara"}, {"start": 177, "end": 184, "label": "GPE", "text": "Magadha"}, {"start": 202, "end": 213, "label": "PERSON", "text": "Blessed One"}], "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [81, 93, "LOC"], [99, 119, "LOC"], [126, 135, "PERSON"], [177, 184, "GPE"], [202, 213, "PERSON"]], "meta": {}, "source": null}
{"text": "So Dasama the householder from Atthakanagara, having assembled the community of monks from Vesali and Pataliputta, with his own hands served & satisfied them with refined staple & non-staple foods. He presented a pair of cloths to each monk, and a triple robe to Ven. Ananda. And, for Ven. Ananda, he had a dwelling built worth five hundred [kahapanas].", "spans": [{"start": 3, "end": 9, "label": "PERSON", "text": "Dasama"}, {"start": 31, "end": 44, "label": "GPE", "text": "Atthakanagara"}, {"start": 91, "end": 97, "label": "GPE", "text": "Vesali"}, {"start": 102, "end": 113, "label": "GPE", "text": "Pataliputta"}, {"start": 268, "end": 274, "label": "PERSON", "text": "Ananda"}, {"start": 290, "end": 296, "label": "PERSON", "text": "Ananda"}], "entities": [[3, 9, "PERSON"], [31, 44, "GPE"], [91, 97, "GPE"], [102, 113, "GPE"], [268, 274, "PERSON"], [290, 296, "PERSON"]], "meta": {}, "source": null}
{"text": "\"But lord, who would ever think that sorrow, lamentation, pain, distress, & despair are born from one who is dear, come springing from one who is dear? Happiness & joy are born from one who is dear, come springing from one who is dear.\" So the householder, not delighting in the Blessed One's words, rejecting the Blessed One's words, got up from his seat and left.", "spans": [{"start": 279, "end": 292, "label": "PERSON", "text": "Blessed One's"}, {"start": 314, "end": 327, "label": "PERSON", "text": "Blessed One's"}], "entities": [[279, 292, "PERSON"], [314, 327, "PERSON"]], "meta": {}, "source": null}
{"text": "Then Ratthapala, not long after the brahmans & householders of Thullakotthita had left, approached the Blessed One and, on arrival, said to him, \"As I understand the Dhamma taught by the Blessed One, it's not easy, living at home, to practice the holy life totally perfect, totally pure, a polished shell. Lord, I want — having shaved off my hair & beard and putting on the ochre robe — to go forth from the household life into homelessness. May I receive the going-forth in the Blessed One's presence? May I receive admission?\"", "spans": [{"start": 103, "end": 114, "label": "PERSON", "text": "Blessed One"}, {"start": 187, "end": 198, "label": "PERSON", "text": "Blessed One"}, {"start": 479, "end": 492, "label": "PERSON", "text": "Blessed One's"}], "entities": [[103, 114, "PERSON"], [187, 198, "PERSON"], [479, 492, "PERSON"]], "meta": {}, "source": null}
{"text": "23. Thereupon the Blessed One addressed the devotees of Pataligama thus: \"The immoral man, householders, by falling away from virtue, encounters five perils: great loss of wealth through heedlessness; an evil reputation; a timid and troubled demeanor in every society, be it that of nobles, brahmans, householders, or ascetics; death in bewilderment; and, at the breaking up of the body after death, rebirth in a realm of misery, in an unhappy state, in the nether world, in hell.\"", "spans": [{"start": 18, "end": 29, "label": "PERSON", "text": "Blessed One"}, {"start": 56, "end": 66, "label": "GPE", "text": "Pataligama"}], "entities": [[18, 29, "PERSON"], [56, 66, "GPE"]], "meta": {}, "source": null}
{"text": "Then the brahmans & householders of Thullakotthita, having been instructed, urged, roused, & encouraged by the Blessed One's talk on Dhamma, delighted & rejoiced in his words. Rising from their seats, bowing down to him, they left, keeping him on their right.", "spans": [{"start": 111, "end": 124, "label": "PERSON", "text": "Blessed One's"}], "entities": [[111, 124, "PERSON"]], "meta": {}, "source": null}
{"text": "A third time, Ven. Udayin said to Pañcakanga the carpenter, \"Householder, the Blessed One has not spoken of two feelings. He has spoken of three feelings...", "spans": [{"start": 78, "end": 89, "label": "PERSON", "text": "Blessed One"}], "entities": [[78, 89, "PERSON"]], "meta": {}, "source": null}
{"text": "22. \"Now there are eight kinds of assemblies, Ananda, that is to say, assemblies of nobles, brahmans, householders, ascetics, of the Four Great Kings, of the Thirty-three gods, of Maras, and of Brahmas.", "spans": [{"start": 46, "end": 52, "label": "PERSON", "text": "Ananda"}], "entities": [[46, 52, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion Ven. Ananda was staying near Vesali at Veluvagamaka. Now on that occasion Dasama the householder from Atthakanagara had arrived at Pataliputta on some business. Then he went to a certain monk at Kukkata Monastery and on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the monk, \"Where is Ven. Ananda staying now? I'd like to see him.\"", "spans": [{"start": 39, "end": 45, "label": "PERSON", "text": "Ananda"}, {"start": 63, "end": 69, "label": "GPE", "text": "Vesali"}, {"start": 73, "end": 85, "label": "GPE", "text": "Veluvagamaka"}, {"start": 108, "end": 114, "label": "PERSON", "text": "Dasama"}, {"start": 136, "end": 149, "label": "GPE", "text": "Atthakanagara"}, {"start": 165, "end": 176, "label": "GPE", "text": "Pataliputta"}, {"start": 229, "end": 246, "label": "LOC", "text": "Kukkata Monastery"}, {"start": 366, "end": 372, "label": "PERSON", "text": "Ananda"}], "entities": [[39, 45, "PERSON"], [63, 69, "GPE"], [73, 85, "GPE"], [108, 114, "PERSON"], [136, 149, "GPE"], [165, 176, "GPE"], [229, 246, "LOC"], [366, 372, "PERSON"]], "meta": {}, "source": null}
{"text": "B1 . \"Now, householders, of those contemplatives & brahmans who hold this doctrine, hold this view — 'There is what is given, what is offered, what is sacrificed. There are fruits & results of good & bad actions. There is this world & the next world. There is mother & father. There are spontaneously reborn beings; there are brahmans & contemplatives who, faring rightly & practicing rightly, proclaim this world & the next after having directly known & realized it for themselves' — it can be expected that, shunning these three unskillful activities — bad bodily conduct, bad verbal conduct, bad mental conduct — they will adopt & practice these three skillful activities: good bodily conduct, good verbal conduct, good mental conduct. Why is that? Because those venerable contemplatives & brahmans see in unskillful activities the drawbacks, the degradation, and the defilement; and in skillful activities the rewards of renunciation, resembling cleansing.", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "\"Why wouldn't it have, Aggivessana? Before my Awakening, when I was still an unawakened Bodhisatta, the thought occurred to me: ' Household life is confining, a dusty path. Life gone forth is the open air. It isn't easy, living in a home, to practice the holy life totally perfect, totally pure, a polished shell. What if I, having shaved off my hair & beard and putting on the ochre robe, were to go forth from the household life into homelessness?'", "spans": [{"start": 23, "end": 34, "label": "PERSON", "text": "Aggivessana"}], "entities": [[23, 34, "PERSON"]], "meta": {}, "source": null}
{"text": "\"Herein, Vyagghapajja, by whatsoever activity a householder earns his living, whether by farming, by trading, by rearing cattle, by archery, by service under the king, or by any other kind of craft — at that he becomes skillful and is not lazy. He is endowed with the power of discernment as to the proper ways and means; he is able to carry out and allocate (duties). This is called the accomplishment of persistent effort.", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "\"That's the way it is, great king. That's the way it is. Once in the past that money-lending householder provided alms for the Private Buddha named Tagarasikhi . Saying [to his servant], 'Give alms to the contemplative,' he got up from his seat and left. After giving, though, he felt regret: 'It would have been better if my slaves or servants had eaten those alms.' And he also murdered his brother's only heir for the sake of his fortune. Now, the result of his action in having provided alms for the Private Buddha named Tagarasikhi was that he appeared seven times in a good destination, the heavenly world. And through the remaining result of that action he acted as money-lender seven times in this very same Savatthi. But the result of his action in feeling regret after giving [those] alms — 'It would have been better if my slaves or servants had eaten those alms' — was that his mind didn't lend itself to the lavish enjoyment of food, didn't lend itself to the lavish enjoyment of clothing, didn't lend itself to the lavish enjoyment of a vehicle, didn't lend itself to the lavish enjoyment of the five strings of sensuality. The result of his action in having murdered his brother's only heir for the sake of his fortune was that he boiled in hell for many years, many hundreds of years, many thousands of years, many hundred-thousands of years. And through the remaining result of that action he has left this seventh heirless fortune to the royal treasury.", "spans": [{"start": 127, "end": 141, "label": "PERSON", "text": "Private Buddha"}, {"start": 148, "end": 159, "label": "PERSON", "text": "Tagarasikhi"}, {"start": 504, "end": 518, "label": "PERSON", "text": "Private Buddha"}, {"start": 525, "end": 536, "label": "PERSON", "text": "Tagarasikhi"}, {"start": 716, "end": 724, "label": "GPE", "text": "Savatthi"}], "entities": [[127, 141, "PERSON"], [148, 159, "PERSON"], [504, 518, "PERSON"], [525, 536, "PERSON"], [716, 724, "GPE"]], "meta": {}, "source": null}
{"text": "\"A householder or householder's son, hearing the Dhamma, gains conviction in the Tathagata and reflects: 'Household life is confining, a dusty path. Life gone forth is the open air. It isn't easy, living at home, to practice the holy life totally perfect, totally pure, a polished shell. What if I, having shaved off my hair & beard and putting on the ochre robe, were to go forth from the household life into homelessness?'", "spans": [{"start": 81, "end": 90, "label": "PERSON", "text": "Tathagata"}], "entities": [[81, 90, "PERSON"]], "meta": {}, "source": null}
{"text": "\"In that case, householder, I will question you in return. Answer as you see fit. Now, what do you think: those who teach a Dhamma for the abandoning of passion, for the abandoning of aversion, for the abandoning of delusion — is their Dhamma well-taught or not? Or how does this strike you?\"", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "Thus have I heard: At one time the Exalted One was staying near Savatthi at the Eastern monastery in the mansion (given by) Migara 's mother. Then Visakha , [1] Migara's mother, approached the Exalted One; having approached and bowed down she sat down in a suitable place. When she was seated the Exalted One spoke thus to Visakha, Migara's Mother:", "spans": [{"start": 64, "end": 72, "label": "GPE", "text": "Savatthi"}, {"start": 80, "end": 97, "label": "LOC", "text": "Eastern monastery"}, {"start": 147, "end": 154, "label": "PERSON", "text": "Visakha"}, {"start": 323, "end": 330, "label": "PERSON", "text": "Visakha"}], "entities": [[64, 72, "GPE"], [80, 97, "LOC"], [147, 154, "PERSON"], [323, 330, "PERSON"]], "meta": {}, "source": null}
{"text": "Then, in the evening, Ven. Udayin left seclusion and went to the Blessed One. On arrival, having bowed down to him, he sat to one side. As he was sitting there he said to the Blessed One: \"Just now, lord, as I was alone in seclusion, this train of thought arose in my awareness: 'So many painful things has the Blessed One taken away from us! So many pleasant things has he brought us! So many unskillful qualities has the Blessed One taken away from us! So many skillful qualities has he brought us!' For in the past, lord, we used to eat in the morning, in the evening, and in the day at the wrong time (the afternoon). Then there was the time when the Blessed One addressed the monks, saying, 'Monks, please discontinue that daytime meal at the wrong time.' [1] For just a day I was upset, for just a day I was sad, [thinking], 'The exquisite staple & non-staple foods that faithful householders give us during the day at the wrong time: even those the Blessed One has us abandon; even those the One Well-gone has us relinquish!' But, considering our love & respect & shame & compunction around the Blessed One, we abandoned that daytime meal at the wrong time.", "spans": [{"start": 65, "end": 76, "label": "PERSON", "text": "Blessed One"}, {"start": 175, "end": 186, "label": "PERSON", "text": "Blessed One"}, {"start": 311, "end": 322, "label": "PERSON", "text": "Blessed One"}, {"start": 423, "end": 434, "label": "PERSON", "text": "Blessed One"}, {"start": 655, "end": 666, "label": "PERSON", "text": "Blessed One"}, {"start": 956, "end": 967, "label": "PERSON", "text": "Blessed One"}, {"start": 1102, "end": 1113, "label": "PERSON", "text": "Blessed One"}], "entities": [[65, 76, "PERSON"], [175, 186, "PERSON"], [311, 322, "PERSON"], [423, 434, "PERSON"], [655, 666, "PERSON"], [956, 967, "PERSON"], [1102, 1113, "PERSON"]], "meta": {}, "source": null}
{"text": "\"In the same way, householder, a disciple of the noble ones considers this point: 'The Blessed One has compared sensuality to a grass torch, of much stress, much despair, & greater drawbacks.' Seeing this with right discernment, as it actually is, then avoiding the equanimity coming from multiplicity, dependent on multiplicity, he develops the equanimity coming from singleness, dependent on singleness, where sustenance/clinging for the baits of the world ceases without trace.", "spans": [{"start": 87, "end": 98, "label": "PERSON", "text": "Blessed One"}], "entities": [[87, 98, "PERSON"]], "meta": {}, "source": null}
{"text": "\"Now it may be that you are thinking, 'Nakula's mother will have no desire to go see the Blessed One, to go see the community of monks, after I'm gone,' but you shouldn't see things in that way. I will have an even greater desire to go see the Blessed One, to go see the community of monks, after you are gone. So don't be worried as you die, householder. Death is painful for one who is worried. The Blessed One has criticized being worried at the time of death.", "spans": [{"start": 89, "end": 100, "label": "PERSON", "text": "Blessed One"}, {"start": 244, "end": 255, "label": "PERSON", "text": "Blessed One"}, {"start": 401, "end": 412, "label": "PERSON", "text": "Blessed One"}], "entities": [[89, 100, "PERSON"], [244, 255, "PERSON"], [401, 412, "PERSON"]], "meta": {}, "source": null}
{"text": "When this was said, Ven. Sariputta said to the Blessed One, \"It's amazing, lord. It's astounding, how well put that was by the Blessed One: 'Householder, you have provided the community of monks with robes, alms food, lodgings, & medicinal requisites for the sick, but you shouldn't rest content with the thought, \"We have provided the community of monks with robes, alms food, lodgings, & medicinal requisites for the sick.\" So you should train yourself, \"Let's periodically enter & remain in seclusion & rapture.\" That's how you should train yourself.'", "spans": [{"start": 25, "end": 34, "label": "PERSON", "text": "Sariputta"}, {"start": 47, "end": 58, "label": "PERSON", "text": "Blessed One"}, {"start": 127, "end": 138, "label": "PERSON", "text": "Blessed One"}], "entities": [[25, 34, "PERSON"], [47, 58, "PERSON"], [127, 138, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying in Rajagaha , on Vulture Peak Mountain. Then Sutavan the wanderer went to the Blessed One and, on arrival, exchanged courteous greetings with him.", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 65, "end": 73, "label": "GPE", "text": "Rajagaha"}, {"start": 79, "end": 100, "label": "LOC", "text": "Vulture Peak Mountain"}, {"start": 107, "end": 127, "label": "PERSON", "text": "Sutavan the wanderer"}, {"start": 140, "end": 151, "label": "PERSON", "text": "Blessed One"}], "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [79, 100, "LOC"], [107, 127, "PERSON"], [140, 151, "PERSON"]], "meta": {}, "source": null}
{"text": "So the brahman householders of Sala went to the Blessed One. On arrival, some of them, bowing down to him, sat to one side. Some of them exchanged courteous greetings with him and, after an exchange of friendly greetings & courtesies, sat to one side. Some of them, placing their hands palm-to-palm over the heart in his direction, sat to one side. Some of them, announcing their name and clan in his presence, sat to one side. Some of them, remaining silent, sat to one side.", "spans": [{"start": 48, "end": 59, "label": "PERSON", "text": "Blessed One"}], "entities": [[48, 59, "PERSON"]], "meta": {}, "source": null}
{"text": "Now at that time Susima the wanderer was living in Rajagaha with a large following of wanderers. And so Susima's following of wanderers said to him, \"Come now, friend Susima. Go live the holy life under Gotama the contemplative. When you have completely mastered the Dhamma, tell it to us; when we have completely mastered it, we will teach it to householders and then we, too, will be worshipped, revered, honored, venerated, given homage; we too will become recipients of robes, almsfood, lodgings, & medical requisites for the sick.\"", "spans": [{"start": 51, "end": 59, "label": "GPE", "text": "Rajagaha"}, {"start": 203, "end": 209, "label": "PERSON", "text": "Gotama"}], "entities": [[51, 59, "GPE"], [203, 209, "PERSON"]], "meta": {}, "source": null}
{"text": "he said to Ven. Maha Kaccana, \"I have heard it said, Master Kaccana, that, 'Kaccana the contemplative does not raise his hands in respect to aged, venerable brahmans — advanced in years, come to the last stage of life — nor does he rise up to greet them, nor does he offer them a seat.' Insofar as you don't raise your hands in respect to aged, venerable brahmans — advanced in years, come to the last stage of life — nor rise up to greet them, nor offer them a seat, that is simply not right, Master Kaccana.\"", "spans": [{"start": 11, "end": 28, "label": "PERSON", "text": "Ven. Maha Kaccana"}, {"start": 53, "end": 67, "label": "PERSON", "text": "Master Kaccana"}, {"start": 76, "end": 83, "label": "PERSON", "text": "Kaccana"}, {"start": 494, "end": 508, "label": "PERSON", "text": "Master Kaccana"}], "entities": [[11, 28, "PERSON"], [53, 67, "PERSON"], [76, 83, "PERSON"], [494, 508, "PERSON"]], "meta": {}, "source": null}
{"text": "\"Furthermore, whatever assembly the virtuous person, consummate in virtue, approaches — whether of noble warriors, brahmans, householders, or contemplatives — he/she does so with confidence & unabashed. This is the third reward coming from a virtuous person's consummation in virtue.", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "When this had been said, the wanderers said to Anathapindika the householder, \"We have each & every one expounded to you in line with our own positions. Now tell us what views you have.\"", "spans": [{"start": 47, "end": 60, "label": "PERSON", "text": "Anathapindika"}], "entities": [[47, 60, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying at Rajagaha, in Jivaka Komarabhacca's mango grove, with a large community of monks — 1,250 monks in all. Now at that time — it being the observance day, the full-moon night of the water-lily season, the fourth month of the rains — King Ajatasattu of Magadha, the son of Queen Videha , was sitting on the roof terrace of his palace surrounded by his ministers. Then he felt inspired to exclaim: \"How wonderful is this moonlit night! How beautiful... How lovely... How inspiring... How auspicious is this moonlit night! What brahman or contemplative should we visit tonight who might enlighten and bring peace to our mind?\"", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 65, "end": 73, "label": "GPE", "text": "Rajagaha"}, {"start": 78, "end": 111, "label": "LOC", "text": "Jivaka Komarabhacca's mango grove"}, {"start": 293, "end": 319, "label": "PERSON", "text": "King Ajatasattu of Magadha"}, {"start": 332, "end": 344, "label": "PERSON", "text": "Queen Videha"}], "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [78, 111, "LOC"], [293, 319, "PERSON"], [332, 344, "PERSON"]], "meta": {}, "source": null}
{"text": "22. And the Blessed One got ready, and taking his bowl and robe, went to the council hall together with the company of bhikkhus. After rinsing his feet, the Blessed One entered the council hall and took his seat close to the middle pillar, facing east. The community of bhikkhus, after rinsing their feet, also entered the council hall and took seats near the western wall, facing east, so that the Blessed One was before them. And the devotees of Pataligama, after rinsing their feet and entering the council hall, sat down near the eastern wall, facing west, so that the Blessed One was in front of them.", "spans": [{"start": 12, "end": 23, "label": "PERSON", "text": "Blessed One"}, {"start": 157, "end": 168, "label": "PERSON", "text": "Blessed One"}, {"start": 399, "end": 410, "label": "PERSON", "text": "Blessed One"}, {"start": 448, "end": 458, "label": "GPE", "text": "Pataligama"}, {"start": 573, "end": 584, "label": "PERSON", "text": "Blessed One"}], "entities": [[12, 23, "PERSON"], [157, 168, "PERSON"], [399, 410, "PERSON"], [448, 458, "GPE"], [573, 584, "PERSON"]], "meta": {}, "source": null}
{"text": "[7] \"What do you think, monks? Which would in fact be the better? If a strong man, having gripped one, heels up, head down, were to force one down into a red-hot iron cauldron, burning, blazing, glowing, and where there is boiling scum on top, he were to go once up, once down, and then once sideways? Or, to derive enjoyment from an abode given in faith by rich kshatriyas, or brahmans, or householders?\"", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "\"Actually, householder, you have asked last what should have been asked first. Nevertheless, I will answer you. Two qualities are of great help in the attainment of the cessation of perception & feeling: tranquillity & insight.\" [5]", "spans": [{"start": 1, "end": 9, "label": "PERSON", "text": "Actually"}], "entities": [[1, 9, "PERSON"]], "meta": {}, "source": null}
{"text": ". Thus have I heard. On one occasion the Blessed One was wandering in the Kosalan country with a large Sangha of bhikkhus", "spans": [{"start": 41, "end": 52, "label": "PERSON", "text": "Blessed One"}, {"start": 74, "end": 89, "label": "LOC", "text": "Kosalan country"}, {"start": 103, "end": 109, "label": "NORP", "text": "Sangha"}], "entities": [[41, 52, "PERSON"], [74, 89, "LOC"], [103, 109, "NORP"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying near Campa , on the shore of Gaggara Lake . Then Vajjiya Mahita the householder left Campa in the middle of the day to see the Blessed One, but the thought then occurred to him, \"Now is not the right time to see the Blessed One, for he is in seclusion. And it is not the right time to see the monks who develop the mind, for they are in seclusion. What if I were to visit the park of the wanderers of other persuasions?\" So he headed to the park of the wanderers of other persuasions.", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 189, "end": 200, "label": "PERSON", "text": "Blessed One"}, {"start": 278, "end": 289, "label": "PERSON", "text": "Blessed One"}], "entities": [[38, 49, "PERSON"], [189, 200, "PERSON"], [278, 289, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that at one time the Blessed One was staying at Nadika , in the Brick Hall. There he addressed the monks, \"Monks!\"", "spans": [{"start": 34, "end": 45, "label": "PERSON", "text": "Blessed One"}, {"start": 61, "end": 67, "label": "GPE", "text": "Nadika"}, {"start": 77, "end": 87, "label": "LOC", "text": "Brick Hall"}], "entities": [[34, 45, "PERSON"], [61, 67, "GPE"], [77, 87, "LOC"]], "meta": {}, "source": null}
{"text": "Then Anathapindika the householder went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there the Blessed One said to him: \"There are these five benefits that can be obtained from wealth. Which five?", "spans": [{"start": 5, "end": 18, "label": "PERSON", "text": "Anathapindika"}, {"start": 47, "end": 58, "label": "PERSON", "text": "Blessed One"}, {"start": 147, "end": 158, "label": "PERSON", "text": "Blessed One"}], "entities": [[5, 18, "PERSON"], [47, 58, "PERSON"], [147, 158, "PERSON"]], "meta": {}, "source": null}
{"text": "A number of bhikkhus heard the Venerable Bhaddiya... constantly uttering, \"Ah, what bliss! Ah, what bliss!\" and the thought came to them: \"No doubt, friend, the Venerable Bhaddiya, Kaligodha's son, is dissatisfied with leading the holy life, since formerly when he was a householder he enjoyed the bliss of royalty. And when recollecting that, on going into the forest... he utters, 'Ah, what bliss! Ah, what bliss!'\"", "spans": [{"start": 31, "end": 49, "label": "PERSON", "text": "Venerable Bhaddiya"}, {"start": 161, "end": 179, "label": "PERSON", "text": "Venerable Bhaddiya"}], "entities": [[31, 49, "PERSON"], [161, 179, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying in Rajagaha , on Vulture Peak Mountain. Then Sutavan the wanderer went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to the Blessed One: \"One day recently when I was staying right here in Rajagaha, at Giribbaja , I heard it in the Blessed One's presence, learned it in the Blessed One's presence: 'Sutavan, an arahant monk whose mental fermentations are ended, who has reached fulfillment, done the task, laid down the burden, attained the true goal, totally destroyed the fetter of becoming, and who is released through right gnosis, cannot possibly transgress these five principles. It is impossible for a monk whose mental fermentations are ended to intentionally deprive a living being of life. It is impossible for a monk whose mental fermentations are ended to take, in the manner of stealing, what is not given. It is impossible for a monk whose mental fermentations are ended to engage in sexual intercourse. It is impossible for a monk whose mental fermentations are ended to tell a conscious lie. It is impossible for a monk whose mental fermentations are ended to consume stored-up sensual things as he did before, when he was a householder.' Now, did I hear this rightly from the Blessed One? Did I learn it rightly, attend to it rightly, understand it rightly?\"", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 65, "end": 73, "label": "GPE", "text": "Rajagaha"}, {"start": 79, "end": 100, "label": "LOC", "text": "Vulture Peak Mountain"}, {"start": 107, "end": 114, "label": "PERSON", "text": "Sutavan"}, {"start": 140, "end": 151, "label": "PERSON", "text": "Blessed One"}, {"start": 323, "end": 334, "label": "PERSON", "text": "Blessed One"}, {"start": 387, "end": 395, "label": "GPE", "text": "Rajagaha"}, {"start": 400, "end": 409, "label": "GPE", "text": "Giribbaja"}, {"start": 430, "end": 443, "label": "PERSON", "text": "Blessed One's"}, {"start": 472, "end": 485, "label": "PERSON", "text": "Blessed One's"}, {"start": 497, "end": 504, "label": "PERSON", "text": "Sutavan"}, {"start": 1391, "end": 1402, "label": "PERSON", "text": "Blessed One"}], "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [79, 100, "LOC"], [107, 114, "PERSON"], [140, 151, "PERSON"], [323, 334, "PERSON"], [387, 395, "GPE"], [400, 409, "GPE"], [430, 443, "PERSON"], [472, 485, "PERSON"], [497, 504, "PERSON"], [1391, 1402, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying near Sāvatthī at the Eastern Monastery, the palace of Migāra's mother. [1] And on that occasion, Visākhā, Migāra's mother, had some dealings with King Pasenadi Kosala that he did not settle as she had wished. So in the middle of the day she went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As she was sitting there the Blessed One said to her, \"Well now, Visākhā, where are you coming from in the middle of the day?\"", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 67, "end": 75, "label": "GPE", "text": "Sāvatthī"}, {"start": 83, "end": 100, "label": "LOC", "text": "Eastern Monastery"}, {"start": 159, "end": 166, "label": "PERSON", "text": "Visākhā"}, {"start": 208, "end": 228, "label": "PERSON", "text": "King Pasenadi Kosala"}, {"start": 315, "end": 326, "label": "PERSON", "text": "Blessed One"}, {"start": 416, "end": 427, "label": "PERSON", "text": "Blessed One"}, {"start": 452, "end": 459, "label": "PERSON", "text": "Visākhā"}], "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [83, 100, "LOC"], [159, 166, "PERSON"], [208, 228, "PERSON"], [315, 326, "PERSON"], [416, 427, "PERSON"], [452, 459, "PERSON"]], "meta": {}, "source": null}
{"text": "When this was said, Citta the householder said to the garden devas, forest devas, tree devas, and devas inhabiting herbs, grasses, & forest giants: \"Even that is inconstant; even that is impermanent; one must abandon even that when one passes on.\"", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "\"Just now, lord, a money-lending householder died in Savatthi. I have come from conveying his heirless fortune to the royal palace: eight million in silver, to say nothing of the gold. But even though he was a money-lending householder, his enjoyment of food was like this: he ate broken rice & pickle brine. His enjoyment of clothing was like this: he wore three lengths of hempen cloth. His enjoyment of a vehicle was like this: he rode in a dilapidated little cart with an awning of leaves.\"", "spans": [{"start": 53, "end": 61, "label": "GPE", "text": "Savatthi"}], "entities": [[53, 61, "GPE"]], "meta": {}, "source": null}
{"text": "\"Monks, the taking of life — when indulged in, developed, & pursued — is something that leads to hell, leads to rebirth as a common animal, leads to the realm of the hungry shades. The slightest of all the results coming from the taking of life is that, when one becomes a human being, it leads to a short life span.", "spans": [{"start": 166, "end": 179, "label": "NORP", "text": "hungry shades"}], "entities": [[166, 179, "NORP"]], "meta": {}, "source": null}
{"text": "Thus have I heard. At one time the Lord was staying near Savatthi in the Eastern Park at Migara's mother's mansion. On that occasion the Lord was sitting surrounded by the Order of bhikkhus, as it was the day of the Uposatha observance. Then, when the night was far advanced and the first watch had ended, the Venerable Ananda arose from his seat, arranged his robe over one shoulder, raised his folded hands, and said to the Lord: \"The night is far advanced, revered sir, the first watch has ended and the bhikkhus have been sitting for a long time. Revered sir, let the Lord recite the Patimokkha to the bhikkhus.\" When this was said the Lord remained silent.", "spans": [{"start": 57, "end": 65, "label": "GPE", "text": "Savatthi"}, {"start": 73, "end": 85, "label": "LOC", "text": "Eastern Park"}, {"start": 310, "end": 326, "label": "PERSON", "text": "Venerable Ananda"}], "entities": [[57, 65, "GPE"], [73, 85, "LOC"], [310, 326, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying near Pava in Cunda the silversmith's mango grove. Then Cunda the silversmith went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there, the Blessed One said to him: \"Cunda, of whose rites of purification do you approve?\"", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 67, "end": 71, "label": "GPE", "text": "Pava"}, {"start": 75, "end": 110, "label": "LOC", "text": "Cunda the silversmith's mango grove"}, {"start": 117, "end": 138, "label": "PERSON", "text": "Cunda the silversmith"}, {"start": 151, "end": 162, "label": "PERSON", "text": "Blessed One"}, {"start": 252, "end": 263, "label": "PERSON", "text": "Blessed One"}, {"start": 278, "end": 283, "label": "PERSON", "text": "Cunda"}], "entities": [[38, 49, "PERSON"], [67, 71, "GPE"], [75, 110, "LOC"], [117, 138, "PERSON"], [151, 162, "PERSON"], [252, 263, "PERSON"], [278, 283, "PERSON"]], "meta": {}, "source": null}
{"text": "Then two brahman cosmologists went to the Blessed One and, on arrival, exchanged courteous greetings with him.", "spans": [{"start": 9, "end": 29, "label": "NORP", "text": "brahman cosmologists"}, {"start": 42, "end": 53, "label": "PERSON", "text": "Blessed One"}], "entities": [[9, 29, "NORP"], [42, 53, "PERSON"]], "meta": {}, "source": null}
{"text": "B1 . \"Now, householders, of those contemplatives & brahmans who hold this doctrine, hold this view — 'There is causality, there is requisite condition, for the defilement of beings... It's not the case that all living beings, all life, all beings, all souls are powerless, devoid of strength, devoid of effort; or that subject to the changes of fate, serendipity, and nature, they experience pleasure and pain in the six great classes of birth' — it can be expected that, shunning these three unskillful activities — bad bodily conduct, bad verbal conduct, bad mental conduct — they will adopt & practice these three skillful activities: good bodily conduct, good verbal conduct, good mental conduct. Why is that? Because those venerable contemplatives & brahmans see in unskillful activities the drawbacks, the degradation, and the defilement; and in skillful activities the rewards of renunciation, resembling cleansing.", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "Thus have I heard. At one time the Lord was journeying among the Mallas together with a large Order of bhikkhus and came to the brahman village of the Mallas called Thuna. The brahman householders who lived in Thuna heard: \"The recluse Gotama, the Sakyan son who went forth from the Sakya clan, has been journeying among the Mallas together with a large Order of bhikkhus and has arrived at Thuna.\" They then filled the well to the brim with grass and chaff, thinking, \"Don't let those shaven-headed recluses get water to drink.\"", "spans": [{"start": 165, "end": 170, "label": "GPE", "text": "Thuna"}, {"start": 210, "end": 215, "label": "GPE", "text": "Thuna"}, {"start": 236, "end": 242, "label": "PERSON", "text": "Gotama"}, {"start": 391, "end": 396, "label": "GPE", "text": "Thuna"}], "entities": [[165, 170, "GPE"], [210, 215, "GPE"], [236, 242, "PERSON"], [391, 396, "GPE"]], "meta": {}, "source": null}
{"text": "\"But, monks, if one who is of poor conduct, an evil-minded one, a filthy doer of complete wickedness who acts in an underhand manner, who pretends to be a recluse yet is not a recluse, who pretends to lead the holy life yet does not lead the holy life, an inwardly-putrid, impure-natured one, were to embrace a kshatriya or brahman or householder woman with young and tender hands and feet, and sit or lie down close to her — for him, monks, there would be a long period of harm and suffering, and on the break-up of the body after death he would be reborn into a place of woe, a realm of misery, a place of suffering, a purgatory.\"", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "[ At Kapilavasthu ] Now at that time Sarakaani the Sakyan, who had died, was proclaimed by the Blessed One to be a Stream-Winner, not subject to rebirth in states of woe, assured of enlightenment. At this, a number of the Sakyans, whenever they met each other or came together in company, were indignant and angry, and said scornfully: \"A fine thing, a marvelous thing! Nowadays anyone can become a Stream-Winner, if the Blessed One has proclaimed Sarakaani who died to be Stream-Winner... assured of enlightenment! Why, Sarakaani failed in his training and took to drink!\"", "spans": [{"start": 5, "end": 17, "label": "GPE", "text": "Kapilavasthu"}, {"start": 37, "end": 46, "label": "PERSON", "text": "Sarakaani"}, {"start": 51, "end": 57, "label": "NORP", "text": "Sakyan"}, {"start": 95, "end": 106, "label": "PERSON", "text": "Blessed One"}, {"start": 222, "end": 229, "label": "NORP", "text": "Sakyans"}, {"start": 421, "end": 432, "label": "PERSON", "text": "Blessed One"}, {"start": 448, "end": 457, "label": "PERSON", "text": "Sarakaani"}, {"start": 521, "end": 530, "label": "PERSON", "text": "Sarakaani"}], "entities": [[5, 17, "GPE"], [37, 46, "PERSON"], [51, 57, "NORP"], [95, 106, "PERSON"], [222, 229, "NORP"], [421, 432, "PERSON"], [448, 457, "PERSON"], [521, 530, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying near Sāvatthī at the Eastern Monastery, the palace of Migāra's mother. And on that occasion a dear and beloved grandson of Visākhā, Migāra's mother, had died. So Visākhā, Migāra's mother — her clothes wet, her hair wet — went to the Blessed One in the middle of the day and, on arrival, having bowed down to him, sat to one side. As she was sitting there the Blessed One said to her: \"Why have you come here, Visākhā — your clothes wet, your hair wet — in the middle of the day?\"", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 67, "end": 75, "label": "GPE", "text": "Sāvatthī"}, {"start": 83, "end": 100, "label": "LOC", "text": "Eastern Monastery"}, {"start": 185, "end": 192, "label": "PERSON", "text": "Visākhā"}, {"start": 224, "end": 231, "label": "PERSON", "text": "Visākhā"}, {"start": 295, "end": 306, "label": "PERSON", "text": "Blessed One"}, {"start": 421, "end": 432, "label": "PERSON", "text": "Blessed One"}, {"start": 471, "end": 478, "label": "PERSON", "text": "Visākhā"}], "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [83, 100, "LOC"], [185, 192, "PERSON"], [224, 231, "PERSON"], [295, 306, "PERSON"], [421, 432, "PERSON"], [471, 478, "PERSON"]], "meta": {}, "source": null}
{"text": "When this was said, the Blessed One said to Kevatta the householder, \"Kevatta, I don't teach the monks in this way: 'Come, monks, display a miracle of psychic power to the lay people clad in white.'\"", "spans": [{"start": 24, "end": 35, "label": "PERSON", "text": "Blessed One"}, {"start": 44, "end": 51, "label": "PERSON", "text": "Kevatta"}, {"start": 70, "end": 77, "label": "PERSON", "text": "Kevatta"}], "entities": [[24, 35, "PERSON"], [44, 51, "PERSON"], [70, 77, "PERSON"]], "meta": {}, "source": null}
{"text": "\"Cunda, the purification rites declared by the brahmans of the Western lands... are one thing; the purification in the discipline of the noble ones is something else entirely.\"", "spans": [{"start": 1, "end": 6, "label": "PERSON", "text": "Cunda"}], "entities": [[1, 6, "PERSON"]], "meta": {}, "source": null}
{"text": "\"Now it may be that you are thinking, 'Nakula's mother will not attain inner tranquillity of awareness after I'm gone,' but you shouldn't see things in that way. To the extent that the Blessed One has white-clad householder female disciples who attain inner tranquillity of awareness, I am one of them. If anyone doubts or denies this, let him go ask the Blessed One, the worthy one, the rightly self-awakened one who is staying among the Bhaggas in the Deer Park at Bhesakala Grove, near Crocodile Haunt. So don't be worried as you die, householder. Death is painful for one who is worried. The Blessed One has criticized being worried at the time of death.", "spans": [{"start": 185, "end": 196, "label": "PERSON", "text": "Blessed One"}, {"start": 355, "end": 366, "label": "PERSON", "text": "Blessed One"}, {"start": 439, "end": 446, "label": "NORP", "text": "Bhaggas"}, {"start": 454, "end": 463, "label": "LOC", "text": "Deer Park"}, {"start": 467, "end": 482, "label": "LOC", "text": "Bhesakala Grove"}, {"start": 489, "end": 504, "label": "LOC", "text": "Crocodile Haunt"}, {"start": 596, "end": 607, "label": "PERSON", "text": "Blessed One"}], "entities": [[185, 196, "PERSON"], [355, 366, "PERSON"], [439, 446, "NORP"], [454, 463, "LOC"], [467, 482, "LOC"], [489, 504, "LOC"], [596, 607, "PERSON"]], "meta": {}, "source": null}
{"text": "The community of bhikkhus, after rinsing their feet, also entered the council hall and took seats near the western wall, facing east, so that the Blessed One was before them. And the devotees of Pataligama, after rinsing their feet and entering the council hall, sat down near the eastern wall, facing west, so that the Blessed One was in front of them.", "spans": [{"start": 146, "end": 157, "label": "PERSON", "text": "Blessed One"}, {"start": 195, "end": 205, "label": "GPE", "text": "Pataligama"}, {"start": 320, "end": 331, "label": "PERSON", "text": "Blessed One"}], "entities": [[146, 157, "PERSON"], [195, 205, "GPE"], [320, 331, "PERSON"]], "meta": {}, "source": null}
{"text": "22. \"Now there are eight kinds of assemblies, Ananda, that is to say, assemblies of nobles, brahmans, householders, ascetics, of the Four Great Kings, of the Thirty-three gods, of Maras, and of Brahmas.\"", "spans": [{"start": 46, "end": 52, "label": "PERSON", "text": "Ananda"}, {"start": 133, "end": 149, "label": "NORP", "text": "Four Great Kings"}, {"start": 158, "end": 175, "label": "NORP", "text": "Thirty-three gods"}, {"start": 180, "end": 185, "label": "NORP", "text": "Maras"}, {"start": 194, "end": 201, "label": "NORP", "text": "Brahmas"}], "entities": [[46, 52, "PERSON"], [133, 149, "NORP"], [158, 175, "NORP"], [180, 185, "NORP"], [194, 201, "NORP"]], "meta": {}, "source": null}
{"text": "2 . The brahman householders of Sala heard: \"A monk called Gotama, it seems, a son of the Sakyans who went forth from a Sakyan clan, has been wandering in the Kosalan country with a large Sangha of bhikkhus and has come to Sala. Now a good report of Master Gotama has been spread to this effect: 'That Blessed One is such since he is arahant and Fully Enlightened, perfect in true knowledge and conduct, sublime, knower of worlds, incomparable teacher of men to be tamed, teacher of gods and humans, enlightened, blessed. He describes this world with its gods, its Maras, and its (Brahma) Divinities, this generation with its monks and brahmans, with its kings and its people, which he has himself realized through direct knowledge. He teaches a Dhamma that is good in the beginning, good in the middle and good in the end with (the right) meaning and phrasing, he affirms a holy life that is utterly perfect and pure.' Now it is good to see such arahants.\"", "spans": [{"start": 32, "end": 36, "label": "GPE", "text": "Sala"}, {"start": 59, "end": 65, "label": "PERSON", "text": "Gotama"}, {"start": 90, "end": 97, "label": "NORP", "text": "Sakyans"}, {"start": 120, "end": 131, "label": "NORP", "text": "Sakyan clan"}, {"start": 159, "end": 174, "label": "GPE", "text": "Kosalan country"}, {"start": 188, "end": 194, "label": "NORP", "text": "Sangha"}, {"start": 223, "end": 227, "label": "GPE", "text": "Sala"}, {"start": 250, "end": 263, "label": "PERSON", "text": "Master Gotama"}, {"start": 302, "end": 313, "label": "PERSON", "text": "Blessed One"}], "entities": [[32, 36, "GPE"], [59, 65, "PERSON"], [90, 97, "NORP"], [120, 131, "NORP"], [159, 174, "GPE"], [188, 194, "NORP"], [223, 227, "GPE"], [250, 263, "PERSON"], [302, 313, "PERSON"]], "meta": {}, "source": null}
{"text": "As they were sitting there, the brahman householders of Sala said to the Blessed One, \"What is the reason, Master Gotama, what is the condition, whereby some beings here, with the break-up of the body, after death, reappear in the plane of deprivation, the bad destination, the lower realms, in hell? And what is the reason, what is the condition, whereby some beings here, with the break-up of the body, after death, reappear in the good destinations, in the heavenly world?\"", "spans": [{"start": 73, "end": 84, "label": "PERSON", "text": "Blessed One"}, {"start": 114, "end": 120, "label": "PERSON", "text": "Gotama"}], "entities": [[73, 84, "PERSON"], [114, 120, "PERSON"]], "meta": {}, "source": null}
{"text": "39. \" In a universal monarch, bhikkhus, are to be found four rare and superlative qualities. What are those four? If, bhikkhus, a company of nobles should go to see the universal monarch, they become joyful on seeing him; and if he then speaks, they are made joyful by his talk; and when he becomes silent, they are disappointed. So it is also when a company of brahmans, of householders, or of ascetics goes to see a universal monarch.", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "\"This calls for a talk, householder. Let's go see the Blessed One. Let's approach him and, on arrival, tell him this matter. However he explains it to us, we will bear it in mind.\"", "spans": [{"start": 54, "end": 65, "label": "PERSON", "text": "Blessed One"}], "entities": [[54, 65, "PERSON"]], "meta": {}, "source": null}
{"text": ". Thus have I heard. On one occasion the Blessed One was living at Savatthi in Jeta's Grove, Anathapindika 's Park. There the Venerable Sariputta addressed the bhikkhus thus: \"Friends, bhikkhus.\" — \"Friend,\" they replied. The Venerable Sariputta said this:", "spans": [{"start": 41, "end": 52, "label": "PERSON", "text": "Blessed One"}, {"start": 67, "end": 75, "label": "GPE", "text": "Savatthi"}, {"start": 79, "end": 91, "label": "LOC", "text": "Jeta's Grove"}, {"start": 93, "end": 114, "label": "LOC", "text": "Anathapindika 's Park"}, {"start": 126, "end": 145, "label": "PERSON", "text": "Venerable Sariputta"}, {"start": 226, "end": 245, "label": "PERSON", "text": "Venerable Sariputta"}], "entities": [[41, 52, "PERSON"], [67, 75, "GPE"], [79, 91, "LOC"], [93, 114, "LOC"], [126, 145, "PERSON"], [226, 245, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying at Nalanda in Pavarika 's mango grove. Then Kevatta the householder approached the Blessed One and, on arrival, having bowed down, sat to one side. As he was sitting there he said to the Blessed One: \"Lord, this Nalanda is powerful, both prosperous and populous, filled with people who have faith in the Blessed One. It would be good if the Blessed One were to direct a monk to display a miracle of psychic power from his superior human state so that Nalanda would to an even greater extent have faith in the Blessed One.\"", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 65, "end": 72, "label": "GPE", "text": "Nalanda"}, {"start": 106, "end": 113, "label": "PERSON", "text": "Kevatta"}, {"start": 145, "end": 156, "label": "PERSON", "text": "Blessed One"}, {"start": 249, "end": 260, "label": "PERSON", "text": "Blessed One"}, {"start": 274, "end": 281, "label": "GPE", "text": "Nalanda"}, {"start": 366, "end": 377, "label": "PERSON", "text": "Blessed One"}, {"start": 403, "end": 414, "label": "PERSON", "text": "Blessed One"}, {"start": 513, "end": 520, "label": "GPE", "text": "Nalanda"}, {"start": 571, "end": 582, "label": "PERSON", "text": "Blessed One"}], "entities": [[38, 49, "PERSON"], [65, 72, "GPE"], [106, 113, "PERSON"], [145, 156, "PERSON"], [249, 260, "PERSON"], [274, 281, "GPE"], [366, 377, "PERSON"], [403, 414, "PERSON"], [513, 520, "GPE"], [571, 582, "PERSON"]], "meta": {}, "source": null}
{"text": "\"But, monks, if one who is of poor conduct, an evil-minded one, a filthy doer of complete wickedness, an impure-natured one, were to derive enjoyment from the homage of rich kshatriyas, or rich brahmans, or rich householders — for him, monks, there would be a long period of harm and suffering, and on the break-up of the body after death he would be reborn into a place of woe, a realm of misery, a place of suffering, a purgatory.\"", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying among the Udaññans, in the Deer Park at Kannakatthala. And at that time King Pasenadi Kosala had arrived at Udañña on some business or other.", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 72, "end": 80, "label": "NORP", "text": "Udaññans"}, {"start": 89, "end": 98, "label": "LOC", "text": "Deer Park"}, {"start": 102, "end": 115, "label": "GPE", "text": "Kannakatthala"}, {"start": 134, "end": 154, "label": "PERSON", "text": "King Pasenadi Kosala"}, {"start": 170, "end": 176, "label": "GPE", "text": "Udañña"}], "entities": [[38, 49, "PERSON"], [72, 80, "NORP"], [89, 98, "LOC"], [102, 115, "GPE"], [134, 154, "PERSON"], [170, 176, "GPE"]], "meta": {}, "source": null}
{"text": "[ At Veluvana So.na the householder's son approached the Blessed One. The Buddha said: ] \"Whatever recluses and Brahmans, So.na, hold views about the body, which is impermanent, unsatisfactory and subject to change, such as 'I am better [than you],' 'I am equal [to you],' or 'I am worse [than you]' [ likewise 'feeling,' 'perception,' 'mental formations,' 'consciousness'], what else are they but folk who do not see things as they really are?", "spans": [{"start": 2, "end": 4, "label": "LOC", "text": "At"}, {"start": 5, "end": 13, "label": "LOC", "text": "Veluvana"}, {"start": 57, "end": 68, "label": "PERSON", "text": "Blessed One"}, {"start": 112, "end": 120, "label": "NORP", "text": "Brahmans"}], "entities": [[2, 4, "LOC"], [5, 13, "LOC"], [57, 68, "PERSON"], [112, 120, "NORP"]], "meta": {}, "source": null}
{"text": "\"Once, householder, there was a brahman named Velāma. And this was the nature of the gift, the great gift, he gave: He gave 84,000 gold trays filled with silver, 84,000 silver trays filled with gold, 84,000 copper trays filled with gems. He gave 84,000 elephants with gold ornaments, gold banners, covered with nets of gold thread. He gave 84,000 chariots spread with lion skins, tiger skins, leopard skins, saffron-colored blankets, with gold ornaments, gold banners, covered with nets of gold thread. He gave 84,000 milk cows with tethers of fine jute and copper milk pails. He gave 84,000 maidens adorned with jeweled earrings. He gave 84,000 couches spread with long-fleeced coverlets, white wool coverlets, embroidered coverlets, rugs of kadali-deer hide, each with a canopy above & red cushions on either side. He gave 84,000 lengths of cloth — of finest linen, of finest cotton, of finest silk. [2] To say nothing of the food & drink, staple & non-staple food, lotions & beddings: They flowed, as it were, like rivers.", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "When this was said, Ven. Ananda said to the Blessed One, \"Lord, may the Blessed One not be totally unbound in this little town, this dusty town, this branch township. There are other great cities: Campa , Rajagaha , Savatthi , Saketa , Kosambi , Vanarasi . May the Blessed One be totally unbound there. In those cities there are many wealthy noble warriors, brahmans, & householders who have high confidence in the Tathagata. They will conduct the Tathagata's funeral.\"", "spans": [{"start": 25, "end": 31, "label": "PERSON", "text": "Ananda"}, {"start": 44, "end": 55, "label": "PERSON", "text": "Blessed One"}, {"start": 72, "end": 83, "label": "PERSON", "text": "Blessed One"}, {"start": 205, "end": 213, "label": "GPE", "text": "Rajagaha"}, {"start": 216, "end": 224, "label": "GPE", "text": "Savatthi"}, {"start": 227, "end": 233, "label": "GPE", "text": "Saketa"}, {"start": 236, "end": 243, "label": "GPE", "text": "Kosambi"}, {"start": 265, "end": 276, "label": "PERSON", "text": "Blessed One"}, {"start": 415, "end": 424, "label": "PERSON", "text": "Tathagata"}, {"start": 448, "end": 459, "label": "PERSON", "text": "Tathagata's"}], "entities": [[25, 31, "PERSON"], [44, 55, "PERSON"], [72, 83, "PERSON"], [205, 213, "GPE"], [216, 224, "GPE"], [227, 233, "GPE"], [236, 243, "GPE"], [265, 276, "PERSON"], [415, 424, "PERSON"], [448, 459, "PERSON"]], "meta": {}, "source": null}
{"text": "\"Yes, sir,\" the brahmans responded to the Blessed One, and the Blessed One said, \" Suppose that there were four men standing at the four directions, endowed with supreme speed & stride. Like that of a strong archer — well-trained, a practiced hand, a practiced sharp-shooter — shooting a light arrow across the shadow of a palm tree: Such would be the speed with which they were endowed. As far as the east sea is from the west: Such would be the stride with which they were endowed. Then the man standing at the eastern direction would say, 'I, by walking, will reach the end of the cosmos.' He — with a one-hundred year life, a one-hundred year span — would spend one hundred years traveling — apart from the time spent on eating, drinking, chewing & tasting, urinating & defecating, and sleeping to fight off weariness — but without reaching the end of the cosmos he would die along the way. [Similarly with the men standing at the western, southern, & northern directions.] Why is that? I tell you, it isn't through that sort of traveling that the end of the cosmos is known, seen, or reached. But at the same time, I tell you that there is no making an end of suffering & stress without reaching the end of the cosmos.", "spans": [{"start": 42, "end": 53, "label": "PERSON", "text": "Blessed One"}, {"start": 63, "end": 74, "label": "PERSON", "text": "Blessed One"}], "entities": [[42, 53, "PERSON"], [63, 74, "PERSON"]], "meta": {}, "source": null}
{"text": "And Ven. Rahula, early in the morning, put on his robes and, carrying his bowl and outer robe, went into Savatthi for alms following right behind the Blessed One. [1] Then the Blessed One, looking back at Rahula, addressed him: \"Rahula, any form whatsoever that is past, future, or present; internal or external; blatant or subtle; common or sublime; far or near: every form is to be seen as it actually is with right discernment as: 'This is not mine. This is not my self. This is not what I am.'\"", "spans": [{"start": 4, "end": 15, "label": "PERSON", "text": "Ven. Rahula"}, {"start": 105, "end": 113, "label": "GPE", "text": "Savatthi"}, {"start": 150, "end": 161, "label": "PERSON", "text": "Blessed One"}, {"start": 176, "end": 187, "label": "PERSON", "text": "Blessed One"}, {"start": 205, "end": 211, "label": "PERSON", "text": "Rahula"}, {"start": 229, "end": 235, "label": "PERSON", "text": "Rahula"}], "entities": [[4, 15, "PERSON"], [105, 113, "GPE"], [150, 161, "PERSON"], [176, 187, "PERSON"], [205, 211, "PERSON"], [229, 235, "PERSON"]], "meta": {}, "source": null}
{"text": "\"Yes, sir,\" the brahmans responded to the Blessed One, and the Blessed One said, \" Suppose that there were four men standing at the four directions, endowed with supreme speed & stride.", "spans": [{"start": 42, "end": 53, "label": "PERSON", "text": "Blessed One"}, {"start": 63, "end": 74, "label": "PERSON", "text": "Blessed One"}], "entities": [[42, 53, "PERSON"], [63, 74, "PERSON"]], "meta": {}, "source": null}
{"text": "A1 . \"Now, householders, of those contemplatives & brahmans who hold this doctrine, hold this view — 'There is nothing given, nothing offered, nothing sacrificed. There is no fruit or result of good or bad actions. There is no this world, no next world, no mother, no father, no spontaneously reborn beings; no brahmans or contemplatives who, faring rightly and practicing rightly, proclaim this world and the next after having directly known and realized it for themselves' — it can be expected that, shunning these three skillful activities — good bodily conduct, good verbal conduct, good mental conduct — they will adopt & practice these three unskillful activities: bad bodily conduct, bad verbal conduct, bad mental conduct. Why is that? Because those venerable contemplatives & brahmans do not see, in unskillful activities, the drawbacks, the degradation, and the defilement; nor in skillful activities the rewards of renunciation, resembling cleansing.", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "As they were sitting there they said to him, \"Lord, a new reception hall has just been built by the Kapilavatthu Sakyans, and it has not yet been dwelled in by any contemplative, brahman, or anyone at all in human form. May the Blessed One be the first to use it. When the Blessed One has used it first, the Kapilavatthu Sakyans will use it afterwards. That will be for their long-term welfare & happiness.\"", "spans": [{"start": 46, "end": 50, "label": "PERSON", "text": "Lord"}, {"start": 100, "end": 112, "label": "GPE", "text": "Kapilavatthu"}, {"start": 113, "end": 120, "label": "NORP", "text": "Sakyans"}, {"start": 228, "end": 239, "label": "PERSON", "text": "Blessed One"}, {"start": 273, "end": 284, "label": "PERSON", "text": "Blessed One"}, {"start": 308, "end": 320, "label": "GPE", "text": "Kapilavatthu"}, {"start": 321, "end": 328, "label": "NORP", "text": "Sakyans"}], "entities": [[46, 50, "PERSON"], [100, 112, "GPE"], [113, 120, "NORP"], [228, 239, "PERSON"], [273, 284, "PERSON"], [308, 320, "GPE"], [321, 328, "NORP"]], "meta": {}, "source": null}
{"text": "When this was said, one of the wanderers said to Vajjiya Mahita the householder, \"Now wait a minute, householder. This contemplative Gotama whom you praise is a nihilist, one who doesn't declare anything.\"", "spans": [{"start": 133, "end": 139, "label": "PERSON", "text": "Gotama"}], "entities": [[133, 139, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was dwelling among the Sakyans at Kapilavatthu in the Great Wood, together with a large Sangha of approximately five hundred bhikkhus, all of them arahants. And most of the devatas from ten world-systems had gathered in order to see the Blessed One and the Bhikkhu Sangha. Then the thought occurred to four devatas of the ranks from the Pure Abodes:", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 73, "end": 80, "label": "NORP", "text": "Sakyans"}, {"start": 84, "end": 96, "label": "GPE", "text": "Kapilavatthu"}, {"start": 104, "end": 114, "label": "LOC", "text": "Great Wood"}, {"start": 138, "end": 144, "label": "NORP", "text": "Sangha"}, {"start": 223, "end": 230, "label": "NORP", "text": "devatas"}, {"start": 236, "end": 253, "label": "LOC", "text": "ten world-systems"}, {"start": 287, "end": 298, "label": "PERSON", "text": "Blessed One"}, {"start": 315, "end": 321, "label": "NORP", "text": "Sangha"}, {"start": 357, "end": 364, "label": "NORP", "text": "devatas"}], "entities": [[38, 49, "PERSON"], [73, 80, "NORP"], [84, 96, "GPE"], [104, 114, "LOC"], [138, 144, "NORP"], [223, 230, "NORP"], [236, 253, "LOC"], [287, 298, "PERSON"], [315, 321, "NORP"], [357, 364, "NORP"]], "meta": {}, "source": null}
{"text": "Once in the past that money-lending householder provided alms for the Private Buddha named Tagarasikhi.", "spans": [{"start": 70, "end": 84, "label": "PERSON", "text": "Private Buddha"}, {"start": 91, "end": 102, "label": "PERSON", "text": "Tagarasikhi"}], "entities": [[70, 84, "PERSON"], [91, 102, "PERSON"]], "meta": {}, "source": null}
{"text": "On one occasion Ven. Uttara was staying in Mahisavatthu [Water Buffalo Ground] on Sankheyyaka Mountain in Dhavajalika . There he addressed the monks:", "spans": [{"start": 16, "end": 27, "label": "PERSON", "text": "Ven. Uttara"}, {"start": 43, "end": 55, "label": "LOC", "text": "Mahisavatthu"}, {"start": 57, "end": 77, "label": "LOC", "text": "Water Buffalo Ground"}, {"start": 82, "end": 102, "label": "LOC", "text": "Sankheyyaka Mountain"}, {"start": 106, "end": 117, "label": "GPE", "text": "Dhavajalika"}], "entities": [[16, 27, "PERSON"], [43, 55, "LOC"], [57, 77, "LOC"], [82, 102, "LOC"], [106, 117, "GPE"]], "meta": {}, "source": null}
{"text": "\"And how is there the undoing of one who leads the holy life? There is the case where a Tathagata arises in the world, worthy and rightly self-awakened, consummate in knowledge & conduct, well-gone, an expert with regard to the world, unexcelled as a trainer for those people fit to be tamed, the Teacher of divine & human beings, awakened, blessed. He resorts to a secluded dwelling: a wilderness, the shade of a tree, a mountain, a glen, a hillside cave, a charnel ground, a forest grove, the open air, a heap of straw. While he is living thus secluded, brahmans & householders from town & countryside visit him. When they visit him, he doesn't get smitten with things that infatuate, doesn't fall into greed, doesn't revert to luxury. A student of that teacher, imitating his teacher's seclusion, resorts to a secluded dwelling: a wilderness, the shade of a tree... a heap of straw. While he is living thus secluded, brahmans & householders from town & countryside visit him. When they visit him, he gets smitten with things that infatuate, falls into greed, and reverts to luxury. This is called one following the holy life who is undone with the undoing of one who leads the holy life. He has been struck down by evil, unskillful qualities that defile, that lead to further becoming, are troublesome, ripen in pain, and lead to future birth, aging, & death. Such is the undoing of one who leads the holy life.", "spans": [{"start": 88, "end": 97, "label": "PERSON", "text": "Tathagata"}], "entities": [[88, 97, "PERSON"]], "meta": {}, "source": null}
{"text": "The brahman householders of Sala heard it said: \"Gotama the contemplative — the son of the Sakyans, having gone forth from the Sakyan clan — on a wandering tour among the Kosalans with a large community of monks — has arrived at Sala. And of that Master Gotama this fine reputation has spread: 'He is indeed a Blessed One, worthy, & rightly self-awakened, consummate in knowledge & conduct, well-gone, a knower of the cosmos, an unexcelled trainer of those persons ready to be tamed, teacher of human & divine beings, awakened, blessed. He has made known — having realized it through direct knowledge — this world with its devas, maras, & brahmas, its generations with their contemplatives & brahmans, their rulers & common people; has explained the Dhamma admirable in the beginning, admirable in the middle, admirable in the end; has expounded the holy life both in its particulars & in its essence, entirely perfect & pure. It is good to see such a worthy one.'\"", "spans": [{"start": 49, "end": 55, "label": "PERSON", "text": "Gotama"}, {"start": 91, "end": 98, "label": "NORP", "text": "Sakyans"}, {"start": 254, "end": 260, "label": "PERSON", "text": "Gotama"}, {"start": 310, "end": 321, "label": "PERSON", "text": "Blessed One"}], "entities": [[49, 55, "PERSON"], [91, 98, "NORP"], [254, 260, "PERSON"], [310, 321, "PERSON"]], "meta": {}, "source": null}
{"text": "\"That was because garden devas, forest devas, tree devas, and devas inhabiting herbs, grasses, & forest giants have assembled and said to me: 'Make a wish, householder: \"In the future, may I become a king, a wheel-turning monarch!\"' And I said to them: 'Even that is inconstant; even that is impermanent; one must abandon even that when one passes on.'\"", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "[1] \"What do you think, monks? Which would in fact be the better? Embracing that great mass of fire, burning, blazing, glowing, and sitting or lying down close to it? Or, embracing a kshatriya or brahman or householder woman with young and tender hands and feet, and sitting or lying down close to her?\" — \"This, venerable Sir, would surely be the better: Embracing a kshatriya or brahman or householder woman with young and tender hands and feet, and sitting or lying down close to her. For it would be painful, venerable Sir, to embrace that great, burning, blazing, glowing mass of fire, and sit or lie down close to it.\"", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "When this was said, Ven. Mahā Kaccāyana said to Soṇa Koṭikaṇṇa, \"It's hard, Soṇa, the life-long, one-meal-a-day, sleeping-alone holy life. Please, right there as you are a householder, devote yourself to the message of the Awakened Ones and to the proper-time [i.e., uposatha day], one-meal-a-day, sleeping-alone holy life.\" And so Soṇa Koṭikaṇṇa's idea of going-forth subsided.", "spans": [{"start": 223, "end": 236, "label": "PERSON", "text": "Awakened Ones"}], "entities": [[223, 236, "PERSON"]], "meta": {}, "source": null}
{"text": "\"I ask Gotama [1] of extensive wisdom this: How acting is a disciple virtuous — both the disciple who has gone from home to the homeless state and the followers who are householders? For you clearly understand the behavior [2] of the world with the devas and the final release. There is none equal to you who are skilled in seeing what is profound. You are an illustrious Awakened One (Buddha). Having investigated all knowledge and being compassionate towards beings you have announced the Dhamma, a revealer of what is hidden, of comprehensive vision, stainless, you illuminate all the worlds.", "spans": [{"start": 7, "end": 13, "label": "PERSON", "text": "Gotama"}, {"start": 372, "end": 384, "label": "PERSON", "text": "Awakened One"}, {"start": 386, "end": 392, "label": "PERSON", "text": "Buddha"}], "entities": [[7, 13, "PERSON"], [372, 384, "PERSON"], [386, 392, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion Ven. Ananda was staying in Kosambi at Ghosita 's monastery. Then a certain householder, a disciple of the Fatalists (Ajivakas), went to him and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to Ven. Ananda, \"Among us, sir, whose Dhamma is well-taught? Who has practiced well in this world? Who in the world is well-gone?\"", "spans": [{"start": 39, "end": 45, "label": "PERSON", "text": "Ananda"}, {"start": 61, "end": 68, "label": "GPE", "text": "Kosambi"}, {"start": 72, "end": 92, "label": "LOC", "text": "Ghosita 's monastery"}, {"start": 151, "end": 159, "label": "NORP", "text": "Ajivakas"}, {"start": 274, "end": 280, "label": "PERSON", "text": "Ananda"}], "entities": [[39, 45, "PERSON"], [61, 68, "GPE"], [72, 92, "LOC"], [151, 159, "NORP"], [274, 280, "PERSON"]], "meta": {}, "source": null}
{"text": "Having gone for alms in Kapilavatthu, after the meal, returning from his alms round, he went to the dwelling of Kala-khemaka the Sakyan for the day's abiding. Now at that time many resting places had been prepared in Kala-khemaka the Sakyan's dwelling. The Blessed One saw the many resting places prepared there and, on seeing them, the thought occurred to him, \"There are many resting places prepared here. Do many monks live here?\"", "spans": [{"start": 24, "end": 36, "label": "GPE", "text": "Kapilavatthu"}, {"start": 112, "end": 124, "label": "PERSON", "text": "Kala-khemaka"}, {"start": 129, "end": 135, "label": "NORP", "text": "Sakyan"}, {"start": 217, "end": 229, "label": "PERSON", "text": "Kala-khemaka"}, {"start": 234, "end": 242, "label": "NORP", "text": "Sakyan's"}, {"start": 257, "end": 268, "label": "PERSON", "text": "Blessed One"}], "entities": [[24, 36, "GPE"], [112, 124, "PERSON"], [129, 135, "NORP"], [217, 229, "PERSON"], [234, 242, "NORP"], [257, 268, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying near Rājagaha on Vulture Peak mountain, not long after Devadatta had left. Referring to Devadatta , the Blessed One addressed the monks:", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 67, "end": 75, "label": "GPE", "text": "Rājagaha"}, {"start": 79, "end": 100, "label": "LOC", "text": "Vulture Peak mountain"}, {"start": 117, "end": 126, "label": "PERSON", "text": "Devadatta"}, {"start": 150, "end": 159, "label": "PERSON", "text": "Devadatta"}, {"start": 166, "end": 177, "label": "PERSON", "text": "Blessed One"}], "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [79, 100, "LOC"], [117, 126, "PERSON"], [150, 159, "PERSON"], [166, 177, "PERSON"]], "meta": {}, "source": null}
{"text": ". Thus have I heard. On one occasion the Blessed One was living at Vesali in the grove outside the city to the west.", "spans": [{"start": 41, "end": 52, "label": "PERSON", "text": "Blessed One"}, {"start": 67, "end": 73, "label": "GPE", "text": "Vesali"}], "entities": [[41, 52, "PERSON"], [67, 73, "GPE"]], "meta": {}, "source": null}
{"text": "This was said by the Blessed One, said by the Arahant, so I have heard: \"Monks, brahmans & householders are very helpful to you, as they provide you with the requisites of robes, alms food, lodgings, & medical requisites for the sick. And you, monks, are very helpful to brahmans & householders, as you teach them the Dhamma admirable in the beginning, admirable in the middle, admirable in the end; as you expound the holy life both in letter & meaning, entirely complete, surpassingly pure. In this way the holy life is lived in mutual dependence, for the purpose of crossing over the flood, for making a right end to stress.\"", "spans": [{"start": 21, "end": 32, "label": "PERSON", "text": "Blessed One"}], "entities": [[21, 32, "PERSON"]], "meta": {}, "source": null}
{"text": "Then Dasama the householder from Atthakanagara, on completing his business at Pataliputta, went to Ven. Ananda at Veluvagamaka near Vesali. On arrival, having bowed down to him, he sat to one side. As he was sitting there, he said to Ven. Ananda: \"Venerable sir, is there a single quality declared by the Blessed One — the one who knows, the one who sees, worthy & rightly self-awakened — where the unreleased mind of a monk who dwells there heedful, ardent, & resolute becomes released, or his unended fermentations go to their total ending, or he attains the unexcelled security from the yoke that he had not attained before?\"", "spans": [{"start": 5, "end": 11, "label": "PERSON", "text": "Dasama"}, {"start": 33, "end": 46, "label": "GPE", "text": "Atthakanagara"}, {"start": 78, "end": 89, "label": "GPE", "text": "Pataliputta"}, {"start": 104, "end": 110, "label": "PERSON", "text": "Ananda"}, {"start": 114, "end": 126, "label": "GPE", "text": "Veluvagamaka"}, {"start": 132, "end": 138, "label": "GPE", "text": "Vesali"}, {"start": 239, "end": 245, "label": "PERSON", "text": "Ananda"}, {"start": 305, "end": 316, "label": "PERSON", "text": "Blessed One"}], "entities": [[5, 11, "PERSON"], [33, 46, "GPE"], [78, 89, "GPE"], [104, 110, "PERSON"], [114, 126, "GPE"], [132, 138, "GPE"], [239, 245, "PERSON"], [305, 316, "PERSON"]], "meta": {}, "source": null}
{"text": "\"When this was said, the Blessed One said to me, 'So it is, householder. So it is. The body is afflicted, weak, & encumbered. For who, looking after this body, would claim even a moment of true health, except through sheer foolishness? So you should train yourself: \"Even though I may be afflicted in body, my mind will be unafflicted.\" That is how you should train yourself.' That's how I was sprinkled by the Blessed One with the deathless ambrosia of a Dhamma talk.\"", "spans": [{"start": 25, "end": 36, "label": "PERSON", "text": "Blessed One"}, {"start": 411, "end": 422, "label": "PERSON", "text": "Blessed One"}], "entities": [[25, 36, "PERSON"], [411, 422, "PERSON"]], "meta": {}, "source": null}
{"text": "\"As for those aversion-born fevers — burned with which the householder or householder's son would sleep miserably — that aversion has been abandoned by the Tathagata, its root destroyed, made like a palmyra stump, deprived of the conditions of development, not destined for future arising. Therefore he sleeps in ease.", "spans": [{"start": 156, "end": 165, "label": "PERSON", "text": "Tathagata"}], "entities": [[156, 165, "PERSON"]], "meta": {}, "source": null}
{"text": "Now, during the following Rains Retreat, Ven. Anuruddha stayed right there in the Eastern Bamboo Park among the Cetis. Dwelling alone, secluded, heedful, ardent, & resolute, he in no long time reached & remained in the supreme goal of the holy life for which clansmen rightly go forth from home into homelessness, knowing & realizing it for himself in the here & now. He knew: \"Birth is ended, the holy life fulfilled, the task done. There is nothing further for the sake of this world.\" And thus Ven. Anuruddha became another one of the arahants. Then, on attaining arahantship, he uttered this verse:", "spans": [{"start": 90, "end": 101, "label": "LOC", "text": "Bamboo Park"}, {"start": 112, "end": 117, "label": "NORP", "text": "Cetis"}], "entities": [[90, 101, "LOC"], [112, 117, "NORP"]], "meta": {}, "source": null}
{"text": "When this was said, Ven. Ananda said to the Blessed One, \"Lord, that must have been Anathapindika the deva's son. Anathapindika the householder had supreme confidence in Ven. Sariputta.\"", "spans": [{"start": 25, "end": 31, "label": "PERSON", "text": "Ananda"}, {"start": 44, "end": 55, "label": "PERSON", "text": "Blessed One"}, {"start": 84, "end": 97, "label": "PERSON", "text": "Anathapindika"}, {"start": 114, "end": 127, "label": "PERSON", "text": "Anathapindika"}, {"start": 175, "end": 184, "label": "PERSON", "text": "Sariputta"}], "entities": [[25, 31, "PERSON"], [44, 55, "PERSON"], [84, 97, "PERSON"], [114, 127, "PERSON"], [175, 184, "PERSON"]], "meta": {}, "source": null}
{"text": "\"Monks, speaking rightly of Nanda, one could say, 'He is a son of a good family.' Speaking rightly of Nanda, one could say, 'He is strong.'", "spans": [{"start": 28, "end": 33, "label": "PERSON", "text": "Nanda"}, {"start": 102, "end": 107, "label": "PERSON", "text": "Nanda"}], "entities": [[28, 33, "PERSON"], [102, 107, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying at Varanasi in the Game Refuge at Isipatana.", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 65, "end": 73, "label": "GPE", "text": "Varanasi"}, {"start": 81, "end": 92, "label": "LOC", "text": "Game Refuge"}, {"start": 96, "end": 105, "label": "GPE", "text": "Isipatana"}], "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [81, 92, "LOC"], [96, 105, "GPE"]], "meta": {}, "source": null}
{"text": "Thus I heard. On one occasion the venerable Nandaka was living at Savatthi in the Eastern Monastery, Migara 's Mother's Palace. Then Migara 's grandson, Salha , and Pekhuniya 's grandson, Rohana , went to the venerable Nandaka, and after salutation they sat down at one side. When they had done so the venerable Nandaka said to Migara's grandson Salha:", "spans": [{"start": 66, "end": 74, "label": "GPE", "text": "Savatthi"}, {"start": 82, "end": 99, "label": "LOC", "text": "Eastern Monastery"}], "entities": [[66, 74, "GPE"], [82, 99, "LOC"]], "meta": {}, "source": null}
{"text": "So the Blessed One, putting on his robe and taking up his bowl & outer robe, went together with a community of monks to the reception hall. On arrival he washed his feet, entered the hall, and sat with his back to the central post, facing east. The community of monks washed their feet, entered the hall, and sat with their backs to the western wall, facing east, ranged around the Blessed One. The Kapilavatthu Sakyans washed their feet, entered the hall, and sat with their backs to the eastern wall, facing west, ranged around the Blessed One. Then the Blessed One — having spent most of the night instructing, urging, rousing, & encouraging the Kapilavatthu Sakyans with a Dhamma talk — dismissed them, saying, \"The night is far past, Gotamas. Do what you now think it is time to do.\"", "spans": [{"start": 7, "end": 18, "label": "PERSON", "text": "Blessed One"}, {"start": 382, "end": 393, "label": "PERSON", "text": "Blessed One"}, {"start": 412, "end": 419, "label": "NORP", "text": "Sakyans"}, {"start": 534, "end": 545, "label": "PERSON", "text": "Blessed One"}, {"start": 556, "end": 567, "label": "PERSON", "text": "Blessed One"}, {"start": 662, "end": 669, "label": "NORP", "text": "Sakyans"}], "entities": [[7, 18, "PERSON"], [382, 393, "PERSON"], [412, 419, "NORP"], [534, 545, "PERSON"], [556, 567, "PERSON"], [662, 669, "NORP"]], "meta": {}, "source": null}
{"text": "Now on that occasion this pernicious viewpoint (diṭṭhigata) had arisen in the monk Sāti the Fisherman's Son: \"As I understand the Dhamma taught by the Blessed One, it is just this consciousness that runs and wanders on [from birth to birth], not another.", "spans": [{"start": 83, "end": 107, "label": "PERSON", "text": "Sāti the Fisherman's Son"}, {"start": 151, "end": 162, "label": "PERSON", "text": "Blessed One"}], "entities": [[83, 107, "PERSON"], [151, 162, "PERSON"]], "meta": {}, "source": null}
{"text": "A second time... A third time, Kevatta the householder said to the Blessed One: \"I won't argue with the Blessed One, but I tell you: Lord, this Nalanda is powerful, both prosperous and populous, filled with people who have faith in the Blessed One. It would be good if the Blessed One were to direct a monk to display a miracle of psychic power from his superior human state so that Nalanda would to an even greater extent have faith in the Blessed One.\"", "spans": [{"start": 31, "end": 38, "label": "PERSON", "text": "Kevatta"}, {"start": 67, "end": 78, "label": "PERSON", "text": "Blessed One"}, {"start": 104, "end": 115, "label": "PERSON", "text": "Blessed One"}, {"start": 144, "end": 151, "label": "GPE", "text": "Nalanda"}, {"start": 236, "end": 247, "label": "PERSON", "text": "Blessed One"}, {"start": 273, "end": 284, "label": "PERSON", "text": "Blessed One"}, {"start": 383, "end": 390, "label": "GPE", "text": "Nalanda"}, {"start": 441, "end": 452, "label": "PERSON", "text": "Blessed One"}], "entities": [[31, 38, "PERSON"], [67, 78, "PERSON"], [104, 115, "PERSON"], [144, 151, "GPE"], [236, 247, "PERSON"], [273, 284, "PERSON"], [383, 390, "GPE"], [441, 452, "PERSON"]], "meta": {}, "source": null}
{"text": "\"Now it may be that you are thinking, 'Nakula's mother will not act fully in accordance with the precepts after I'm gone,' but you shouldn't see things in that way. To the extent that the Blessed One has white-clad householder female disciples who act fully in accordance with the precepts, I am one of them. If anyone doubts or denies this, let him go ask the Blessed One, the worthy one, the rightly self-awakened one who is staying among the Bhaggas in the Deer Park at Bhesakala Grove, near Crocodile Haunt. So don't be worried as you die, householder. Death is painful for one who is worried. The Blessed One has criticized being worried at the time of death.", "spans": [{"start": 188, "end": 199, "label": "PERSON", "text": "Blessed One"}, {"start": 361, "end": 372, "label": "PERSON", "text": "Blessed One"}, {"start": 445, "end": 452, "label": "NORP", "text": "Bhaggas"}, {"start": 460, "end": 469, "label": "LOC", "text": "Deer Park"}, {"start": 473, "end": 488, "label": "LOC", "text": "Bhesakala Grove"}, {"start": 495, "end": 510, "label": "LOC", "text": "Crocodile Haunt"}, {"start": 602, "end": 613, "label": "PERSON", "text": "Blessed One"}], "entities": [[188, 199, "PERSON"], [361, 372, "PERSON"], [445, 452, "NORP"], [460, 469, "LOC"], [473, 488, "LOC"], [495, 510, "LOC"], [602, 613, "PERSON"]], "meta": {}, "source": null}
{"text": "[5] \"What do you think, monks? Which would in fact be the better? If a strong man, having opened the mouth with a red-hot iron spike, were to hurl into the mouth a red-hot iron ball, burning, blazing, glowing, so that one's lips would burn, then the mouth would burn, then the tongue would burn, then the throat would burn, then the chest would burn, and when it was received by the lower intestine, it would be expelled from the lower part of the body? Or, to derive enjoyment from the food received on alms-round and given in faith by rich kshatriyas, brahmans, or householders?\"", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "A second time... A third time, Ratthapala said to his parents, \"Mom, Dad, as I understand the Dhamma taught by the Blessed One, it's not easy, living at home, to practice the holy life totally perfect, totally pure, a polished shell. I want — having shaved off my hair & beard and putting on the ochre robe — to go forth from the household life into homelessness. Please give me your permission to go forth from the household life into homelessness.\"", "spans": [{"start": 31, "end": 41, "label": "PERSON", "text": "Ratthapala"}, {"start": 115, "end": 126, "label": "PERSON", "text": "Blessed One"}], "entities": [[31, 41, "PERSON"], [115, 126, "PERSON"]], "meta": {}, "source": null}
{"text": ". Thus have I heard. Once the Blessed One was staying at Savatthi , in Jeta's Grove, Anathapindika 's monastery. There he addressed the monks thus: \"Monks.\" — \"Venerable sir,\" they replied. The Blessed One said this:", "spans": [{"start": 30, "end": 41, "label": "PERSON", "text": "Blessed One"}, {"start": 57, "end": 65, "label": "GPE", "text": "Savatthi"}, {"start": 71, "end": 83, "label": "LOC", "text": "Jeta's Grove"}, {"start": 85, "end": 111, "label": "LOC", "text": "Anathapindika 's monastery"}, {"start": 194, "end": 205, "label": "PERSON", "text": "Blessed One"}], "entities": [[30, 41, "PERSON"], [57, 65, "GPE"], [71, 83, "LOC"], [85, 111, "LOC"], [194, 205, "PERSON"]], "meta": {}, "source": null}
{"text": "\"As for those passion-born fevers — burned with which the householder or householder's son would sleep miserably — that passion has been abandoned by the Tathagata, its root destroyed, made like a palmyra stump, deprived of the conditions of development, not destined for future arising. Therefore he sleeps in ease.", "spans": [{"start": 154, "end": 163, "label": "PERSON", "text": "Tathagata"}], "entities": [[154, 163, "PERSON"]], "meta": {}, "source": null}
{"text": "\"As, Aggivessana, an elephant tamer, driving a great post into the ground, ties a forest elephant to it by his neck so as to subdue his forest ways", "spans": [{"start": 5, "end": 16, "label": "PERSON", "text": "Aggivessana"}], "entities": [[5, 16, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying near Rajagaha , at the Bamboo Grove, the Squirrels' Feeding Ground.", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 67, "end": 75, "label": "GPE", "text": "Rajagaha"}, {"start": 85, "end": 97, "label": "LOC", "text": "Bamboo Grove"}, {"start": 103, "end": 128, "label": "LOC", "text": "Squirrels' Feeding Ground"}], "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [85, 97, "LOC"], [103, 128, "LOC"]], "meta": {}, "source": null}
{"text": "And the brahman Akkosa Bharadvaja received at the hands of the Blessed One the initial monastic ordination and he also received the higher ordination of a bhikkhu. And within a short time of his ordination, the Venerable Akkosa Bharadvaja, living alone, secluded, diligent, zealous and unrelenting, reached that incomparable consummation of holiness for which sons of noble families, having totally abandoned the household life, take to the life of homelessness. With direct knowledge he realized the ultimate, then and there, and lived having access to it. He saw with his supernormal vision: \"Ceased is rebirth, lived is the holy life, completed is the spiritual task and henceforth there is nothing higher to be achieved.\"", "spans": [{"start": 16, "end": 33, "label": "PERSON", "text": "Akkosa Bharadvaja"}, {"start": 63, "end": 74, "label": "PERSON", "text": "Blessed One"}, {"start": 211, "end": 238, "label": "PERSON", "text": "Venerable Akkosa Bharadvaja"}], "entities": [[16, 33, "PERSON"], [63, 74, "PERSON"], [211, 238, "PERSON"]], "meta": {}, "source": null}
{"text": "\"And what kind of purification rites have they declared, those brahmans of the Western lands who carry water pots, wear garlands of water plants, worship fire, & purify with water?\"", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "And the brahman Akkosa Bharadvaja received at the hands of the Blessed One the initial monastic ordination and he also received the higher ordination of a bhikkhu. And within a short time of his ordination, the Venerable Akkosa Bharadvaja, living alone, secluded, diligent, zealous and unrelenting, reached that incomparable consummation of holiness for which sons of noble families, having totally abandoned the household life, take to the life of homelessness. With direct knowledge he realized the ultimate, then and there, and lived having access to it. He saw with his supernormal vision: \"Ceased is rebirth, lived is the holy life, completed is the spiritual task and henceforth there is nothing higher to be achieved.\"", "spans": [{"start": 23, "end": 33, "label": "PERSON", "text": "Bharadvaja"}, {"start": 63, "end": 74, "label": "PERSON", "text": "Blessed One"}, {"start": 211, "end": 238, "label": "PERSON", "text": "Venerable Akkosa Bharadvaja"}], "entities": [[23, 33, "PERSON"], [63, 74, "PERSON"], [211, 238, "PERSON"]], "meta": {}, "source": null}
{"text": "At Savatthi. As he was sitting to one side, King Pasenadi Kosala said to the Blessed One: \"Just now, lord, as I was sitting in judgment, I saw that even affluent nobles, affluent brahmans, & affluent householders — rich, with great wealth & property, with vast amounts of gold & silver, vast amounts of valuables & commodities, vast amounts of wealth & grain — tell deliberate lies with sensual pleasures as the cause, sensual pleasures as the reason, simply for the sake of sensual pleasures. Then, the thought occured to me: 'I've had enough of this judging! Let some other fine fellow be known for his judgments!'\"", "spans": [{"start": 3, "end": 11, "label": "GPE", "text": "Savatthi"}, {"start": 44, "end": 64, "label": "PERSON", "text": "King Pasenadi Kosala"}, {"start": 77, "end": 88, "label": "PERSON", "text": "Blessed One"}], "entities": [[3, 11, "GPE"], [44, 64, "PERSON"], [77, 88, "PERSON"]], "meta": {}, "source": null}
{"text": "Thus have I heard: At one time the Exalted One was staying near Savatthi at the Eastern monastery in the mansion (given by) Migara's mother.", "spans": [{"start": 35, "end": 46, "label": "PERSON", "text": "Exalted One"}, {"start": 64, "end": 72, "label": "GPE", "text": "Savatthi"}, {"start": 80, "end": 97, "label": "LOC", "text": "Eastern monastery"}, {"start": 124, "end": 139, "label": "PERSON", "text": "Migara's mother"}], "entities": [[35, 46, "PERSON"], [64, 72, "GPE"], [80, 97, "LOC"], [124, 139, "PERSON"]], "meta": {}, "source": null}
{"text": "Now it may be that you are thinking, 'Nakula's mother will have no desire to go see the Blessed One, to go see the community of monks, after I'm gone.'", "spans": [{"start": 38, "end": 53, "label": "PERSON", "text": "Nakula's mother"}, {"start": 88, "end": 99, "label": "PERSON", "text": "Blessed One"}], "entities": [[38, 53, "PERSON"], [88, 99, "PERSON"]], "meta": {}, "source": null}
{"text": "Endowed with this faith that he has acquired, he reflects in this way: ' The household life is confined and dusty , going forth is in the open; it is not easy for one who lives in a house to fare the Brahma-faring wholly fulfilled, wholly pure, polished like a conch-shell. Suppose now that I, having cut off hair and beard, having put on saffron robes, should go forth from home into homelessness?' After a time, getting rid of his wealth, be it small or great, getting rid of his circle of relations, be it small or great, having cut off his hair and beard, having put on saffron robes, he goes forth from home into homelessness. To this extent, Aggivessana, the ariyan disciple gets out into the open.", "spans": [{"start": 200, "end": 206, "label": "PERSON", "text": "Brahma"}, {"start": 648, "end": 659, "label": "PERSON", "text": "Aggivessana"}], "entities": [[200, 206, "PERSON"], [648, 659, "PERSON"]], "meta": {}, "source": null}
{"text": "[Ven. Sariputta:] \"Then, householder, you should train yourself in this way: 'I won't cling to the eye; my consciousness will not be dependent on the eye.' That's how you should train yourself. 'I won't cling to the ear... nose... tongue... body; my consciousness will not be dependent on the body.' ... 'I won't cling to the intellect; my consciousness will not be dependent on the intellect.' That's how you should train yourself.", "spans": [{"start": 6, "end": 15, "label": "PERSON", "text": "Sariputta"}], "entities": [[6, 15, "PERSON"]], "meta": {}, "source": null}
{"text": "The brahman householders of Icchanangala heard it said, \"Gotama the contemplative — the son of the Sakyans, having gone forth from the Sakyan clan — on a wandering tour among the Kosalans with a large community of monks — has arrived at Icchanangala and is staying in the Icchanangala forest grove. And of that Master Gotama this fine reputation has spread: 'He is indeed a Blessed One, worthy, & rightly self-awakened, consummate in knowledge & conduct, well-gone, a knower of the cosmos, an unexcelled trainer of those persons ready to be tamed, teacher of human & divine beings, awakened, blessed. He has made known — having realized it through direct knowledge — this world with its devas, maras, & brahmas, its generations with their contemplatives & brahmans, their rulers & common people; has explained the Dhamma admirable in the beginning, admirable in the middle, admirable in the end; has expounded the holy life both in its particulars & in its essence, entirely perfect, surpassingly pure. It is good to see such a worthy one.'\"", "spans": [{"start": 28, "end": 40, "label": "GPE", "text": "Icchanangala"}, {"start": 57, "end": 63, "label": "PERSON", "text": "Gotama"}, {"start": 99, "end": 106, "label": "NORP", "text": "Sakyans"}, {"start": 237, "end": 249, "label": "GPE", "text": "Icchanangala"}, {"start": 272, "end": 284, "label": "GPE", "text": "Icchanangala"}, {"start": 318, "end": 324, "label": "PERSON", "text": "Gotama"}, {"start": 374, "end": 385, "label": "PERSON", "text": "Blessed One"}], "entities": [[28, 40, "GPE"], [57, 63, "PERSON"], [99, 106, "NORP"], [237, 249, "GPE"], [272, 284, "GPE"], [318, 324, "PERSON"], [374, 385, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was living among the Bhaggas at Crocodile Haunt in the Bhesakala Grove at the Deer Park. Then the householder Nakulapita went to the Blessed One and on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the Blessed One, \"Lord, I am a feeble old man, aged, advanced in years, having come to the last stage of life.\"", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 71, "end": 78, "label": "NORP", "text": "Bhaggas"}, {"start": 82, "end": 97, "label": "LOC", "text": "Crocodile Haunt"}, {"start": 105, "end": 120, "label": "LOC", "text": "Bhesakala Grove"}, {"start": 128, "end": 137, "label": "LOC", "text": "Deer Park"}, {"start": 160, "end": 170, "label": "PERSON", "text": "Nakulapita"}, {"start": 183, "end": 194, "label": "PERSON", "text": "Blessed One"}, {"start": 293, "end": 304, "label": "PERSON", "text": "Blessed One"}, {"start": 307, "end": 311, "label": "PERSON", "text": "Lord"}], "entities": [[38, 49, "PERSON"], [71, 78, "NORP"], [82, 97, "LOC"], [105, 120, "LOC"], [128, 137, "LOC"], [160, 170, "PERSON"], [183, 194, "PERSON"], [293, 304, "PERSON"], [307, 311, "PERSON"]], "meta": {}, "source": null}
{"text": "For this King Ajatasattu is a human being, and I, too, am a human being, yet King Ajatasattu enjoys himself supplied and replete with the five strings of sensuality — like a deva, as it were — while I am a farmer, a householder, a taxpayer swelling the royal treasury. I, too, should do meritorious deeds. What if I were to shave off my hair and beard, put on the ochre robes, and go forth from the household life into homelessness?'", "spans": [{"start": 9, "end": 24, "label": "PERSON", "text": "King Ajatasattu"}, {"start": 77, "end": 92, "label": "PERSON", "text": "King Ajatasattu"}], "entities": [[9, 24, "PERSON"], [77, 92, "PERSON"]], "meta": {}, "source": null}
{"text": "Certainly, brahman, the Bamboo Grove is delightful, quiet, free of noise, with an air of isolation, remote from human beings, & appropriate for retreat because of guardians & protectors like yourself.", "spans": [{"start": 24, "end": 36, "label": "LOC", "text": "Bamboo Grove"}], "entities": [[24, 36, "LOC"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery. And on that occasion five hundred brahmans from various provinces were staying at Savatthi on some business or other. The thought occurred to them, \"This Gotama the contemplative prescribes purity for the four castes. Now who is capable of disputing with him on this statement?\" And on that occasion the brahman student Assalayana was staying at Savatthi. Young, shaven-headed, sixteen years old, he was a master of the Three Vedas with their vocabularies, liturgy, phonology, etymology, & histories as a fifth; skilled in philology & grammar, he was fully versed in cosmology and in the marks of a Great Man. The thought occurred to the brahmans, \"This brahman student Assalayana is staying in Savatthi... He is capable of disputing with Gotama the contemplative on this statement.\"", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 67, "end": 75, "label": "GPE", "text": "Savatthi"}, {"start": 79, "end": 91, "label": "LOC", "text": "Jeta's Grove"}, {"start": 93, "end": 118, "label": "LOC", "text": "Anathapindika's monastery"}, {"start": 154, "end": 162, "label": "NORP", "text": "brahmans"}, {"start": 202, "end": 210, "label": "GPE", "text": "Savatthi"}, {"start": 274, "end": 280, "label": "PERSON", "text": "Gotama"}, {"start": 440, "end": 450, "label": "PERSON", "text": "Assalayana"}, {"start": 466, "end": 474, "label": "GPE", "text": "Savatthi"}, {"start": 758, "end": 766, "label": "NORP", "text": "brahmans"}, {"start": 790, "end": 800, "label": "PERSON", "text": "Assalayana"}, {"start": 815, "end": 823, "label": "GPE", "text": "Savatthi"}, {"start": 859, "end": 865, "label": "PERSON", "text": "Gotama"}], "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [79, 91, "LOC"], [93, 118, "LOC"], [154, 162, "NORP"], [202, 210, "GPE"], [274, 280, "PERSON"], [440, 450, "PERSON"], [466, 474, "GPE"], [758, 766, "NORP"], [790, 800, "PERSON"], [815, 823, "GPE"], [859, 865, "PERSON"]], "meta": {}, "source": null}
{"text": "Then Tapussa the householder went to Ven. Ananda and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to Ven. Ananda: \"Venerable Ananda, sir, we are householders who indulge in sensuality, delight in sensuality, enjoy sensuality, rejoice in sensuality. For us — indulging in sensuality, delighting in sensuality, enjoying sensuality, rejoicing in sensuality — renunciation seems like a sheer drop-off. Yet I've heard that in this doctrine & discipline the hearts of the very young monks leap up at renunciation, grow confident, steadfast, & firm, seeing it as peace. So right here is where this doctrine & discipline is contrary to the great mass of people: i.e., [this issue of] renunciation.\"", "spans": [{"start": 42, "end": 48, "label": "PERSON", "text": "Ananda"}, {"start": 149, "end": 155, "label": "PERSON", "text": "Ananda"}, {"start": 158, "end": 174, "label": "PERSON", "text": "Venerable Ananda"}], "entities": [[42, 48, "PERSON"], [149, 155, "PERSON"], [158, 174, "PERSON"]], "meta": {}, "source": null}
{"text": "And at that time King Pasenadi Kosala had arrived at Udañña on some business or other.", "spans": [{"start": 17, "end": 37, "label": "PERSON", "text": "King Pasenadi Kosala"}, {"start": 53, "end": 59, "label": "GPE", "text": "Udañña"}], "entities": [[17, 37, "PERSON"], [53, 59, "GPE"]], "meta": {}, "source": null}
{"text": "\"Wherefore do you, young householder, rising early in the morning, departing from Rajagaha, with wet clothes and wet hair, worship, with joined hands these various quarters — the East, the South, the West, the North, the Nadir, and the Zenith?\"", "spans": [{"start": 82, "end": 90, "label": "GPE", "text": "Rajagaha"}], "entities": [[82, 90, "GPE"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying at Kimila, in the Bamboo Grove. Then Ven. Kimila went to the Blessed One and, on arrival, having bowed down to the Blessed One, sat to one side. As he was sitting there he said to the Blessed One: \"What is the cause, lord, what is the reason why, when a Tathagata has become totally unbound (has entered total Nibbana), the true Dhamma does not last a long time?\"", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 65, "end": 71, "label": "GPE", "text": "Kimila"}, {"start": 80, "end": 92, "label": "LOC", "text": "Bamboo Grove"}, {"start": 99, "end": 110, "label": "PERSON", "text": "Ven. Kimila"}, {"start": 123, "end": 134, "label": "PERSON", "text": "Blessed One"}, {"start": 177, "end": 188, "label": "PERSON", "text": "Blessed One"}, {"start": 246, "end": 257, "label": "PERSON", "text": "Blessed One"}, {"start": 316, "end": 325, "label": "PERSON", "text": "Tathagata"}], "entities": [[38, 49, "PERSON"], [65, 71, "GPE"], [80, 92, "LOC"], [99, 110, "PERSON"], [123, 134, "PERSON"], [177, 188, "PERSON"], [246, 257, "PERSON"], [316, 325, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying at Kosambi, in Ghosita's Park. Now at that time Ven. Udayin was sitting surrounded by a large assembly of householders, teaching the Dhamma. Ven. Ananda saw Ven. Udayin sitting surrounded by a large assembly of householders, teaching the Dhamma, and on seeing him went to the Blessed One. On arrival, he bowed down to the Blessed One and sat to one side. As he was sitting there he said to the Blessed One: \"Ven. Udayin, lord, is sitting surrounded by a large assembly of householders, teaching the Dhamma.\"", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 65, "end": 72, "label": "GPE", "text": "Kosambi"}, {"start": 77, "end": 91, "label": "LOC", "text": "Ghosita's Park"}, {"start": 110, "end": 121, "label": "PERSON", "text": "Ven. Udayin"}, {"start": 203, "end": 214, "label": "PERSON", "text": "Ven. Ananda"}, {"start": 219, "end": 230, "label": "PERSON", "text": "Ven. Udayin"}, {"start": 338, "end": 349, "label": "PERSON", "text": "Blessed One"}, {"start": 384, "end": 395, "label": "PERSON", "text": "Blessed One"}, {"start": 456, "end": 467, "label": "PERSON", "text": "Blessed One"}, {"start": 470, "end": 481, "label": "PERSON", "text": "Ven. Udayin"}], "entities": [[38, 49, "PERSON"], [65, 72, "GPE"], [77, 91, "LOC"], [110, 121, "PERSON"], [203, 214, "PERSON"], [219, 230, "PERSON"], [338, 349, "PERSON"], [384, 395, "PERSON"], [456, 467, "PERSON"], [470, 481, "PERSON"]], "meta": {}, "source": null}
{"text": "Responding, \"As you say, lord,\" to Anathapindika the householder, the man went to the Blessed One and, on arrival, bowed down to him and sat to one side. As he was sitting there he said, \"Lord, Anathapindika the householder is diseased, in pain, severely ill. He pays homage with his head to the Blessed One's feet.\" Then he went to Ven. Sariputta and, on arrival, bowed down to him and sat to one side. As he was sitting there he said, 'Venerable sir, Anathapindika the householder is diseased, in pain, severely ill. He pays homage with his head to Ven. Sariputta's feet.\" Then he said, \"It would be good if Ven. Sariputta would visit Anathapindika's home, out of sympathy for him.\" Ven. Sariputta acquiesced through silence.", "spans": [{"start": 35, "end": 48, "label": "PERSON", "text": "Anathapindika"}, {"start": 86, "end": 97, "label": "PERSON", "text": "Blessed One"}, {"start": 194, "end": 207, "label": "PERSON", "text": "Anathapindika"}, {"start": 296, "end": 309, "label": "PERSON", "text": "Blessed One's"}, {"start": 338, "end": 347, "label": "PERSON", "text": "Sariputta"}, {"start": 453, "end": 466, "label": "PERSON", "text": "Anathapindika"}, {"start": 556, "end": 567, "label": "PERSON", "text": "Sariputta's"}, {"start": 615, "end": 624, "label": "PERSON", "text": "Sariputta"}, {"start": 637, "end": 652, "label": "PERSON", "text": "Anathapindika's"}, {"start": 690, "end": 699, "label": "PERSON", "text": "Sariputta"}], "entities": [[35, 48, "PERSON"], [86, 97, "PERSON"], [194, 207, "PERSON"], [296, 309, "PERSON"], [338, 347, "PERSON"], [453, 466, "PERSON"], [556, 567, "PERSON"], [615, 624, "PERSON"], [637, 652, "PERSON"], [690, 699, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying near Campa, on the shore of Gaggara Lake. Then Vajjiya Mahita the householder left Campa in the middle of the day to see the Blessed One, but the thought then occurred to him, \"Now is not the right time to see the Blessed One, for he is in seclusion. And it is not the right time to see the monks who develop the mind, for they are in seclusion. What if I were to visit the park of the wanderers of other persuasions?\" So he headed to the park of the wanderers of other persuasions.", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 67, "end": 72, "label": "GPE", "text": "Campa"}, {"start": 90, "end": 102, "label": "LOC", "text": "Gaggara Lake"}, {"start": 109, "end": 123, "label": "PERSON", "text": "Vajjiya Mahita"}, {"start": 145, "end": 150, "label": "GPE", "text": "Campa"}, {"start": 187, "end": 198, "label": "PERSON", "text": "Blessed One"}, {"start": 276, "end": 287, "label": "PERSON", "text": "Blessed One"}], "entities": [[38, 49, "PERSON"], [67, 72, "GPE"], [90, 102, "LOC"], [109, 123, "PERSON"], [145, 150, "GPE"], [187, 198, "PERSON"], [276, 287, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying near Rajagaha in the Cool Grove. Now at that time Anathapindika the householder had arrived in Rajagaha on some business. He heard, \"An Awakened One, they say, has appeared in the world,\" and he wanted to go right then to see the Blessed One. Then the thought occurred to him, \"Today is not the proper time to go to see the Blessed One. Tomorrow I will go to see the Blessed One at the proper time.\" With his mindfulness immersed in the Awakened One he lay down to sleep. Three times he got up during the night, thinking it was light. Then he went to the gate to the charnel ground. Non-human beings opened the gate.", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 67, "end": 75, "label": "GPE", "text": "Rajagaha"}, {"start": 112, "end": 125, "label": "PERSON", "text": "Anathapindika"}, {"start": 157, "end": 165, "label": "GPE", "text": "Rajagaha"}, {"start": 198, "end": 210, "label": "PERSON", "text": "Awakened One"}, {"start": 292, "end": 303, "label": "PERSON", "text": "Blessed One"}, {"start": 386, "end": 397, "label": "PERSON", "text": "Blessed One"}, {"start": 429, "end": 440, "label": "PERSON", "text": "Blessed One"}, {"start": 499, "end": 511, "label": "PERSON", "text": "Awakened One"}], "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [112, 125, "PERSON"], [157, 165, "GPE"], [198, 210, "PERSON"], [292, 303, "PERSON"], [386, 397, "PERSON"], [429, 440, "PERSON"], [499, 511, "PERSON"]], "meta": {}, "source": null}
{"text": ". \"Sariputta, there are these eight assemblies . What are the eight? An assembly of nobles, an assembly of brahmans, an assembly of householders, an assembly of recluses, an assembly of gods of the heaven of the Four Great Kings, an assembly of gods of the heaven of the Thirty-three, an assembly of Mara's retinue, an assembly of Brahmas. Possessing these four kinds of intrepidity, the Tathagata approaches and enters these eight assemblies.", "spans": [{"start": 3, "end": 12, "label": "PERSON", "text": "Sariputta"}, {"start": 300, "end": 306, "label": "PERSON", "text": "Mara's"}, {"start": 388, "end": 397, "label": "PERSON", "text": "Tathagata"}], "entities": [[3, 12, "PERSON"], [300, 306, "PERSON"], [388, 397, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying near Rajagaha , on Vulture Peak Mountain. And on that occasion Ven. Sona was staying near Rajagaha in the Cool Wood. Then, as Ven. Sona was meditating in seclusion [after doing walking meditation until the skin of his soles was split & bleeding], this train of thought arose in his awareness: \"Of the Blessed One's disciples who have aroused their persistence, I am one, but my mind is not released from the fermentations through lack of clinging/sustenance. Now, my family has enough wealth that it would be possible to enjoy wealth & make merit. What if I were to disavow the training, return to the lower life, enjoy wealth, & make merit?\"", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 67, "end": 75, "label": "GPE", "text": "Rajagaha"}, {"start": 81, "end": 102, "label": "LOC", "text": "Vulture Peak Mountain"}, {"start": 125, "end": 134, "label": "PERSON", "text": "Ven. Sona"}, {"start": 152, "end": 160, "label": "GPE", "text": "Rajagaha"}, {"start": 168, "end": 177, "label": "LOC", "text": "Cool Wood"}, {"start": 188, "end": 197, "label": "PERSON", "text": "Ven. Sona"}, {"start": 363, "end": 376, "label": "PERSON", "text": "Blessed One's"}], "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [81, 102, "LOC"], [125, 134, "PERSON"], [152, 160, "GPE"], [168, 177, "LOC"], [188, 197, "PERSON"], [363, 376, "PERSON"]], "meta": {}, "source": null}
{"text": "Then the wanderer Vacchagotta went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there he asked the Blessed One: How is it, Master Gotama, does Master Gotama hold the view: The cosmos is eternal: only this is true, anything otherwise is worthless?", "spans": [{"start": 18, "end": 29, "label": "PERSON", "text": "Vacchagotta"}, {"start": 42, "end": 53, "label": "PERSON", "text": "Blessed One"}, {"start": 222, "end": 233, "label": "PERSON", "text": "Blessed One"}, {"start": 246, "end": 259, "label": "PERSON", "text": "Master Gotama"}, {"start": 266, "end": 279, "label": "PERSON", "text": "Master Gotama"}], "entities": [[18, 29, "PERSON"], [42, 53, "PERSON"], [222, 233, "PERSON"], [246, 259, "PERSON"], [266, 279, "PERSON"]], "meta": {}, "source": null}
{"text": "Once, monks, in this same Savatthi , there was a lady of a household named Vedehika.", "spans": [{"start": 26, "end": 34, "label": "GPE", "text": "Savatthi"}, {"start": 75, "end": 83, "label": "PERSON", "text": "Vedehika"}], "entities": [[26, 34, "GPE"], [75, 83, "PERSON"]], "meta": {}, "source": null}
{"text": "\"Last night, monks, a certain devata in the far extreme of the night, her extreme radiance lighting up the entirety of Jeta's Grove, came to me and, on arrival, bowed down to me and stood to one side. As she was standing there, she said to me, 'These seven qualities, lord, lead to a monk's non-decline. Which seven? Respect for the teacher, respect for the Dhamma, respect for the Sangha, respect for training, respect for concentration, compliance, [1] having admirable friends. These seven qualities, lord, lead to a monk's non-decline.'", "spans": [{"start": 30, "end": 36, "label": "NORP", "text": "devata"}, {"start": 119, "end": 131, "label": "LOC", "text": "Jeta's Grove"}, {"start": 382, "end": 388, "label": "NORP", "text": "Sangha"}], "entities": [[30, 36, "NORP"], [119, 131, "LOC"], [382, 388, "NORP"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying near Sāvatthī at the Eastern Monastery, the palace of Migāra's mother. And on that occasion the Blessed One, having emerged from his seclusion in the late afternoon, was sitting outside the doorway of the porch. Then King Pasenadi Kosala went to the Blessed One and, on arrival, having bowed down to him, sat to one side.", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 67, "end": 75, "label": "GPE", "text": "Sāvatthī"}, {"start": 83, "end": 100, "label": "LOC", "text": "Eastern Monastery"}, {"start": 158, "end": 169, "label": "PERSON", "text": "Blessed One"}, {"start": 279, "end": 299, "label": "PERSON", "text": "King Pasenadi Kosala"}, {"start": 312, "end": 323, "label": "PERSON", "text": "Blessed One"}], "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [83, 100, "LOC"], [158, 169, "PERSON"], [279, 299, "PERSON"], [312, 323, "PERSON"]], "meta": {}, "source": null}
{"text": "\"Once, monks, in this same Savatthi , there was a lady of a household named Vedehika . This good report about Lady Vedehika had circulated: 'Lady Vedehika is gentle. Lady Vedehika is even-tempered. Lady Vedehika is calm.' Now, Lady Vedehika had a slave named Kali who was diligent, deft, & neat in her work. The thought occurred to Kali the slave: 'This good report about my Lady Vedehika has circulated: \"Lady Vedehika is even-tempered. Lady Vedehika is gentle. Lady Vedehika is calm.\" Now, is anger present in my lady without showing, or is it absent? Or is it just because my work is neat that the anger present in my lady doesn't show? Why don't I test her?'", "spans": [{"start": 27, "end": 35, "label": "GPE", "text": "Savatthi"}, {"start": 76, "end": 84, "label": "PERSON", "text": "Vedehika"}, {"start": 115, "end": 123, "label": "PERSON", "text": "Vedehika"}, {"start": 146, "end": 154, "label": "PERSON", "text": "Vedehika"}, {"start": 171, "end": 179, "label": "PERSON", "text": "Vedehika"}, {"start": 203, "end": 211, "label": "PERSON", "text": "Vedehika"}, {"start": 232, "end": 240, "label": "PERSON", "text": "Vedehika"}, {"start": 380, "end": 388, "label": "PERSON", "text": "Vedehika"}, {"start": 411, "end": 419, "label": "PERSON", "text": "Vedehika"}, {"start": 443, "end": 451, "label": "PERSON", "text": "Vedehika"}, {"start": 468, "end": 476, "label": "PERSON", "text": "Vedehika"}], "entities": [[27, 35, "GPE"], [76, 84, "PERSON"], [115, 123, "PERSON"], [146, 154, "PERSON"], [171, 179, "PERSON"], [203, 211, "PERSON"], [232, 240, "PERSON"], [380, 388, "PERSON"], [411, 419, "PERSON"], [443, 451, "PERSON"], [468, 476, "PERSON"]], "meta": {}, "source": null}
{"text": "\"There are some contemplatives & brahmans who hold this doctrine, hold this view: 'There is no total cessation of becoming.' Some contemplatives & brahmans, speaking in direct opposition to those contemplatives & brahmans, say this: 'There is total cessation of becoming.' What do you think, householders? Don't these contemplatives & brahmans speak in direct opposition to each other?\"", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "Then the Blessed One, having gone for alms, after his meal, on returning from his alms round, said to Ven. Ananda, \"Ananda, let's go to the Eastern Park, the palace of Migara's mother , for the day's abiding.\"", "spans": [{"start": 9, "end": 20, "label": "PERSON", "text": "Blessed One"}, {"start": 107, "end": 113, "label": "PERSON", "text": "Ananda"}, {"start": 116, "end": 122, "label": "PERSON", "text": "Ananda"}, {"start": 140, "end": 152, "label": "LOC", "text": "Eastern Park"}], "entities": [[9, 20, "PERSON"], [107, 113, "PERSON"], [116, 122, "PERSON"], [140, 152, "LOC"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi in the Eastern Monastery, the palace of Migara's mother . And on that occasion — the uposatha of the fifteenth, the night of a very full moon — he was sitting out in the open with the community of monks.", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 67, "end": 75, "label": "GPE", "text": "Savatthi"}, {"start": 83, "end": 100, "label": "LOC", "text": "Eastern Monastery"}], "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [83, 100, "LOC"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was wandering among the Mallans, together with a large community of monks, and came to a brahman village of the Mallans named Thūna. The brahman householders of Thūna heard that \"Gotama the Sakyan contemplative, gone forth from the Sakyan clan, is wandering among the Mallans together with a large community of monks, and has arrived at Thūna.\" So they filled the well all the way to the brim with grass & chaff, [thinking], \"Don't let these shaven-headed contemplatives draw drinking water.\"", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 74, "end": 81, "label": "NORP", "text": "Mallans"}, {"start": 162, "end": 169, "label": "NORP", "text": "Mallans"}, {"start": 229, "end": 235, "label": "PERSON", "text": "Gotama"}, {"start": 318, "end": 325, "label": "NORP", "text": "Mallans"}], "entities": [[38, 49, "PERSON"], [74, 81, "NORP"], [162, 169, "NORP"], [229, 235, "PERSON"], [318, 325, "NORP"]], "meta": {}, "source": null}
{"text": ". I heard thus. Once the Blessed One, while wandering in the Kosala country with a large community of bhikkhus, entered a town of the Kalama people called Kesaputta . The Kalamas who were inhabitants of Kesaputta: \"Reverend Gotama, the monk, the son of the Sakyans, has, while wandering in the Kosala country, entered Kesaputta. The good repute of the Reverend Gotama has been spread in this way: Indeed, the Blessed One is thus consummate, fully enlightened, endowed with knowledge and practice, sublime, knower of the worlds, peerless, guide of tamable men, teacher of divine and human beings, which he by himself has through direct knowledge understood clearly. He set forth the Dhamma, good in the beginning, good in the middle, good in the end, possessed of meaning and the letter, and complete in everything; and he proclaims the holy life that is perfectly pure. Seeing such consummate ones is good indeed.\"", "spans": [{"start": 25, "end": 36, "label": "PERSON", "text": "Blessed One"}, {"start": 61, "end": 67, "label": "GPE", "text": "Kosala"}, {"start": 134, "end": 140, "label": "NORP", "text": "Kalama"}, {"start": 155, "end": 164, "label": "GPE", "text": "Kesaputta"}, {"start": 171, "end": 178, "label": "NORP", "text": "Kalamas"}, {"start": 203, "end": 212, "label": "GPE", "text": "Kesaputta"}, {"start": 215, "end": 230, "label": "PERSON", "text": "Reverend Gotama"}, {"start": 257, "end": 264, "label": "NORP", "text": "Sakyans"}, {"start": 294, "end": 300, "label": "GPE", "text": "Kosala"}, {"start": 318, "end": 327, "label": "GPE", "text": "Kesaputta"}, {"start": 352, "end": 367, "label": "PERSON", "text": "Reverend Gotama"}, {"start": 409, "end": 420, "label": "PERSON", "text": "Blessed One"}], "entities": [[25, 36, "PERSON"], [61, 67, "GPE"], [134, 140, "NORP"], [155, 164, "GPE"], [171, 178, "NORP"], [203, 212, "GPE"], [215, 230, "PERSON"], [257, 264, "NORP"], [294, 300, "GPE"], [318, 327, "GPE"], [352, 367, "PERSON"], [409, 420, "PERSON"]], "meta": {}, "source": null}
{"text": "\"When the Tathagata — worthy & rightly self-awakened — was still just an unawakened bodhisatta, this great earth was his great bed. The Himalayas , king of mountains, was his pillow. His left hand rested in the eastern sea, his right hand in the western sea, and both feet in the southern sea. When the Tathagata — worthy & rightly self-awakened — was still just an unawakened bodhisatta, this was the first great dream that appeared to him.", "spans": [{"start": 10, "end": 19, "label": "PERSON", "text": "Tathagata"}, {"start": 303, "end": 312, "label": "PERSON", "text": "Tathagata"}], "entities": [[10, 19, "PERSON"], [303, 312, "PERSON"]], "meta": {}, "source": null}
{"text": "Then Anathapindika the householder, surrounded by about 500 lay followers, went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there the Blessed One said to him, \"Householder, you have provided the community of monks with robes, alms food, lodgings, & medicinal requisites for the sick, but you shouldn't rest content with the thought, 'We have provided the community of monks with robes, alms food, lodgings, & medicinal requisites for the sick.' So you should train yourself, 'Let's periodically enter & remain in seclusion & rapture.' That's how you should train yourself.\"", "spans": [{"start": 5, "end": 18, "label": "PERSON", "text": "Anathapindika"}, {"start": 87, "end": 98, "label": "PERSON", "text": "Blessed One"}, {"start": 187, "end": 198, "label": "PERSON", "text": "Blessed One"}], "entities": [[5, 18, "PERSON"], [87, 98, "PERSON"], [187, 198, "PERSON"]], "meta": {}, "source": null}
{"text": "Then Moliyasivaka the wanderer went to the Blessed One and exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to the Blessed One, \"'The Dhamma is visible here-&-now, the Dhamma is visible here-&-now,' it is said. To what extent is the Dhamma visible here-&-now, timeless, inviting verification, pertinent, to be realized by the wise for themselves?\"", "spans": [{"start": 5, "end": 17, "label": "PERSON", "text": "Moliyasivaka"}, {"start": 43, "end": 54, "label": "PERSON", "text": "Blessed One"}, {"start": 213, "end": 224, "label": "PERSON", "text": "Blessed One"}], "entities": [[5, 17, "PERSON"], [43, 54, "PERSON"], [213, 224, "PERSON"]], "meta": {}, "source": null}
{"text": "\"When the Tathagata — worthy & rightly self-awakened — was still just an unawakened bodhisatta, and white worms with black heads crawling up from his feet covered him as far as his knees: this third great dream appeared to let him know that many white-clothed householders would go for life-long refuge to the Tathagata.", "spans": [{"start": 10, "end": 19, "label": "PERSON", "text": "Tathagata"}, {"start": 310, "end": 319, "label": "PERSON", "text": "Tathagata"}], "entities": [[10, 19, "PERSON"], [310, 319, "PERSON"]], "meta": {}, "source": null}
{"text": "\"In five ways, young householder, should a householder minister to ascetics and brahmans as the Zenith :", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "When this had been said, one of the wanderers said to Anathapindika the householder, \" The cosmos is eternal. Only this is true; anything otherwise is worthless. This is the sort of view I have.\"", "spans": [{"start": 54, "end": 67, "label": "PERSON", "text": "Anathapindika"}], "entities": [[54, 67, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying near Sāvatthī at the Eastern Monastery, the palace of Migāra's mother. And on that occasion, the Blessed One — it being the observance day — was sitting surrounded by the community of monks. Then Ven. Ānanda — when the night was far advanced, at the end of the first watch — got up from his seat, arranged his robe over one shoulder, stood facing the Blessed One, paying homage with his hands placed palm-to-palm over his heart, and said to him, \"Lord, the night is far advanced. The first watch has ended. The community of monks has been sitting here long. May the Blessed One recite the Pāṭimokkha to them.\" When this was said, the Blessed One remained silent.", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 67, "end": 75, "label": "GPE", "text": "Sāvatthī"}, {"start": 83, "end": 100, "label": "LOC", "text": "Eastern Monastery"}, {"start": 159, "end": 170, "label": "PERSON", "text": "Blessed One"}, {"start": 263, "end": 269, "label": "PERSON", "text": "Ānanda"}, {"start": 413, "end": 424, "label": "PERSON", "text": "Blessed One"}, {"start": 628, "end": 639, "label": "PERSON", "text": "Blessed One"}, {"start": 696, "end": 707, "label": "PERSON", "text": "Blessed One"}], "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [83, 100, "LOC"], [159, 170, "PERSON"], [263, 269, "PERSON"], [413, 424, "PERSON"], [628, 639, "PERSON"], [696, 707, "PERSON"]], "meta": {}, "source": null}
{"text": "\"Monks, these two slander the Tathagata. Which two? He who explains a discourse whose meaning needs to be inferred as one whose meaning has already been fully drawn out. And he who explains a discourse whose meaning has already been fully drawn out as one whose meaning needs to be inferred. These are two who slander the Tathagata.\"", "spans": [{"start": 30, "end": 39, "label": "PERSON", "text": "Tathagata"}, {"start": 322, "end": 331, "label": "PERSON", "text": "Tathagata"}], "entities": [[30, 39, "PERSON"], [322, 331, "PERSON"]], "meta": {}, "source": null}
{"text": "Then Anathapindika the householder went to where the wanderers of other persuasions were staying. On arrival he greeted them courteously. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, the wanderers said to him, \"Tell us, householder, what views Gotama the contemplative has.\"", "spans": [{"start": 5, "end": 18, "label": "PERSON", "text": "Anathapindika"}, {"start": 298, "end": 304, "label": "PERSON", "text": "Gotama"}], "entities": [[5, 18, "PERSON"], [298, 304, "PERSON"]], "meta": {}, "source": null}
{"text": "\"In the same way, householder, a disciple of the noble ones considers this point: 'The Blessed One has compared sensuality to borrowed goods, of much stress, much despair, & greater drawbacks.' Seeing this with right discernment, as it actually is, then avoiding the equanimity coming from multiplicity, dependent on multiplicity, he develops the equanimity coming from singleness, dependent on singleness, where sustenance/clinging for the baits of the world ceases without trace.", "spans": [{"start": 87, "end": 98, "label": "PERSON", "text": "Blessed One"}], "entities": [[87, 98, "PERSON"]], "meta": {}, "source": null}
{"text": "\"Lord, those are the brahman householders of Icchanangala standing at the gate house to the Icchanangala forest grove, having brought many staple & non-staple foods for the sake of the Blessed One & the community of monks.\"", "spans": [{"start": 45, "end": 57, "label": "GPE", "text": "Icchanangala"}, {"start": 92, "end": 104, "label": "GPE", "text": "Icchanangala"}, {"start": 185, "end": 196, "label": "PERSON", "text": "Blessed One"}], "entities": [[45, 57, "GPE"], [92, 104, "GPE"], [185, 196, "PERSON"]], "meta": {}, "source": null}
{"text": ". Thus have I heard. On one occasion the Blessed One was living in the Koliyan country: there is a town of the Koliyans called Haliddavasana .", "spans": [{"start": 41, "end": 52, "label": "PERSON", "text": "Blessed One"}, {"start": 71, "end": 78, "label": "NORP", "text": "Koliyan"}, {"start": 111, "end": 119, "label": "NORP", "text": "Koliyans"}], "entities": [[41, 52, "PERSON"], [71, 78, "NORP"], [111, 119, "NORP"]], "meta": {}, "source": null}
{"text": "So Anathapindika went to the Cool Grove. Now at that time, the Blessed One — having gotten up as the night was ending — was pacing back & forth in the open air. He saw Anathapindika the householder coming from afar. On seeing him, he got down from his meditation path and sat on a seat made ready. As he was sitting there he said to Anathapindika, \"Come, Sudatta.\"", "spans": [{"start": 3, "end": 16, "label": "PERSON", "text": "Anathapindika"}, {"start": 63, "end": 74, "label": "PERSON", "text": "Blessed One"}, {"start": 168, "end": 181, "label": "PERSON", "text": "Anathapindika"}, {"start": 333, "end": 346, "label": "PERSON", "text": "Anathapindika"}], "entities": [[3, 16, "PERSON"], [63, 74, "PERSON"], [168, 181, "PERSON"], [333, 346, "PERSON"]], "meta": {}, "source": null}
{"text": "There are great cities, Lord, such as Campa, Rajagaha, Savatthi, Saketa, Kosambi, and Benares — let the Blessed One have his final passing away in one of those. For in those cities dwell many wealthy nobles and brahmans and householders who are devotees of the Tathagata, and they will render due honor to the remains of the Tathagata.\"", "spans": [{"start": 24, "end": 28, "label": "PERSON", "text": "Lord"}, {"start": 38, "end": 43, "label": "GPE", "text": "Campa"}, {"start": 45, "end": 53, "label": "GPE", "text": "Rajagaha"}, {"start": 55, "end": 63, "label": "GPE", "text": "Savatthi"}, {"start": 65, "end": 71, "label": "GPE", "text": "Saketa"}, {"start": 73, "end": 80, "label": "GPE", "text": "Kosambi"}, {"start": 86, "end": 93, "label": "GPE", "text": "Benares"}, {"start": 104, "end": 115, "label": "PERSON", "text": "Blessed One"}, {"start": 261, "end": 270, "label": "PERSON", "text": "Tathagata"}, {"start": 325, "end": 334, "label": "PERSON", "text": "Tathagata"}], "entities": [[24, 28, "PERSON"], [38, 43, "GPE"], [45, 53, "GPE"], [55, 63, "GPE"], [65, 71, "GPE"], [73, 80, "GPE"], [86, 93, "GPE"], [104, 115, "PERSON"], [261, 270, "PERSON"], [325, 334, "PERSON"]], "meta": {}, "source": null}
{"text": "\"Yes, it is, great king. But first, with regard to that, I will ask you a counter-question. Answer however you please. Suppose there were a man of yours: a farmer, a householder, a taxpayer swelling the royal treasury. The thought would occur to him: 'Isn't it amazing? Isn't it astounding? — the destination, the results, of meritorious deeds! For this King Ajatasattu is a human being, and I, too, am a human being, yet King Ajatasattu enjoys himself supplied and replete with the five strings of sensuality — like a deva, as it were — while I am a farmer, a householder, a taxpayer swelling the royal treasury. I, too, should do meritorious deeds. What if I were to shave off my hair and beard, put on the ochre robes, and go forth from the household life into homelessness?'", "spans": [{"start": 354, "end": 369, "label": "PERSON", "text": "King Ajatasattu"}, {"start": 422, "end": 437, "label": "PERSON", "text": "King Ajatasattu"}], "entities": [[354, 369, "PERSON"], [422, 437, "PERSON"]], "meta": {}, "source": null}
{"text": "At that time a young householder named Sigalaka arose early and set out from Rajagaha with freshly washed clothes and hair. [3] With palms together held up in reverence, [4] he was paying respect towards the six directions: [5] that is east, south, west, north, lower and upper.", "spans": [{"start": 39, "end": 47, "label": "PERSON", "text": "Sigalaka"}, {"start": 77, "end": 85, "label": "GPE", "text": "Rajagaha"}], "entities": [[39, 47, "PERSON"], [77, 85, "GPE"]], "meta": {}, "source": null}
{"text": "\" There are these four marvelous & amazing qualities in Ananda. If a group of monks approaches to see Ananda, they are gratified at the sight of him. If he speaks Dhamma to them, they are gratified with what he says. Before they are sated, he falls silent. If a group of nuns approaches to see Ananda... If a group of male lay followers approaches to see Ananda... If a group of female lay followers approaches to see Ananda, they are gratified at the sight of him. If he speaks Dhamma to them, they are gratified with what he says. Before they are sated, he falls silent. These are the four marvelous & amazing qualities in Ananda. There are these four marvelous & amazing qualities in a wheel-turning monarch. If a group of noble warriors approaches to see him... If a group of brahmans approaches to see him... If a group of householders approaches to see him... If a group of contemplatives approaches to see him, they are gratified at the sight of him. If he speaks to them, they are gratified with what he says. Before they are sated, he falls silent. In the same way, monks, there are these four marvelous & amazing qualities in Ananda. If a group of monks... a group of nuns... a group of male lay followers... a group of female lay followers approaches to see Ananda, they are gratified at the sight of him. If he speaks Dhamma to them, they are gratified with what he says. Before they are sated, he falls silent. These are the four marvelous & amazing qualities in Ananda.\"", "spans": [{"start": 56, "end": 62, "label": "PERSON", "text": "Ananda"}, {"start": 102, "end": 108, "label": "PERSON", "text": "Ananda"}, {"start": 294, "end": 300, "label": "PERSON", "text": "Ananda"}, {"start": 355, "end": 361, "label": "PERSON", "text": "Ananda"}, {"start": 418, "end": 424, "label": "PERSON", "text": "Ananda"}, {"start": 625, "end": 631, "label": "PERSON", "text": "Ananda"}, {"start": 1136, "end": 1142, "label": "PERSON", "text": "Ananda"}, {"start": 1269, "end": 1275, "label": "PERSON", "text": "Ananda"}, {"start": 1476, "end": 1482, "label": "PERSON", "text": "Ananda"}], "entities": [[56, 62, "PERSON"], [102, 108, "PERSON"], [294, 300, "PERSON"], [355, 361, "PERSON"], [418, 424, "PERSON"], [625, 631, "PERSON"], [1136, 1142, "PERSON"], [1269, 1275, "PERSON"], [1476, 1482, "PERSON"]], "meta": {}, "source": null}
{"text": "\"And how is a monk one with a sense of social gatherings ? There is the case where a monk knows his social gathering: 'This is a social gathering of noble warriors; this, a social gathering of brahmans; this, a social gathering of householders; this, a social gathering of contemplatives; here one should approach them in this way, stand in this way, act in this way, sit in this way, speak in this way, stay silent in this way.' If he didn't know his social gathering — 'This is a social gathering of noble warriors; this, a social gathering of brahmans; this, a social gathering of householders; this, a social gathering of contemplatives; here one should approach them in this way, stand in this way, act in this way, sit in this way, speak in this way, stay silent in this way' — he wouldn't be said to be one with a sense of social gatherings. So it's because he does know his social gathering — 'This is a social gathering of noble warriors; this, a social gathering of brahmans; this, a social gathering of householders; this, a social gathering of contemplatives; here one should approach them in this way, stand in this way, act in this way, sit in this way, speak in this way, stay silent in this way' — that he is said to be one with a sense of social gatherings. This is one with a sense of Dhamma, a sense of meaning, a sense of himself, a sense of moderation, a sense of time, & a sense of social gatherings.", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "\"There is the case, Bharadvaja, where a monk lives in dependence on a certain village or town. Then a householder or householder's son goes to him and observes him with regard to three mental qualities — qualities based on greed, qualities based on aversion, qualities based on delusion: 'Are there in this venerable one any such qualities based on greed that, with his mind overcome by these qualities, he might say, \"I know,\" while not knowing, or say, \"I see,\" while not seeing; or that he might urge another to act in a way that was for his/her long-term harm & pain?' As he observes him, he comes to know, 'There are in this venerable one no such qualities based on greed... His bodily behavior & verbal behavior are those of one not greedy. And the Dhamma he teaches is deep, hard to see, hard to realize, tranquil, refined, beyond the scope of conjecture, subtle, to-be-experienced by the wise. This Dhamma can't easily be taught by a person who's greedy.", "spans": [{"start": 20, "end": 30, "label": "PERSON", "text": "Bharadvaja"}], "entities": [[20, 30, "PERSON"]], "meta": {}, "source": null}
{"text": "When this had been said, the wanderers fell silent, abashed, sitting with their shoulders drooping, their heads down, brooding, at a loss for words. Anathapindika the householder, perceiving that the wanderers were silent, abashed... at a loss for words, got up & went to where the Blessed One was staying. On arrival, having bowed down to the Blessed One, he sat to one side. As he was seated there, he told the Blessed One the entirety of his conversation with the wanderers.", "spans": [{"start": 149, "end": 162, "label": "PERSON", "text": "Anathapindika"}, {"start": 282, "end": 293, "label": "PERSON", "text": "Blessed One"}, {"start": 344, "end": 355, "label": "PERSON", "text": "Blessed One"}, {"start": 413, "end": 424, "label": "PERSON", "text": "Blessed One"}], "entities": [[149, 162, "PERSON"], [282, 293, "PERSON"], [344, 355, "PERSON"], [413, 424, "PERSON"]], "meta": {}, "source": null}
{"text": "Ven. Sariputta said: \"Friends, in foreign lands there are wise nobles & brahmans, householders & contemplatives — for the people there are wise & discriminating — who will question a monk: 'What is your teacher's doctrine? What does he teach?'", "spans": [{"start": 5, "end": 14, "label": "PERSON", "text": "Sariputta"}], "entities": [[5, 14, "PERSON"]], "meta": {}, "source": null}
{"text": "Now at that time a clansman named Ratthapala, the son of the leading clan in that same Thullakotthita, was sitting in that assembly. The thought occurred to him, \"As I understand the Dhamma taught by the Blessed One, it's not easy, living at home, to practice the holy life totally perfect, totally pure, a polished shell. What if I, having shaved off my hair & beard and putting on the ochre robe, were to go forth from the household life into homelessness?\"", "spans": [{"start": 204, "end": 215, "label": "PERSON", "text": "Blessed One"}], "entities": [[204, 215, "PERSON"]], "meta": {}, "source": null}
{"text": "\"In these six ways do ascetics and brahmans show their compassion towards a householder who ministers to them as the Zenith . Thus is the Zenith covered by him and made safe and secure.\" Thus spoke the Exalted One. And when the Master had thus spoken, he spoke yet again:", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "Then Anathapindika the householder went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there the Blessed One said to him: \"There are these four kinds of bliss that can be attained in the proper season, on the proper occasions, by a householder partaking of sensuality. Which four? The bliss of having, the bliss of [making use of] wealth, the bliss of debtlessness, the bliss of blamelessness.", "spans": [{"start": 5, "end": 18, "label": "PERSON", "text": "Anathapindika"}, {"start": 47, "end": 58, "label": "PERSON", "text": "Blessed One"}, {"start": 147, "end": 158, "label": "PERSON", "text": "Blessed One"}], "entities": [[5, 18, "PERSON"], [47, 58, "PERSON"], [147, 158, "PERSON"]], "meta": {}, "source": null}
{"text": "So the brahman householders of Sala went to the Blessed One. On arrival, some of them bowed down to the Blessed One and sat to one side. Some of them exchanged courteous greetings with him and, after an exchange of friendly greetings & courtesies, sat to one side. Some of them sat to one side having saluted him with their hands palm-to-palm over their hearts. Some of them sat to one side having announced their name & clan. Some of them sat to one side in silence.", "spans": [{"start": 48, "end": 59, "label": "PERSON", "text": "Blessed One"}, {"start": 104, "end": 115, "label": "PERSON", "text": "Blessed One"}], "entities": [[48, 59, "PERSON"], [104, 115, "PERSON"]], "meta": {}, "source": null}
{"text": "\"But what compelling reason do those garden devas, forest devas, tree devas, and devas inhabiting herbs, grasses, & forest giants see, master, that they say to you, 'Make a wish, householder: \"In the future, may I become a king, a wheel-turning monarch!\"'?\"", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "What is most interesting about the Milindapañha is that it is the product of the encounter of two great civilizations — Hellenistic Greece and Buddhist India — and is thus of continuing relevance as the wisdom of the East meets the modern Western world. King Milinda poses questions about dilemmas raised by Buddhist philosophy that we might ask today. And Nagasena's responses are full of wisdom, wit, and helpful analogies.", "spans": [{"start": 132, "end": 138, "label": "PERSON", "text": "Greece"}, {"start": 254, "end": 266, "label": "PERSON", "text": "King Milinda"}], "entities": [[132, 138, "PERSON"], [254, 266, "PERSON"]], "meta": {}, "source": null}
{"text": "[ At Saavatthii ] Now the Venerable Nanda, the Blessed One's first cousin, put on well-pressed [1] robes, painted his eyes, [2] took a bright shiny bowl and went before the Blessed One. Having saluted the Blessed One he sat down to one side. As he sat there the Blessed One said: \"It is not suitable for you, Nanda, who as a young man of good family have left the household life, in faith, for homelessness, to appear in well-pressed robes, with painted eyes and a bright shiny bowl. The proper thing for you, Nanda,... is to be a forest-dweller, to go for alms in ragged robes, dwelling aloof from sense-desires.\" [ He added the verse: ]", "spans": [{"start": 2, "end": 4, "label": "LOC", "text": "At"}, {"start": 5, "end": 15, "label": "GPE", "text": "Saavatthii"}, {"start": 26, "end": 41, "label": "PERSON", "text": "Venerable Nanda"}, {"start": 47, "end": 60, "label": "PERSON", "text": "Blessed One's"}, {"start": 173, "end": 184, "label": "PERSON", "text": "Blessed One"}, {"start": 205, "end": 216, "label": "PERSON", "text": "Blessed One"}, {"start": 262, "end": 273, "label": "PERSON", "text": "Blessed One"}], "entities": [[2, 4, "LOC"], [5, 15, "GPE"], [26, 41, "PERSON"], [47, 60, "PERSON"], [173, 184, "PERSON"], [205, 216, "PERSON"], [262, 273, "PERSON"]], "meta": {}, "source": null}
{"text": "\"Now it may be that you are thinking, 'Nakula's mother will not be able to support the children or maintain the household after I'm gone,' but you shouldn't see things in that way. I am skilled at spinning cotton, at carding matted wool. I can support the children and maintain the household after you are gone. So don't be worried as you die, householder. Death is painful for one who is worried. The Blessed One has criticized being worried at the time of death.", "spans": [{"start": 402, "end": 413, "label": "PERSON", "text": "Blessed One"}], "entities": [[402, 413, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying at Savatthi in the Eastern Monastery, the palace of Migara's mother, together with many well-known elder disciples — with Ven. Sariputta, Ven. Maha Moggallana, Ven. Maha Kassapa, Ven. Maha Kaccana, Ven. Maha Kotthita , Ven. Maha Kappina , Ven. Maha Cunda , Ven. Revata , Ven. Ananda , and other well-known elder disciples. On that occasion the elder monks were teaching & instructing. Some elder monks were teaching & instructing ten monks, some were teaching & instructing twenty monks, some were teaching & instructing thirty monks, some were teaching & instructing forty monks. The new monks, being taught & instructed by the elder monks, were discerning grand, successive distinctions.", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 65, "end": 73, "label": "GPE", "text": "Savatthi"}, {"start": 81, "end": 98, "label": "LOC", "text": "Eastern Monastery"}, {"start": 114, "end": 129, "label": "PERSON", "text": "Migara's mother"}, {"start": 184, "end": 198, "label": "PERSON", "text": "Ven. Sariputta"}, {"start": 200, "end": 220, "label": "PERSON", "text": "Ven. Maha Moggallana"}, {"start": 222, "end": 239, "label": "PERSON", "text": "Ven. Maha Kassapa"}, {"start": 241, "end": 258, "label": "PERSON", "text": "Ven. Maha Kaccana"}, {"start": 260, "end": 278, "label": "PERSON", "text": "Ven. Maha Kotthita"}, {"start": 281, "end": 298, "label": "PERSON", "text": "Ven. Maha Kappina"}, {"start": 301, "end": 316, "label": "PERSON", "text": "Ven. Maha Cunda"}, {"start": 319, "end": 330, "label": "PERSON", "text": "Ven. Revata"}, {"start": 333, "end": 344, "label": "PERSON", "text": "Ven. Ananda"}], "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [81, 98, "LOC"], [114, 129, "PERSON"], [184, 198, "PERSON"], [200, 220, "PERSON"], [222, 239, "PERSON"], [241, 258, "PERSON"], [260, 278, "PERSON"], [281, 298, "PERSON"], [301, 316, "PERSON"], [319, 330, "PERSON"], [333, 344, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying at Savatthi , in Jeta's Grove, Anathapindika's monastery. There he addressed the monks: \"Monks!\"", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 65, "end": 73, "label": "GPE", "text": "Savatthi"}, {"start": 79, "end": 91, "label": "LOC", "text": "Jeta's Grove"}, {"start": 93, "end": 118, "label": "LOC", "text": "Anathapindika's monastery"}], "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [79, 91, "LOC"], [93, 118, "LOC"]], "meta": {}, "source": null}
{"text": "Then Ratthapala, rising from his seat, bowing down to the Blessed One and keeping him on his right, went to his parents and said, \"Mom, Dad, as I understand the Dhamma taught by the Blessed One, it's not easy, living at home, to practice the holy life totally perfect, totally pure, a polished shell. I want — having shaved off my hair & beard and putting on the ochre robe — to go forth from the household life into homelessness. Please give me your permission to go forth from the household life into homelessness.\"", "spans": [{"start": 58, "end": 69, "label": "PERSON", "text": "Blessed One"}, {"start": 182, "end": 193, "label": "PERSON", "text": "Blessed One"}], "entities": [[58, 69, "PERSON"], [182, 193, "PERSON"]], "meta": {}, "source": null}
{"text": "While Nakula's father the householder was being exhorted by Nakula's mother with this exhortation, his disease was immediately allayed. And he recovered from his disease. That was how Nakula's father's disease was abandoned.", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "25. And the Blessed One spent much of the night instructing the devotees of Pataligama in the Dhamma, rousing, edifying, and gladdening them, after which he dismissed them, saying: \"The night is far advanced, householders. You may go at your convenience.", "spans": [{"start": 12, "end": 23, "label": "PERSON", "text": "Blessed One"}, {"start": 76, "end": 86, "label": "GPE", "text": "Pataligama"}], "entities": [[12, 23, "PERSON"], [76, 86, "GPE"]], "meta": {}, "source": null}
{"text": "\"The ascetics and brahmans thus ministered to as the Zenith by a householder show their compassion towards him in six ways:", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "So the Blessed One, putting on his robe and taking up his bowl & outer robe, went together with a community of monks to the reception hall. On arrival he washed his feet, entered the hall, and sat with his back to the central post, facing east. The community of monks washed their feet, entered the hall, and sat with their backs to the western wall, facing east, ranged around the Blessed One. The Kapilavatthu Sakyans washed their feet, entered the hall, and sat with their backs to the eastern wall, facing west, ranged around the Blessed One. Then the Blessed One — having spent most of the night instructing, urging, rousing, & encouraging the Kapilavatthu Sakyans with a Dhamma talk — said to Ven. Ananda , \"Ananda, speak to the Kapilavatthu Sakyans about the person who follows the practice for one in training. [2] My back aches. I will rest it.\"", "spans": [{"start": 7, "end": 18, "label": "PERSON", "text": "Blessed One"}, {"start": 382, "end": 393, "label": "PERSON", "text": "Blessed One"}, {"start": 412, "end": 419, "label": "NORP", "text": "Sakyans"}, {"start": 534, "end": 545, "label": "PERSON", "text": "Blessed One"}, {"start": 556, "end": 567, "label": "PERSON", "text": "Blessed One"}, {"start": 662, "end": 669, "label": "NORP", "text": "Sakyans"}, {"start": 704, "end": 710, "label": "PERSON", "text": "Ananda"}, {"start": 714, "end": 720, "label": "PERSON", "text": "Ananda"}, {"start": 748, "end": 755, "label": "NORP", "text": "Sakyans"}], "entities": [[7, 18, "PERSON"], [382, 393, "PERSON"], [412, 419, "NORP"], [534, 545, "PERSON"], [556, 567, "PERSON"], [662, 669, "NORP"], [704, 710, "PERSON"], [714, 720, "PERSON"], [748, 755, "NORP"]], "meta": {}, "source": null}
{"text": "A second time, Ven. Ānanda replied, \"Just now, lord, the brahman householders of Thūna filled that well all the way to the brim with grass & chaff, [thinking], 'Don't let these shaven-headed contemplatives draw drinking water.'\"", "spans": [{"start": 20, "end": 26, "label": "PERSON", "text": "Ānanda"}, {"start": 81, "end": 86, "label": "GPE", "text": "Thūna"}], "entities": [[20, 26, "PERSON"], [81, 86, "GPE"]], "meta": {}, "source": null}
{"text": "1. Thus have I heard. Once the Blessed One [1] dwelt at Rajagaha , on the hill called Vultures' Peak. At that time the king of Magadha , Ajatasattu, son of the Videhi queen, [2] desired to wage war against the Vajjis . He spoke in this fashion: \"These Vajjis, powerful and glorious as they are, I shall annihilate them, I shall make them perish, I shall utterly destroy them.\"", "spans": [{"start": 31, "end": 42, "label": "PERSON", "text": "Blessed One"}, {"start": 56, "end": 64, "label": "GPE", "text": "Rajagaha"}, {"start": 86, "end": 100, "label": "LOC", "text": "Vultures' Peak"}, {"start": 127, "end": 134, "label": "GPE", "text": "Magadha"}, {"start": 137, "end": 147, "label": "PERSON", "text": "Ajatasattu"}, {"start": 160, "end": 172, "label": "PERSON", "text": "Videhi queen"}, {"start": 210, "end": 216, "label": "NORP", "text": "Vajjis"}, {"start": 252, "end": 258, "label": "NORP", "text": "Vajjis"}], "entities": [[31, 42, "PERSON"], [56, 64, "GPE"], [86, 100, "LOC"], [127, 134, "GPE"], [137, 147, "PERSON"], [160, 172, "PERSON"], [210, 216, "NORP"], [252, 258, "NORP"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying at Savatthi in the Eastern Monastery, the palace of Migara's mother. Then in the evening, Ven. Ananda , coming out of seclusion, went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there, he said to the Blessed One: \"On one occasion, when the Blessed One was staying among the Sakyans in a Sakyan town named Nagaraka , there — face-to-face with the Blessed One — I heard this, face-to-face I learned this: 'I now remain fully in a dwelling of emptiness.' Did I hear that correctly, learn it correctly, attend to it correctly, remember it correctly?\"", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 65, "end": 73, "label": "GPE", "text": "Savatthi"}, {"start": 81, "end": 98, "label": "LOC", "text": "Eastern Monastery"}, {"start": 114, "end": 129, "label": "PERSON", "text": "Migara's mother"}, {"start": 152, "end": 163, "label": "PERSON", "text": "Ven. Ananda"}, {"start": 203, "end": 214, "label": "PERSON", "text": "Blessed One"}, {"start": 315, "end": 326, "label": "PERSON", "text": "Blessed One"}, {"start": 355, "end": 366, "label": "PERSON", "text": "Blessed One"}, {"start": 389, "end": 396, "label": "NORP", "text": "Sakyans"}, {"start": 402, "end": 413, "label": "LOC", "text": "Sakyan town"}, {"start": 420, "end": 428, "label": "GPE", "text": "Nagaraka"}, {"start": 461, "end": 472, "label": "PERSON", "text": "Blessed One"}], "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [81, 98, "LOC"], [114, 129, "PERSON"], [152, 163, "PERSON"], [203, 214, "PERSON"], [315, 326, "PERSON"], [355, 366, "PERSON"], [389, 396, "NORP"], [402, 413, "LOC"], [420, 428, "GPE"], [461, 472, "PERSON"]], "meta": {}, "source": null}
{"text": "A second time... A third time, Ratthapala said to his parents, \"Mom, Dad, as I understand the Dhamma taught by the Blessed One, it's not easy, living at home, to practice the holy life totally perfect, totally pure, a polished shell. I want — having shaved off my hair & beard and putting on the ochre robe — to go forth from the household life into homelessness. Please give me your permission to go forth from the household life into homelessness.\"", "spans": [{"start": 115, "end": 126, "label": "PERSON", "text": "Blessed One"}], "entities": [[115, 126, "PERSON"]], "meta": {}, "source": null}
{"text": "He makes known this world with the devas, with Mara, with Brahma, the creation with its recluses and brahmans, its devas and men, having realized them by his own super-knowledge. He teaches dhamma which is lovely at the beginning, lovely in the middle, lovely at the ending, with the spirit and the letters; he proclaims the Brahma-faring, [3] wholly fulfilled, quite purified. A householder or a householder's son or one born in another family hears that dhamma. Having heard that dhamma he gains faith in the Tathagata.", "spans": [{"start": 35, "end": 40, "label": "NORP", "text": "devas"}, {"start": 47, "end": 51, "label": "PERSON", "text": "Mara"}, {"start": 58, "end": 64, "label": "PERSON", "text": "Brahma"}, {"start": 115, "end": 120, "label": "NORP", "text": "devas"}, {"start": 325, "end": 331, "label": "PERSON", "text": "Brahma"}, {"start": 511, "end": 520, "label": "PERSON", "text": "Tathagata"}], "entities": [[35, 40, "NORP"], [47, 51, "PERSON"], [58, 64, "PERSON"], [115, 120, "NORP"], [325, 331, "PERSON"], [511, 520, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying among the Sakyans at Kapilavatthu in the Banyan Park. Now at that time a new reception hall [1] had just been built by the Kapilavatthu Sakyans, and it had not yet been dwelled in by any contemplative, brahman, or anyone at all in human form.", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 72, "end": 79, "label": "NORP", "text": "Sakyans"}, {"start": 83, "end": 95, "label": "GPE", "text": "Kapilavatthu"}, {"start": 103, "end": 114, "label": "LOC", "text": "Banyan Park"}, {"start": 185, "end": 197, "label": "GPE", "text": "Kapilavatthu"}, {"start": 198, "end": 205, "label": "NORP", "text": "Sakyans"}], "entities": [[38, 49, "PERSON"], [72, 79, "NORP"], [83, 95, "GPE"], [103, 114, "LOC"], [185, 197, "GPE"], [198, 205, "NORP"]], "meta": {}, "source": null}
{"text": "When this was said, the wanderers fell silent, abashed, sitting with their shoulders drooping, their heads down, brooding, at a loss for words. Vajjiya Mahita the householder, perceiving that the wanderers were silent, abashed... at a loss for words, got up & went to the Blessed One. On arrival, having bowed down to the Blessed One, he sat to one side. As he was sitting there, he told the Blessed One the entirety of his conversation with the wanderers.", "spans": [{"start": 272, "end": 283, "label": "PERSON", "text": "Blessed One"}, {"start": 322, "end": 333, "label": "PERSON", "text": "Blessed One"}, {"start": 392, "end": 403, "label": "PERSON", "text": "Blessed One"}], "entities": [[272, 283, "PERSON"], [322, 333, "PERSON"], [392, 403, "PERSON"]], "meta": {}, "source": null}
{"text": "\"Having thus been answered, there may be wise nobles & brahmans, householders & contemplatives... who will question you further, 'And seeing what danger does your teacher teach the subduing of passion & desire for form... for feeling... for perception... for fabrications. Seeing what danger does your teacher teach the subduing of passion & desire for consciousness?'", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "Then the householder Nakulapita, delighting in & approving of the Blessed One's words, rose from his seat and — bowing down to the Blessed One and circumambulating him, keeping him to his right — went to Ven. Sariputta and on arrival, having bowed down to him, sat to one side. As he was sitting there, Ven. Sariputta said to him, \"Your faculties are clear & calm, householder, your complexion pure. Have you had the opportunity today of listening to a Dhamma talk in the presence of the Blessed One?\"", "spans": [{"start": 66, "end": 79, "label": "PERSON", "text": "Blessed One's"}, {"start": 131, "end": 142, "label": "PERSON", "text": "Blessed One"}, {"start": 209, "end": 218, "label": "PERSON", "text": "Sariputta"}, {"start": 308, "end": 317, "label": "PERSON", "text": "Sariputta"}, {"start": 488, "end": 499, "label": "PERSON", "text": "Blessed One"}], "entities": [[66, 79, "PERSON"], [131, 142, "PERSON"], [209, 218, "PERSON"], [308, 317, "PERSON"], [488, 499, "PERSON"]], "meta": {}, "source": null}
{"text": "When this was said, Ven. Mahā Kaccāyana said to Soṇa Koṭikaṇṇa, \"It's hard, Soṇa, the life-long, one-meal-a-day, sleeping-alone holy life. Please, right there as you are a householder, devote yourself to the message of the Awakened Ones and to the proper-time, one-meal-a-day, sleeping-alone holy life.\" And so Soṇa Koṭikaṇṇa's idea of going-forth subsided a second time.", "spans": [{"start": 223, "end": 236, "label": "PERSON", "text": "Awakened Ones"}], "entities": [[223, 236, "PERSON"]], "meta": {}, "source": null}
{"text": "[ Udayin :] \"'Released both ways, released both ways,' it is said. To what extent is one described by the Blessed One as released both ways?\"", "spans": [{"start": 2, "end": 8, "label": "PERSON", "text": "Udayin"}, {"start": 106, "end": 117, "label": "PERSON", "text": "Blessed One"}], "entities": [[2, 8, "PERSON"], [106, 117, "PERSON"]], "meta": {}, "source": null}
{"text": "The Blessed One said: \"Householders, there are three sorts of un-Dhamma conduct, dissonant conduct with the body; four sorts of un-Dhamma conduct, dissonant conduct with speech; and three sorts of un-Dhamma conduct, dissonant conduct with the mind.", "spans": [{"start": 4, "end": 15, "label": "PERSON", "text": "Blessed One"}], "entities": [[4, 15, "PERSON"]], "meta": {}, "source": null}
{"text": "\"What do you think, householders? Don't these contemplatives & brahmans speak in direct opposition to each other?\"", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "\"The brahmans of the Western lands, lord — those who carry water pots, wear garlands of water plants, worship fire, & purify with water: they have declared purification rites of which I approve.\"", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "[Ven. Maha Kaccana:] \"The property of form, householder, is the home of consciousness. When consciousness is in bondage through passion to the property of form, it is said to be living at home. The property of feeling... perception... fabrication is the home of consciousness. When consciousness is in bondage through passion to the property of fabrication, it is said to be dwelling at home.", "spans": [{"start": 1, "end": 18, "label": "PERSON", "text": "Ven. Maha Kaccana"}], "entities": [[1, 18, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was living among the Sakyans near Kapilavatthu in the Banyan Park. Then in the early morning, having put on his robes and carrying his bowl & outer robe, he went into Kapilavatthu for alms. Having gone for alms in Kapilavatthu, after the meal, returning from his alms round, he went to the Great Wood for the day's abiding. Plunging into the Great Wood, he sat down at the root of a bilva sapling for the day's abiding.", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 71, "end": 78, "label": "NORP", "text": "Sakyans"}, {"start": 84, "end": 96, "label": "GPE", "text": "Kapilavatthu"}, {"start": 104, "end": 115, "label": "LOC", "text": "Banyan Park"}, {"start": 217, "end": 229, "label": "GPE", "text": "Kapilavatthu"}, {"start": 264, "end": 276, "label": "GPE", "text": "Kapilavatthu"}, {"start": 340, "end": 350, "label": "LOC", "text": "Great Wood"}, {"start": 392, "end": 402, "label": "LOC", "text": "Great Wood"}], "entities": [[38, 49, "PERSON"], [71, 78, "NORP"], [84, 96, "GPE"], [104, 115, "LOC"], [217, 229, "GPE"], [264, 276, "GPE"], [340, 350, "LOC"], [392, 402, "LOC"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying at Savatthi in the Eastern Monastery, the palace of Migara 's mother. Then in the evening, Ven. Ananda , coming out of seclusion, went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there, he said to the Blessed One: \"On one occasion, when the Blessed One was staying among the Sakyans in a Sakyan town named Nagaraka , there — face-to-face with the Blessed One — I heard this, face-to-face I learned this: 'I now remain fully in a dwelling of emptiness.' Did I hear that correctly, learn it correctly, attend to it correctly, remember it correctly?\"", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 65, "end": 73, "label": "GPE", "text": "Savatthi"}, {"start": 81, "end": 98, "label": "LOC", "text": "Eastern Monastery"}, {"start": 158, "end": 164, "label": "PERSON", "text": "Ananda"}, {"start": 204, "end": 215, "label": "PERSON", "text": "Blessed One"}, {"start": 316, "end": 327, "label": "PERSON", "text": "Blessed One"}, {"start": 356, "end": 367, "label": "PERSON", "text": "Blessed One"}, {"start": 390, "end": 397, "label": "NORP", "text": "Sakyans"}, {"start": 421, "end": 429, "label": "PERSON", "text": "Nagaraka"}, {"start": 462, "end": 473, "label": "PERSON", "text": "Blessed One"}], "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [81, 98, "LOC"], [158, 164, "PERSON"], [204, 215, "PERSON"], [316, 327, "PERSON"], [356, 367, "PERSON"], [390, 397, "NORP"], [421, 429, "PERSON"], [462, 473, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was living among the Bhaggas at Crocodile Haunt in the Bhesakala Grove at the Deer Park. Then the householder Nakulapita went to the Blessed One and on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the Blessed One, \"Lord, I am a feeble old man, aged, advanced in years, having come to the last stage of life. I am afflicted in body & ailing with every moment. And it is only rarely that I get to see the Blessed One & the monks who nourish the heart. May the Blessed One teach me, may the Blessed One instruct me, for my long-term benefit & happiness.\"", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 71, "end": 78, "label": "NORP", "text": "Bhaggas"}, {"start": 82, "end": 97, "label": "LOC", "text": "Crocodile Haunt"}, {"start": 105, "end": 120, "label": "LOC", "text": "Bhesakala Grove"}, {"start": 128, "end": 137, "label": "LOC", "text": "Deer Park"}, {"start": 183, "end": 194, "label": "PERSON", "text": "Blessed One"}, {"start": 293, "end": 304, "label": "PERSON", "text": "Blessed One"}, {"start": 495, "end": 506, "label": "PERSON", "text": "Blessed One"}, {"start": 550, "end": 561, "label": "PERSON", "text": "Blessed One"}, {"start": 580, "end": 591, "label": "PERSON", "text": "Blessed One"}], "entities": [[38, 49, "PERSON"], [71, 78, "NORP"], [82, 97, "LOC"], [105, 120, "LOC"], [128, 137, "LOC"], [183, 194, "PERSON"], [293, 304, "PERSON"], [495, 506, "PERSON"], [550, 561, "PERSON"], [580, 591, "PERSON"]], "meta": {}, "source": null}
{"text": "\"Householder, the Blessed One has spoken of three feelings: a feeling of pleasure, a feeling of pain, a feeling of neither pleasure nor pain. These are the three feelings the Blessed One has spoken of.\"", "spans": [{"start": 18, "end": 29, "label": "PERSON", "text": "Blessed One"}, {"start": 175, "end": 186, "label": "PERSON", "text": "Blessed One"}], "entities": [[18, 29, "PERSON"], [175, 186, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion Ven. Maha Kaccana was staying in Avanti at Osprey's Haunt, on Sheer-face Peak. Then Haliddakani the householder went to him and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to Ven. Maha Kaccana: \"Venerable sir, this was said by the Blessed One in Magandiya's Questions in the Atthaka Vagga :", "spans": [{"start": 34, "end": 51, "label": "PERSON", "text": "Ven. Maha Kaccana"}, {"start": 67, "end": 73, "label": "GPE", "text": "Avanti"}, {"start": 253, "end": 270, "label": "PERSON", "text": "Ven. Maha Kaccana"}, {"start": 309, "end": 320, "label": "PERSON", "text": "Blessed One"}], "entities": [[34, 51, "PERSON"], [67, 73, "GPE"], [253, 270, "PERSON"], [309, 320, "PERSON"]], "meta": {}, "source": null}
{"text": "\"There are some contemplatives & brahmans who hold this doctrine, hold this view: 'There is no total formlessness.' Some contemplatives & brahmans, speaking in direct opposition to those contemplatives & brahmans, say this: 'There is total formlessness.' What do you think, householders? Don't these contemplatives & brahmans speak in direct opposition to each other?\"", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "Then, soon after Nakula's father the householder had recovered from being sick, not long after his recovery from his illness, he went leaning on a stick to the Blessed One. On arrival, having bowed down to the Blessed One, he sat to one side. As he was sitting there, the Blessed One said to him, \"It is your gain, your great gain, householder, that you have Nakula's mother — sympathetic & wishing for your welfare — as your counselor & instructor. To the extent that I have white-clad householder female disciples who act fully in accordance with the precepts, she is one of them. To the extent that I have white-clad householder female disciples who attain inner tranquillity of awareness, she is one of them. To the extent that I have white-clad householder female disciples who reach firm ground in this Doctrine & Discipline, attain a firm foothold, attain consolation, overcome their doubts, dispel their perplexity, reach fearlessness, & gain independence from others with regard to the Teacher's message, she is one of them. It is your gain, your great gain, householder, that you have Nakula's mother — sympathetic & wishing for your welfare — as your counselor & instructor.\"", "spans": [{"start": 160, "end": 171, "label": "PERSON", "text": "Blessed One"}, {"start": 210, "end": 221, "label": "PERSON", "text": "Blessed One"}, {"start": 272, "end": 283, "label": "PERSON", "text": "Blessed One"}], "entities": [[160, 171, "PERSON"], [210, 221, "PERSON"], [272, 283, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying among the Angas . Now, the Angas have a town named Assapura . There the Blessed One addressed the monks, \"Monks!\"", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 72, "end": 77, "label": "NORP", "text": "Angas"}, {"start": 89, "end": 94, "label": "NORP", "text": "Angas"}, {"start": 113, "end": 121, "label": "GPE", "text": "Assapura"}, {"start": 134, "end": 145, "label": "PERSON", "text": "Blessed One"}], "entities": [[38, 49, "PERSON"], [72, 77, "NORP"], [89, 94, "NORP"], [113, 121, "GPE"], [134, 145, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying in Savatthi, at Jeta's Grove, Anathapindika's monastery . Then the wanderer Vacchagotta went to the Blessed One and, on arrival, exchanged courteous greetings with him.", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 65, "end": 73, "label": "GPE", "text": "Savatthi"}, {"start": 78, "end": 90, "label": "LOC", "text": "Jeta's Grove"}, {"start": 92, "end": 117, "label": "LOC", "text": "Anathapindika's monastery"}, {"start": 138, "end": 149, "label": "PERSON", "text": "Vacchagotta"}, {"start": 162, "end": 173, "label": "PERSON", "text": "Blessed One"}], "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [78, 90, "LOC"], [92, 117, "LOC"], [138, 149, "PERSON"], [162, 173, "PERSON"]], "meta": {}, "source": null}
{"text": "\"He [the person discussed above], hearing the Dhamma, gains conviction in the Tathāgata and reflects: 'Household life is confining, a dusty path. Life gone forth is the open air. It isn't easy, living at home, to practice the holy life totally perfect, totally pure, a polished shell. What if I, having shaved off my hair & beard and putting on the ochre robe, were to go forth from the household life into homelessness?'", "spans": [{"start": 78, "end": 87, "label": "PERSON", "text": "Tathāgata"}], "entities": [[78, 87, "PERSON"]], "meta": {}, "source": null}
{"text": "Now on that occasion the wanderers of other persuasions had come together in a gathering and were sitting, discussing many kinds of bestial topics, [1] making a great noise & racket. They saw Vajjiya Mahita the householder coming from afar, and on seeing him, hushed one another: \"Be quiet, good sirs. Don't make any noise. Here comes Vajjiya Mahita the householder, a disciple of Gotama the contemplative. He is one of those disciples of Gotama the contemplative, clad in white, who lives in Savatthi . These people are fond of quietude and speak in praise of quietude. Maybe, if he perceives our group as quiet, he will consider it worth his while to come our way.\" So the wanderers fell silent.", "spans": [{"start": 192, "end": 199, "label": "PERSON", "text": "Vajjiya"}, {"start": 335, "end": 342, "label": "PERSON", "text": "Vajjiya"}, {"start": 493, "end": 501, "label": "GPE", "text": "Savatthi"}], "entities": [[192, 199, "PERSON"], [335, 342, "PERSON"], [493, 501, "GPE"]], "meta": {}, "source": null}
{"text": "\"There is the case where the brahmans of the Western lands... get their disciples to undertake their practice thus: 'Come, now, my good man: Get up at the proper time from your bed and touch the earth. If you don't touch the earth, touch wet cow dung. If you don't touch wet cow dung, touch green grass. If you don't touch green grass, worship a fire. If you don't worship a fire, pay homage to the sun with clasped hands. If you don't pay homage to the sun with clasped hands, go down into the water three times by nightfall.' These are the purification rites declared by the brahmans of the Western lands... of which I approve.\"", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "Then Ven. Sariputta, having put on his robes and, taking his bowl & outer robe, went to the home of Anathapindika the householder with Ven. Ananda as his attendant. On arrival, he sat down on a prepared seat and said to Anathapindika the householder: \"I trust you are getting better, householder? I trust you are comfortable? I trust that your pains are lessening and not increasing? I trust that there are signs of their lessening, and not of their increasing?\"", "spans": [{"start": 10, "end": 19, "label": "PERSON", "text": "Sariputta"}, {"start": 100, "end": 113, "label": "PERSON", "text": "Anathapindika"}, {"start": 140, "end": 146, "label": "PERSON", "text": "Ananda"}, {"start": 220, "end": 233, "label": "PERSON", "text": "Anathapindika"}], "entities": [[10, 19, "PERSON"], [100, 113, "PERSON"], [140, 146, "PERSON"], [220, 233, "PERSON"]], "meta": {}, "source": null}
{"text": "When this was said, Anathapindika wept and shed tears. Then Ananda asked him, \"Are you foundering, householder, are you sinking?\"", "spans": [{"start": 20, "end": 33, "label": "PERSON", "text": "Anathapindika"}, {"start": 60, "end": 66, "label": "PERSON", "text": "Ananda"}], "entities": [[20, 33, "PERSON"], [60, 66, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika 's monastery. There he said to the monks: \"Monks, if wanderers who are members of other sects should ask you, ' What , friend, are the prerequisites for the development of the wings to self-awakening?' how would you answer them?\"", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 67, "end": 75, "label": "GPE", "text": "Savatthi"}, {"start": 79, "end": 91, "label": "LOC", "text": "Jeta's Grove"}, {"start": 93, "end": 119, "label": "LOC", "text": "Anathapindika 's monastery"}, {"start": 142, "end": 147, "label": "NORP", "text": "monks"}, {"start": 150, "end": 155, "label": "NORP", "text": "Monks"}, {"start": 160, "end": 169, "label": "NORP", "text": "wanderers"}], "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [79, 91, "LOC"], [93, 119, "LOC"], [142, 147, "NORP"], [150, 155, "NORP"], [160, 169, "NORP"]], "meta": {}, "source": null}
{"text": "\"Just now, lord, a money-lending householder died in Savatthi. I have come from conveying his heirless fortune to the royal palace: ten million in silver, to say nothing of the gold. But even though he was a money-lending householder, his enjoyment of food was like this: he ate broken rice & pickle brine. His enjoyment of clothing was like this: he wore three lengths of hempen cloth. His enjoyment of a vehicle was like this: he rode in a dilapidated little cart with an awning of leaves.\"", "spans": [{"start": 53, "end": 61, "label": "GPE", "text": "Savatthi"}], "entities": [[53, 61, "GPE"]], "meta": {}, "source": null}
{"text": "\"Herein a householder is possessed of faith, he believes in the Enlightenment of the Perfect One ( Tathagata ): Thus, indeed, is that Blessed One: he is the pure one, fully enlightened, endowed with knowledge and conduct, well-gone, the knower of worlds, the incomparable leader of men to be tamed, the teacher of gods and men, all-knowing and blessed. This is called the accomplishment of faith.", "spans": [{"start": 99, "end": 108, "label": "PERSON", "text": "Tathagata"}, {"start": 134, "end": 145, "label": "PERSON", "text": "Blessed One"}], "entities": [[99, 108, "PERSON"], [134, 145, "PERSON"]], "meta": {}, "source": null}
{"text": "A second time, Ven. Udayin said to Pañcakanga the carpenter, \"Householder, the Blessed One has not spoken of two feelings. He has spoken of three feelings...", "spans": [{"start": 15, "end": 26, "label": "PERSON", "text": "Ven. Udayin"}, {"start": 35, "end": 45, "label": "PERSON", "text": "Pañcakanga"}, {"start": 79, "end": 90, "label": "PERSON", "text": "Blessed One"}], "entities": [[15, 26, "PERSON"], [35, 45, "PERSON"], [79, 90, "PERSON"]], "meta": {}, "source": null}
{"text": "Then Ratthapala got up and, on regaining strength, went to the Blessed One. On arrival, having bowed down to him, he sat to one side. As he was sitting there, he said to the Blessed One, \"I have received my parents' permission, lord, to go forth from the household life into homelessness. May the Blessed One give me the going-forth!\"", "spans": [{"start": 63, "end": 74, "label": "PERSON", "text": "Blessed One"}, {"start": 174, "end": 185, "label": "PERSON", "text": "Blessed One"}, {"start": 297, "end": 308, "label": "PERSON", "text": "Blessed One"}], "entities": [[63, 74, "PERSON"], [174, 185, "PERSON"], [297, 308, "PERSON"]], "meta": {}, "source": null}
{"text": "Now at that time, young Sigala , a householder's son, rising early in the morning, departing from Rajagaha, with wet clothes and wet hair, worshipped with joined hands the various quarters — the East, the South, the West, the North, the Nadir, and the Zenith.", "spans": [{"start": 98, "end": 106, "label": "GPE", "text": "Rajagaha"}], "entities": [[98, 106, "GPE"]], "meta": {}, "source": null}
{"text": "\"I ask Gotama [1] of extensive wisdom this: How acting is a disciple virtuous — both the disciple who has gone from home to the homeless state and the followers who are householders? For you clearly understand the behavior [2] of the world with the devas and the final release. There is none equal to you who are skilled in seeing what is profound. You are an illustrious Awakened One (Buddha). Having investigated all knowledge and being compassionate towards beings you have announced the Dhamma, a revealer of what is hidden, of comprehensive vision, stainless, you illuminate all the worlds.", "spans": [{"start": 7, "end": 13, "label": "PERSON", "text": "Gotama"}, {"start": 372, "end": 384, "label": "PERSON", "text": "Awakened One"}], "entities": [[7, 13, "PERSON"], [372, 384, "PERSON"]], "meta": {}, "source": null}
{"text": "\"And how is there the student's undoing? A student of that teacher, imitating his teacher's seclusion, resorts to a secluded dwelling: a wilderness, the shade of a tree... a heap of straw. While he is living thus secluded, brahmans & householders from town & countryside visit him. When they visit him, he gets smitten with things that infatuate, falls into greed, and reverts to luxury. This is called a student undone with a student's undoing. He has been struck down by evil, unskillful qualities that defile, that lead to further becoming, are troublesome, ripen in pain, and lead to future birth, aging, & death. Such is the student's undoing.", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "As I understand the Dhamma taught by the Blessed One, it is just this consciousness that runs and wanders on [from birth to birth], not another. A large number of monks heard, They say that this pernicious viewpoint has arisen in the monk Sāti the Fisherman's Son: 'As I understand the Dhamma taught by the Blessed One, it is just this consciousness that runs and wanders on [from birth to birth], not another.'\" So they went to the monk Sāti the Fisherman's Son and on arrival said to him, \"Is it true, friend Sāti, that this pernicious viewpoint has arisen in you — 'As I understand the Dhamma taught by the Blessed One, it is just this consciousness that runs and wanders on, not another'?\"", "spans": [{"start": 41, "end": 52, "label": "PERSON", "text": "Blessed One"}, {"start": 239, "end": 263, "label": "PERSON", "text": "Sāti the Fisherman's Son"}, {"start": 307, "end": 318, "label": "PERSON", "text": "Blessed One"}, {"start": 438, "end": 462, "label": "PERSON", "text": "Sāti the Fisherman's Son"}, {"start": 511, "end": 515, "label": "PERSON", "text": "Sāti"}, {"start": 610, "end": 621, "label": "PERSON", "text": "Blessed One"}], "entities": [[41, 52, "PERSON"], [239, 263, "PERSON"], [307, 318, "PERSON"], [438, 462, "PERSON"], [511, 515, "PERSON"], [610, 621, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying at Nalanda in Pavarika's mango grove. Then Kevatta the householder approached the Blessed One and, on arrival, having bowed down, sat to one side. As he was sitting there he said to the Blessed One: \"Lord, this Nalanda is powerful, both prosperous and populous, filled with people who have faith in the Blessed One.\"", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 65, "end": 72, "label": "GPE", "text": "Nalanda"}, {"start": 76, "end": 98, "label": "LOC", "text": "Pavarika's mango grove"}, {"start": 105, "end": 112, "label": "PERSON", "text": "Kevatta"}, {"start": 144, "end": 155, "label": "PERSON", "text": "Blessed One"}, {"start": 248, "end": 259, "label": "PERSON", "text": "Blessed One"}, {"start": 262, "end": 266, "label": "PERSON", "text": "Lord"}, {"start": 273, "end": 280, "label": "GPE", "text": "Nalanda"}, {"start": 365, "end": 376, "label": "PERSON", "text": "Blessed One"}], "entities": [[38, 49, "PERSON"], [65, 72, "GPE"], [76, 98, "LOC"], [105, 112, "PERSON"], [144, 155, "PERSON"], [248, 259, "PERSON"], [262, 266, "PERSON"], [273, 280, "GPE"], [365, 376, "PERSON"]], "meta": {}, "source": null}
{"text": "Now at that time a large number of gamblers were playing dice not far from the Blessed One. So the householder went to them and, on arrival, said to them, \"Just now, venerable sirs, I went to Gotama the contemplative and, on arrival, having bowed down to him, sat to one side. As I was sitting there, Gotama the contemplative said to me, 'Householder, your faculties are not those of one who is steady in his own mind. There is an aberration in your faculties.'", "spans": [{"start": 79, "end": 90, "label": "PERSON", "text": "Blessed One"}, {"start": 192, "end": 198, "label": "PERSON", "text": "Gotama"}, {"start": 301, "end": 307, "label": "PERSON", "text": "Gotama"}], "entities": [[79, 90, "PERSON"], [192, 198, "PERSON"], [301, 307, "PERSON"]], "meta": {}, "source": null}
{"text": "So the brahman householders of Icchanangala, when the night was gone, taking many staple & non-staple foods, went to the gate house of the Icchanangala forest grove. On arrival they stood there making a loud racket, a great racket.", "spans": [{"start": 31, "end": 43, "label": "GPE", "text": "Icchanangala"}, {"start": 139, "end": 151, "label": "GPE", "text": "Icchanangala"}], "entities": [[31, 43, "GPE"], [139, 151, "GPE"]], "meta": {}, "source": null}
{"text": "\"Now, householder, if the thought should occur to you, 'Perhaps it was someone else who at that time was Velāma the brahman, who gave that gift, that great gift,' that's not how it should be seen. I was Velāma the brahman at that time. I gave that gift, that great gift. But in that gift there was no one worthy of offerings; no one purified that gift.", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "After an exchange of friendly greetings & courtesies, they sat to one side. As they were sitting there, they said to the Blessed One, \"Master Gotama, Purana Kassapa — all-knowing, all-seeing — claims exhaustive knowledge & vision: 'Whether I am standing or walking, awake or asleep, continual, unflagging knowledge & vision is established within me.' He says, 'I dwell with infinite knowledge, knowing & seeing the finite cosmos.' Yet Nigantha Nataputta — all-knowing, all-seeing — also claims exhaustive knowledge & vision: 'Whether I am standing or walking, awake or asleep, continual, unflagging knowledge & vision is established within me.' He says, 'I dwell with infinite knowledge, knowing & seeing the infinite cosmos.' Of these two speakers of knowledge, these two who contradict each other, which is telling the truth, and which is lying?\"", "spans": [{"start": 121, "end": 132, "label": "PERSON", "text": "Blessed One"}, {"start": 135, "end": 148, "label": "PERSON", "text": "Master Gotama"}, {"start": 150, "end": 164, "label": "PERSON", "text": "Purana Kassapa"}, {"start": 435, "end": 453, "label": "PERSON", "text": "Nigantha Nataputta"}], "entities": [[121, 132, "PERSON"], [135, 148, "PERSON"], [150, 164, "PERSON"], [435, 453, "PERSON"]], "meta": {}, "source": null}
{"text": "[ At Saavatthii ] Now the Venerable Nanda, the Blessed One's first cousin, put on well-pressed [1] robes, painted his eyes, [2] took a bright shiny bowl and went before the Blessed One. Having saluted the Blessed One he sat down to one side. As he sat there the Blessed One said: \"It is not suitable for you, Nanda, who as a young man of good family have left the household life, in faith, for homelessness, to appear in well-pressed robes, with painted eyes and a bright shiny bowl. The proper thing for you, Nanda,... is to be a forest-dweller, to go for alms in ragged robes, dwelling aloof from sense-desires.\" [ He added the verse: ]", "spans": [{"start": 5, "end": 15, "label": "GPE", "text": "Saavatthii"}, {"start": 26, "end": 41, "label": "PERSON", "text": "Venerable Nanda"}, {"start": 47, "end": 60, "label": "PERSON", "text": "Blessed One's"}, {"start": 173, "end": 184, "label": "PERSON", "text": "Blessed One"}, {"start": 205, "end": 216, "label": "PERSON", "text": "Blessed One"}, {"start": 262, "end": 273, "label": "PERSON", "text": "Blessed One"}, {"start": 309, "end": 314, "label": "PERSON", "text": "Nanda"}, {"start": 510, "end": 515, "label": "PERSON", "text": "Nanda"}], "entities": [[5, 15, "GPE"], [26, 41, "PERSON"], [47, 60, "PERSON"], [173, 184, "PERSON"], [205, 216, "PERSON"], [262, 273, "PERSON"], [309, 314, "PERSON"], [510, 515, "PERSON"]], "meta": {}, "source": null}
{"text": "\"And how is there the undoing of one who leads the holy life? There is the case where a Tathagata arises in the world,", "spans": [{"start": 88, "end": 97, "label": "PERSON", "text": "Tathagata"}], "entities": [[88, 97, "PERSON"]], "meta": {}, "source": null}
{"text": "\"Yes, it is, great king. But first, with regard to that, I will ask you a counter-question. Answer however you please. Suppose there were a man of yours: your slave, your workman, rising in the morning before you, going to bed in the evening only after you, doing whatever you order, always acting to please you, speaking politely to you, always watching for the look on your face. The thought would occur to him: 'Isn't it amazing? Isn't it astounding? — the destination, the results, of meritorious deeds. For this King Ajatasattu is a human being, and I, too, am a human being, yet King Ajatasattu enjoys himself supplied and replete with the five strings of sensuality — like a deva, as it were — while I am his slave, his workman... always watching for the look on his face. I, too, should do meritorious deeds. What if I were to shave off my hair and beard, put on the ochre robes, and go forth from the household life into homelessness?'", "spans": [{"start": 517, "end": 532, "label": "PERSON", "text": "King Ajatasattu"}, {"start": 585, "end": 600, "label": "PERSON", "text": "King Ajatasattu"}], "entities": [[517, 532, "PERSON"], [585, 600, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi, in Jeta's Grove, Anathapindika's monastery. And on that occasion Anathapindika the householder was diseased, in pain, severely ill. Then Anathapindika the householder said to one of his men, \"Come, my good man. Go to the Blessed One and, on arrival, pay homage to his feet with your head in my name and say 'Lord, Anathapindika the householder is diseased, in pain, severely ill. He pays homage with his head to the Blessed One's feet.' Then go to Ven. Sariputta and, on arrival, pay homage to his feet with your head in my name and say 'Venerable sir, Anathapindika the householder is diseased, in pain, severely ill. He pays homage with his head to your feet.' Then say: 'It would be good if Ven. Sariputta would visit Anathapindika's home, out of sympathy for him.'\"", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 67, "end": 75, "label": "GPE", "text": "Savatthi"}, {"start": 80, "end": 92, "label": "LOC", "text": "Jeta's Grove"}, {"start": 94, "end": 119, "label": "LOC", "text": "Anathapindika's monastery"}, {"start": 142, "end": 155, "label": "PERSON", "text": "Anathapindika"}, {"start": 214, "end": 227, "label": "PERSON", "text": "Anathapindika"}, {"start": 298, "end": 309, "label": "PERSON", "text": "Blessed One"}, {"start": 391, "end": 404, "label": "PERSON", "text": "Anathapindika"}, {"start": 493, "end": 506, "label": "PERSON", "text": "Blessed One's"}, {"start": 530, "end": 539, "label": "PERSON", "text": "Sariputta"}, {"start": 630, "end": 643, "label": "PERSON", "text": "Anathapindika"}, {"start": 776, "end": 785, "label": "PERSON", "text": "Sariputta"}, {"start": 798, "end": 813, "label": "PERSON", "text": "Anathapindika's"}], "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [80, 92, "LOC"], [94, 119, "LOC"], [142, 155, "PERSON"], [214, 227, "PERSON"], [298, 309, "PERSON"], [391, 404, "PERSON"], [493, 506, "PERSON"], [530, 539, "PERSON"], [630, 643, "PERSON"], [776, 785, "PERSON"], [798, 813, "PERSON"]], "meta": {}, "source": null}
{"text": "41. When this had been said, the Venerable Ananda spoke to the Blessed One, saying: \"Let it not be, Lord, that the Blessed One should pass away in this mean place, this uncivilized township in the midst of the jungle, a mere outpost of the province. There are great cities, Lord, such as Campa , Rajagaha, Savatthi , Saketa , Kosambi , and Benares — let the Blessed One have his final passing away in one of those. For in those cities dwell many wealthy nobles and brahmans and householders who are devotees of the Tathagata, and they will render due honor to the remains of the Tathagata.\"", "spans": [{"start": 33, "end": 49, "label": "PERSON", "text": "Venerable Ananda"}, {"start": 63, "end": 74, "label": "PERSON", "text": "Blessed One"}, {"start": 115, "end": 126, "label": "PERSON", "text": "Blessed One"}, {"start": 288, "end": 293, "label": "GPE", "text": "Campa"}, {"start": 296, "end": 304, "label": "GPE", "text": "Rajagaha"}, {"start": 306, "end": 314, "label": "GPE", "text": "Savatthi"}, {"start": 317, "end": 323, "label": "GPE", "text": "Saketa"}, {"start": 326, "end": 333, "label": "GPE", "text": "Kosambi"}, {"start": 340, "end": 347, "label": "GPE", "text": "Benares"}, {"start": 358, "end": 369, "label": "PERSON", "text": "Blessed One"}, {"start": 515, "end": 524, "label": "PERSON", "text": "Tathagata"}, {"start": 579, "end": 588, "label": "PERSON", "text": "Tathagata"}], "entities": [[33, 49, "PERSON"], [63, 74, "PERSON"], [115, 126, "PERSON"], [288, 293, "GPE"], [296, 304, "GPE"], [306, 314, "GPE"], [317, 323, "GPE"], [326, 333, "GPE"], [340, 347, "GPE"], [358, 369, "PERSON"], [515, 524, "PERSON"], [579, 588, "PERSON"]], "meta": {}, "source": null}
{"text": "\"You are not to be concerned about the Tathagata's funeral. Please, Ananda, strive for the true goal, be committed to the true goal, dwell heedful, ardent, & resolute for the sake of the true goal. There are wise nobles, brahmans, & householders who are highly confident in the Tathagata. They will conduct the Tathagata's funeral.\"", "spans": [{"start": 39, "end": 50, "label": "PERSON", "text": "Tathagata's"}, {"start": 68, "end": 74, "label": "PERSON", "text": "Ananda"}, {"start": 278, "end": 287, "label": "PERSON", "text": "Tathagata"}, {"start": 311, "end": 322, "label": "PERSON", "text": "Tathagata's"}], "entities": [[39, 50, "PERSON"], [68, 74, "PERSON"], [278, 287, "PERSON"], [311, 322, "PERSON"]], "meta": {}, "source": null}
{"text": ". The brahman householders of Sala went to the Blessed One; and some paid homage to the Blessed One and sat down at one side; some exchanged greetings with him, and when the courteous and amiable talk was finished, sat down at one side; some raised hands palms together in salutation to the Blessed One and sat down at one side; some pronounced their name and clan in the Blessed One's presence and sat down at one side; some kept silence and sat down at one side.", "spans": [{"start": 47, "end": 58, "label": "PERSON", "text": "Blessed One"}, {"start": 88, "end": 99, "label": "PERSON", "text": "Blessed One"}, {"start": 291, "end": 302, "label": "PERSON", "text": "Blessed One"}, {"start": 372, "end": 385, "label": "PERSON", "text": "Blessed One's"}], "entities": [[47, 58, "PERSON"], [88, 99, "PERSON"], [291, 302, "PERSON"], [372, 385, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying in Campa, on the shore of Gaggara Lake. Then Ven. Bahuna went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the Blessed One: \"Lord, freed, dissociated, & released from how many things does the Tathagata dwell with unrestricted awareness?\"", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 65, "end": 70, "label": "GPE", "text": "Campa"}, {"start": 88, "end": 100, "label": "LOC", "text": "Gaggara Lake"}, {"start": 107, "end": 118, "label": "PERSON", "text": "Ven. Bahuna"}, {"start": 131, "end": 142, "label": "PERSON", "text": "Blessed One"}, {"start": 242, "end": 253, "label": "PERSON", "text": "Blessed One"}, {"start": 256, "end": 260, "label": "PERSON", "text": "Lord"}, {"start": 323, "end": 332, "label": "PERSON", "text": "Tathagata"}], "entities": [[38, 49, "PERSON"], [65, 70, "GPE"], [88, 100, "LOC"], [107, 118, "PERSON"], [131, 142, "PERSON"], [242, 253, "PERSON"], [256, 260, "PERSON"], [323, 332, "PERSON"]], "meta": {}, "source": null}
{"text": "\"And how is there the teacher's undoing? There is the case where a certain teacher [4] resorts to a secluded dwelling: a wilderness, the shade of a tree, a mountain, a glen, a hillside cave, a charnel ground, a forest grove, the open air, a heap of straw. While he is living thus secluded, brahmans & householders from town & countryside visit him. When they visit him, he gets smitten with things that infatuate, falls into greed, and reverts to luxury. This is called a teacher undone with a teacher's undoing. He has been struck down by evil, unskillful qualities that defile, that lead to further becoming, are troublesome, ripen in pain, and lead to future birth, aging, & death. Such is the teacher's undoing. [5]", "spans": [], "entities": [], "meta": {}, "source": null}
{"text": "So the Blessed One, adjusting his under robe and — carrying his bowl & robes [1] — went together with a community of monks to the rest-house hall. On arrival he washed his feet, entered the hall, and sat with his back to the central post, facing east. The community of monks washed their feet, entered the hall, and sat with their backs to the western wall, facing east, ranged around the Blessed One.", "spans": [{"start": 7, "end": 18, "label": "PERSON", "text": "Blessed One"}, {"start": 389, "end": 400, "label": "PERSON", "text": "Blessed One"}], "entities": [[7, 18, "PERSON"], [389, 400, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying near Rajagaha in the Bamboo Grove, the Squirrels' Sanctuary. Then Ven. Maha Kassapa went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there the Blessed One said to him, \"You are now old, Kassapa. Your robes made of cast-off hemp rags are heavy for you. So wear robes donated by householders, eat invitational meals, and live close by me.\"", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 67, "end": 75, "label": "GPE", "text": "Rajagaha"}, {"start": 83, "end": 95, "label": "LOC", "text": "Bamboo Grove"}, {"start": 101, "end": 121, "label": "LOC", "text": "Squirrels' Sanctuary"}, {"start": 128, "end": 145, "label": "PERSON", "text": "Ven. Maha Kassapa"}, {"start": 158, "end": 169, "label": "PERSON", "text": "Blessed One"}, {"start": 258, "end": 269, "label": "PERSON", "text": "Blessed One"}], "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [83, 95, "LOC"], [101, 121, "LOC"], [128, 145, "PERSON"], [158, 169, "PERSON"], [258, 269, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying among the Vajjians at Bhanda Village. There he addressed the monks, \"Monks!\"", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 72, "end": 80, "label": "NORP", "text": "Vajjians"}, {"start": 84, "end": 98, "label": "GPE", "text": "Bhanda Village"}], "entities": [[38, 49, "PERSON"], [72, 80, "NORP"], [84, 98, "GPE"]], "meta": {}, "source": null}
{"text": "[ At Veluvana Soṇa the householder's son approached the Blessed One. The Buddha said: ] \"Whatever recluses and Brahmans, Soṇa, hold views about the body, which is impermanent, unsatisfactory and subject to change, such as 'I am better [than you],' 'I am equal [to you],' or 'I am worse [than you]' [ likewise 'feeling,' 'perception,' 'mental formations,' 'consciousness'], what else are they but folk who do not see things as they really are?", "spans": [{"start": 5, "end": 13, "label": "LOC", "text": "Veluvana"}, {"start": 14, "end": 18, "label": "PERSON", "text": "Soṇa"}, {"start": 56, "end": 67, "label": "PERSON", "text": "Blessed One"}, {"start": 73, "end": 79, "label": "PERSON", "text": "Buddha"}, {"start": 111, "end": 119, "label": "NORP", "text": "Brahmans"}, {"start": 121, "end": 125, "label": "PERSON", "text": "Soṇa"}], "entities": [[5, 13, "LOC"], [14, 18, "PERSON"], [56, 67, "PERSON"], [73, 79, "PERSON"], [111, 119, "NORP"], [121, 125, "PERSON"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery . Then Anathapindika the householder left Savatthi in the middle of the day to see the Blessed One, but the thought then occurred to him, \"Now is not the right time to see the Blessed One, for he is in seclusion. And it is not the right time to see the monks who are developing their minds [in meditation], for they are in seclusion. What if I were to visit the park of the wanderers of other persuasions?\" So he headed to the park of the wanderers of other persuasions.", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 67, "end": 75, "label": "GPE", "text": "Savatthi"}, {"start": 79, "end": 91, "label": "LOC", "text": "Jeta's Grove"}, {"start": 93, "end": 118, "label": "LOC", "text": "Anathapindika's monastery"}, {"start": 126, "end": 139, "label": "PERSON", "text": "Anathapindika"}, {"start": 161, "end": 169, "label": "GPE", "text": "Savatthi"}, {"start": 206, "end": 217, "label": "PERSON", "text": "Blessed One"}, {"start": 295, "end": 306, "label": "PERSON", "text": "Blessed One"}], "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [79, 91, "LOC"], [93, 118, "LOC"], [126, 139, "PERSON"], [161, 169, "GPE"], [206, 217, "PERSON"], [295, 306, "PERSON"]], "meta": {}, "source": null}
{"text": "\"Why wouldn't it have, Aggivessana? Before my Awakening, when I was still an unawakened Bodhisatta, the thought occurred to me: ' Household life is confining, a dusty path. Life gone forth is the open air. It isn't easy, living in a home, to practice the holy life totally perfect, totally pure, a polished shell. What if I, having shaved off my hair & beard and putting on the ochre robe, were to go forth from the household life into homelessness?'", "spans": [{"start": 23, "end": 34, "label": "PERSON", "text": "Aggivessana"}, {"start": 46, "end": 55, "label": "EVENT", "text": "Awakening"}], "entities": [[23, 34, "PERSON"], [46, 55, "EVENT"]], "meta": {}, "source": null}
{"text": "A second time, Ven. Ānanda replied, \"Just now, lord, the brahman householders of Thūna filled that well all the way to the brim with grass & chaff, [thinking], 'Don't let these shaven-headed contemplatives draw drinking water.'\"", "spans": [{"start": 20, "end": 26, "label": "PERSON", "text": "Ānanda"}], "entities": [[20, 26, "PERSON"]], "meta": {}, "source": null}
{"text": "Now, the result of his action in having provided alms for the Private Buddha named Tagarasikhi was that he appeared seven times in a good destination, the heavenly world. And through the remaining result of that action he acted as money-lender seven times in this very same Savatthi.", "spans": [{"start": 62, "end": 76, "label": "PERSON", "text": "Private Buddha"}, {"start": 83, "end": 94, "label": "PERSON", "text": "Tagarasikhi"}, {"start": 274, "end": 282, "label": "GPE", "text": "Savatthi"}], "entities": [[62, 76, "PERSON"], [83, 94, "PERSON"], [274, 282, "GPE"]], "meta": {}, "source": null}
{"text": "I have heard that on one occasion the Blessed One was staying in Savatthi at the Eastern Monastery, the palace of Migara's mother. Now at that time — it being the Uposatha day — Visakha, Migara's mother, went to the Blessed One in the middle of the day and, on arrival, having bowed down to him, sat to one side. As she was sitting there the Blessed One said to her, \"Well now, Visakha, why are you coming in the middle of the day?\"", "spans": [{"start": 38, "end": 49, "label": "PERSON", "text": "Blessed One"}, {"start": 65, "end": 73, "label": "GPE", "text": "Savatthi"}, {"start": 81, "end": 98, "label": "LOC", "text": "Eastern Monastery"}, {"start": 104, "end": 129, "label": "LOC", "text": "palace of Migara's mother"}, {"start": 178, "end": 185, "label": "PERSON", "text": "Visakha"}, {"start": 187, "end": 202, "label": "PERSON", "text": "Migara's mother"}, {"start": 216, "end": 227, "label": "PERSON", "text": "Blessed One"}, {"start": 342, "end": 353, "label": "PERSON", "text": "Blessed One"}, {"start": 378, "end": 385, "label": "PERSON", "text": "Visakha"}], "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [81, 98, "LOC"], [104, 129, "LOC"], [178, 185, "PERSON"], [187, 202, "PERSON"], [216, 227, "PERSON"], [342, 353, "PERSON"], [378, 385, "PERSON"]], "meta": {}, "source": null}
{"text": ". Thus have I heard. On one occasion the Blessed One was living at Rajagaha , in the Bamboo Grove, the Squirrels' Feeding Place. Now on that occasion the venerable Samiddhi was living in a forest hut.", "spans": [{"start": 41, "end": 52, "label": "PERSON", "text": "Blessed One"}, {"start": 67, "end": 75, "label": "GPE", "text": "Rajagaha"}, {"start": 85, "end": 97, "label": "LOC", "text": "Bamboo Grove"}, {"start": 103, "end": 127, "label": "LOC", "text": "Squirrels' Feeding Place"}, {"start": 154, "end": 172, "label": "PERSON", "text": "venerable Samiddhi"}], "entities": [[41, 52, "PERSON"], [67, 75, "GPE"], [85, 97, "LOC"], [103, 127, "LOC"], [154, 172, "PERSON"]], "meta": {}, "source": null}
{"text": "On that occasion Citta the householder was diseased, in pain, severely ill. Then a large number of garden devas, forest devas, tree devas, and devas inhabiting herbs, grasses, & forest giants assembled and said to him: \"Make a wish, householder: 'In the future, may I become a king, a wheel-turning monarch!'\"", "spans": [], "entities": [], "meta": {}, "source": null}
