{
  "text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery. Then Mara the Evil One went to the Blessed One and recited this verse in his presence:",
  "entities": [
    [38, 49, "PERSON"],   // Blessed One
    [67, 75, "GPE"],      // Savatthi
    [79, 91, "LOC"],      // Jeta's Grove
    [93, 106, "PERSON"],  // Anathapindika
    [93, 118, "LOC"],     // Anathapindika's monastery
    [125, 129, "PERSON"], // Mara
    [130, 142, "PERSON"], // the Evil One
    [155, 166, "PERSON"]  // Blessed One
  ],
  "meta": {
    "nikaya": "SN",
    "identifier": "sn04.008.than.html",
    "title": "Nandana Sutta",
    "para_seq": null
  }
}

{
  "text": "I have heard that on one occasion, when the Blessed One was newly Self-awakened, he was staying at Uruvela on the bank of the Nerañjara River , at the foot of the Goatherd's Banyan Tree. Then, while he was alone and in seclusion, this line of thinking arose in his awareness: \"One suffers if dwelling without reverence or deference. Now on what brahman or contemplative can I dwell in dependence, honoring and respecting him?\"",
  "entities": [
    [44, 55, "PERSON"],       // Blessed One
    [94, 102, "LOC"],         // Uruvela
    [120, 139, "LOC"],        // Nerañjara River
    [157, 187, "LOC"]         // Goatherd's Banyan Tree
  ],
  "meta": {
    "nikaya": "SN",
    "identifier": "sn06.002.than.html",
    "title": "Garava Sutta",
    "para_seq": null
  }
}
{
  "text": "This individual, I tell you, is like the warrior who — taking his sword & shield, strapping on his bow & quiver — goes down into the thick of battle. There in the battle he strives & makes effort. But while he is striving & making an effort, his opponents wound him. He gets carried out and taken to his relatives, who nurse him and care for him, but he dies of that injury. Some individuals are like this. This is the third type of warrior-like individual who can be found existing among the monks.",
  "entities": [],
  "meta": {
    "note": "NEGATIVE EXAMPLE — no named entities present",
    "nikaya": null,
    "identifier": null,
    "title": null,
    "para_seq": null
  }
}

{
  "text": "\"There are these five inhabitants of the states of deprivation, inhabitants of hell, who are in agony & incurable. Which five? One who has killed his/her mother, one who has killed his/her father, one who has killed an arahant, one who — with a corrupted mind — has caused the blood of a Tathagata to flow, and one who has caused a split in the Sangha. These are the five inhabitants of the states of deprivation, inhabitants of hell, who are in agony & incurable.\"",
  "entities": [
    [288, 297, "PERSON"],  // Tathagata
    [345, 351, "NORP"]     // Sangha
  ],
  "meta": {
    "nikaya": "AN",
    "identifier": "an05.129.than.html",
    "title": "Parikuppa Sutta",
    "para_seq": null
  }
}

{
  "text": "\"When a monk dwells in this way, then if Mara comes to him via the eye, Mara gains entry, Mara gains a foothold. If Mara comes to him via the ear... nose... tongue... body... intellect, Mara gains entry, Mara gains a foothold. Just as if there were a shack made of reeds or a shack made of grass — dry, desiccated, more than a year old — and if a man were to come to it from the east with a burning grass torch, fire would gain entry, fire would gain a foothold. If a man were to come to it from the west... north... south... from below... from above... From whatever direction the man would come to it with a burning grass torch, fire would gain entry, fire would gain a foothold. In the same way, when a monk dwells in this way, then if Mara comes to him via the eye, Mara gains entry, Mara gains a foothold. If Mara comes to him via the ear... nose... tongue... body... intellect, Mara gains entry, Mara gains a foothold.",
  "entities": [
    [41, 45, "PERSON"],
    [72, 76, "PERSON"],
    [90, 94, "PERSON"],
    [116, 120, "PERSON"],
    [186, 190, "PERSON"],
    [204, 208, "PERSON"],
    [739, 743, "PERSON"],
    [770, 774, "PERSON"],
    [788, 792, "PERSON"],
    [814, 818, "PERSON"],
    [884, 888, "PERSON"],
    [902, 906, "PERSON"]
  ],
  "meta": {
    "nikaya": "SN",
    "identifier": "sn35.202.than.html",
    "title": "Avassuta Sutta",
    "para_seq": null
  }
}

{"text": "Some of the discourses in this samyutta explore a third category of reasons for why the Buddha does not take a position on any of these questions: Such a position is based on attachment to and misunderstanding of the aggregates and sense media. When one sees these things for what they are, as they're actually present, the idea of forming them into any of these positions simply does not occur to one.", "entities": [[88, 94, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn44.intro.than.html", "title": "Introduction to the Avyakata Samyutta", "para_seq": null}}
{
  "text": "\"If he should say, 'My mind is raised above the Brahma worlds and is brought to the cessation of self-identity,' then, I tell you, Mahanama, there is no difference — in terms of release — between the release of that lay follower whose mind is released and the release of a monk whose mind is released.\"",
  "entities": [
    [35, 47, "LOC"],       // Brahma worlds
    [107, 115, "PERSON"]   // Mahanama
  ],
  "meta": {
    "nikaya": "SN",
    "identifier": "sn55.054.than.html",
    "title": "Gilana Sutta",
    "para_seq": null
  }
}

{
  "text": "I have heard that on one occasion the Blessed One was staying at Kosambi , in Ghosita's Park. Now at that time Ven. Udayin was sitting surrounded by a large assembly of householders, teaching the Dhamma. Ven. Ananda saw Ven. Udayin sitting surrounded by a large assembly of householders, teaching the Dhamma, and on seeing him went to the Blessed One. On arrival, he bowed down to the Blessed One and sat to one side. As he was sitting there he said to the Blessed One: \"Ven. Udayin, lord, is sitting surrounded by a large assembly of householders, teaching the Dhamma.\"",
  "entities": [
    [38, 49, "PERSON"],  // Blessed One
    [65, 72, "GPE"],     // Kosambi
    [78, 92, "LOC"],     // Ghosita's Park
    [209, 215, "PERSON"],// Ven. Ananda
    [339, 350, "PERSON"],// Blessed One
    [385, 396, "PERSON"],// Blessed One
    [457, 468, "PERSON"] // Blessed One
  ],
  "meta": {
    "nikaya": "AN",
    "identifier": "an05.159.than.html",
    "title": "Udayi Sutta",
    "para_seq": null
  }
}
{"text": "\"What do you think, Aggivessana? When you say, 'Feeling is my self... Perception is my self... Fabrications are my self... Consciousness is my self,' do you wield power over that consciousness: 'May my consciousness be thus, may my consciousness not be thus'?\"", "entities": [[20, 31, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.035.than.html", "title": "Cula-Saccaka Sutta", "para_seq": null}}

{
  "text": "\"Then there is the case where a monk, with the fading of rapture, he remains equanimous, mindful, & alert, and senses pleasure with the body. He enters & remains in the third jhana, of which the Noble Ones declare, 'Equanimous & mindful, he has a pleasant abiding.' Even this much is described by the Blessed One as the attaining of an opening in a confining place, though followed by a sequel. For even there there's a confining place. What is the confining place there? Just that the pleasure of equanimity has not ceased. This is the confining place there.",
  "entities": [
    [115, 127, "NORP"],   // Noble Ones
    [301, 312, "PERSON"]  // Blessed One
  ],
  "meta": {
    "nikaya": "AN",
    "identifier": "an09.042.than.html",
    "title": "Pañcala Sutta",
    "para_seq": null
  }
}
{"text":"On one occasion Ven. Sabhiya Kaccana was staying at Ñatika in the Brick Hall. Then Vacchagotta the wanderer went to him and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to Ven. Sabhiya Kaccana, \"Now then, Master Kaccana, does the Tathagata exist after death?\"","entities":[[16,36,"PERSON"],[52,58,"GPE"],[66,76,"LOC"],[83,94,"PERSON"],[287,307,"PERSON"],[320,334,"PERSON"],[345,354,"PERSON"]],"meta":{"nikaya":"SN","identifier":"sn44.011.than.html","title":"Sabhiya Sutta","para_seq":null}}

{"text": "\"Then is the cosmos finite?\"... \"Is the cosmos infinite?\"... \"Is the body the same as the soul?\"... \"Is the body one thing, and the soul another?\"... \"Does the Tathagata exist after death?\"... \"Does the Tathagata not exist after death?\"... \"Does the Tathagata both exist and not exist after death?\"... \"Does the Tathagata neither exist nor not exist after death?\"", "entities": [[160, 169, "PERSON"], [203, 212, "PERSON"], [250, 259, "PERSON"], [312, 321, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn44.007.than.html", "title": "Moggallana Sutta", "para_seq": null}}

{
  "text": "\"Once, Ven. Ananda, Master Gotama was staying near Vesali in the Peaked Roofed Pavilion in the Great Wood. I went to him at the Peaked Roofed Pavilion in the Great Wood, and there he spoke in a variety of ways on mental absorption. Master Gotama was both endowed with mental absorption & made mental absorption his habit. In fact, he praised mental absorption of every sort.\"",
  "entities": [
    [7, 18, "PERSON"],   // Ven. Ananda
    [20, 33, "PERSON"],  // Master Gotama
    [51, 57, "GPE"],     // Vesali
    [65, 87, "LOC"],     // Peaked Roofed Pavilion
    [95, 105, "LOC"],    // Great Wood
    [128, 150, "LOC"],   // Peaked Roofed Pavilion (2nd mention)
    [158, 168, "LOC"],   // Great Wood (2nd mention)
    [232, 245, "PERSON"] // Master Gotama (2nd mention)
  ],
  "meta": {
    "nikaya": "MN",
    "identifier": "mn.108.than.html",
    "title": "Gopaka Moggallana Sutta",
    "para_seq": null
  }
}
{"text": "\"It was in reference to this, great king, that the Blessed One who knows & sees, worthy & rightly self-awakened, said: 'The world is swept away. It does not endure.' Having known & seen & heard this, I went forth from the home life into homelessness.\"", "entities": [[51, 62, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.082.than.html", "title": "Ratthapala Sutta", "para_seq": null}}
{
  "text": "When the Blessed One was totally Unbound, simultaneously with the total Unbinding, some of the monks present who were not without passion wept, uplifting their arms. As if their feet were cut out from under them, they fell down and rolled back & forth, crying, \"All too soon is the Blessed One totally unbound! All too soon is the One Well-gone totally unbound! All too soon, the One with Eyes has disappeared from the world!\" But those monks who were free from passion acquiesced, mindful & alert: \"Fabrications are inconstant. What else is there to expect?\"",
  "entities": [
    [9, 20, "PERSON"],   // the Blessed One
    [108, 119, "PERSON"], // the Blessed One (second mention)
    [147, 160, "PERSON"], // the One Well-gone
    [188, 202, "PERSON"]  // the One with Eyes
  ],
  "meta": {
    "nikaya": "DN",
    "identifier": "dn.16.5-6.than.html",
    "title": "Maha-parinibbana Sutta",
    "para_seq": null
  }
}
{"text": "\"I have given this simile to convey a meaning. The meaning is this: the wound stands for the six internal sense media; the poison, for ignorance; the arrow, for craving; the probe, for mindfulness; the knife, for noble discernment; the surgeon, for the Tathagata, worthy & rightly self-awakened.", "entities": [[253, 262, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.105.than.html", "title": "Sunakkhatta Sutta", "para_seq": null}}

{
  "text": "On one occasion Ven. Sariputta and Ven. Maha Kotthita were staying near Varanasi in the Game Refuge at Isipatana. Then in the evening, Ven. Maha Kotthita emerged from his seclusion and went to Ven. Sariputta and exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to Ven. Sariputta, \"Now then, friend Sariputta, does the Tathagata exist after death?\"",
  "entities": [
    [16, 30, "PERSON"],      // Ven. Sariputta
    [35, 51, "PERSON"],      // Ven. Maha Kotthita
    [67, 75, "GPE"],         // Varanasi
    [83, 110, "LOC"],        // Game Refuge at Isipatana
    [192, 208, "PERSON"],    // Ven. Maha Kotthita
    [253, 267, "PERSON"],    // Ven. Sariputta
    [404, 418, "PERSON"],    // Ven. Sariputta
    [433, 442, "PERSON"]     // Tathagata
  ],
  "meta": {
    "nikaya": "SN",
    "identifier": "sn44.005.than.html",
    "title": "Sariputta-Kotthita Sutta",
    "para_seq": null
  }
}
{
"text": "Ven. Sariputta said, \"'Right view, right view' it is said. [1] To what extent is a disciple of the noble ones a person of right view, one whose view is made straight, who is endowed with verified confidence in the Dhamma, and who has arrived at this true Dhamma?\"", 
  "entities": [
   [0, 14, "PERSON"]
   ], 
 "meta": {"nikaya": "MN", "identifier": "mn.009.than.html", "title": "Sammaditthi Sutta", "para_seq": null}
}
{
  "text": "\"Suppose a man — in need of heartwood, seeking heartwood, wandering in search of heartwood — were to enter a forest taking a sharp ax. There he would see a large plantain trunk: straight, young, immature. He would cut it at the root and, having cut it at the root, cut off the crown. Having cut off the crown, he would unfurl the leaf sheaths. Unfurling the leaf sheaths, he wouldn't even find sapwood there, to say nothing of heartwood. In the same way, Aggivessana, when you are interrogated, rebuked, & pressed by me with regard to your own statement, you are empty, void, mistaken. But it was you who made this statement before the assembly in Vesālī: 'I see no contemplative or brahman, the head of an order, the head of a group, or even one who claims to be an arahant, rightly self-awakened, who — engaged in debate with me — would not shiver, quiver, shake, & break out in sweat under the armpits. Even if I were to engage a senseless stump in debate, it — engaged with me in debate — would shiver, quiver, & shake, to say nothing of a human being.' But now some drops of sweat coming out of your forehead, drenching your upper robe, are landing on the ground, whereas now I have no sweat on my body.\" And the Blessed One uncovered his golden-colored body to the assembly. When this was said, Saccaka the Nigaṇṭha-son fell silent, abashed, sitting with his shoulders drooping, his head down, brooding, at a loss for words.",
  "entities": [
    [177, 188, "PERSON"],
    [374, 380, "GPE"],
    [1218, 1240, "PERSON"],
    [1301, 1325, "PERSON"]
  ],
  "meta": {
    "nikaya": "MN",
    "identifier": "mn.035.than.html",
    "title": "Cula-Saccaka Sutta",
    "para_seq": null
  }
}
{"text": "\"As you say, lord,\" Ven. Ananda responded. When he had gathered in the assembly hall all the monks who lived in dependence on Vesali, he went to the Blessed One and said, \"The community of monks is gathered, lord. Now is the time to do as the Blessed One sees fit.\"", 
  "entities": [
    [25, 31, "PERSON"], 
    [126, 132, "GPE"], 
    [149, 160, "PERSON"], 
    [243, 254, "PERSON"]
   ], "meta": {"nikaya": "SN", "identifier": "sn54.009.than.html", "title": "Vesali Sutta", "para_seq": null}
  }
{"text": "\"Come now, prince. Go to Gotama the contemplative and on arrival say this: 'Lord, would the Tathagata say words that are unendearing & disagreeable to others?' If Gotama the contemplative, thus asked, answers, 'The Tathagata would say words that are unendearing & disagreeable to others,' then you should say, 'Then how is there any difference between you, lord, and run-of-the-mill people? For even run-of-the-mill people say words that are unendearing & disagreeable to others.' But if Gotama the contemplative, thus asked, answers, 'The Tathagata would not say words that are unendearing & disagreeable to others,' then you should say, 'Then how, lord, did you say of Devadatta that \"Devadatta is headed for destitution, Devadatta is headed for hell, Devadatta will boil for an eon, Devadatta is incurable\"? For Devadatta was upset & disgruntled at those words of yours.' When Gotama the contemplative is asked this two-pronged question by you, he won't be able to swallow it down or spit it up. Just as if a two-horned chestnut [1] were stuck in a man's throat: he would not be able to swallow it down or spit it up. In the same way, when Gotama the contemplative is asked this two-pronged question by you, he won't be able to swallow it down or spit it up.\"", "entities": [[25, 31, "PERSON"], [92, 101, "PERSON"], [163, 169, "PERSON"], [215, 224, "PERSON"], [488, 494, "PERSON"], [540, 549, "PERSON"], [671, 680, "PERSON"], [687, 696, "PERSON"], [724, 733, "PERSON"], [754, 763, "PERSON"], [786, 795, "PERSON"], [815, 824, "PERSON"], [880, 886, "PERSON"], [1143, 1149, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.058.than.html", "title": "Abhaya Sutta", "para_seq": null}}
{"text": "\"Not a valid question,\" the Blessed One said. \"I don't say 'craves.' If I were to say 'craves,' then 'Who craves?' would be a valid question. But I don't say that. When I don't say that, the valid question is 'From what as a requisite condition comes craving?' And the valid answer is, 'From feeling as a requisite condition comes craving. From craving as a requisite condition comes clinging/sustenance.'\"", "entities": [[28, 39, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn12.012.than.html", "title": "Phagguna Sutta", "para_seq": null}}
{"text": "\"As for Sakka , lord of the devas, he addressed the devas of the Thirty-three: 'If dear sirs, in the battle of the devas arrayed against the asuras, the devas win and the asuras are defeated, bind Vepacitti, the lord of the asuras, neck, hand, & foot and bring him before me in the righteous assembly of the devas.'", "entities": [[8, 13, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn35.207.than.html", "title": "Yavakalapi Sutta", "para_seq": null}}
{"text": "\"He/she is endowed with verified confidence in the Sangha: 'The Sangha of the Blessed One's disciples who have practiced well...who have practiced straight-forwardly...who have practiced methodically...who have practiced masterfully — in other words, the four types of noble disciples when taken as pairs, the eight when taken as individual types — they are the Sangha of the Blessed One's disciples: worthy of gifts, worthy of hospitality, worthy of offerings, worthy of respect, the incomparable field of merit for the world.'", "entities": [[78, 89, "PERSON"], [376, 387, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn55.022.than.html", "title": "Mahanama Sutta", "para_seq": null}}
{"text": "Responding, \"As you say, sir,\" Ven. Ananda in the early morning put on his robe and — carrying his bowl & outer robe — went unaccompanied into Kusinara. Now at that time the Kusinara Mallans had met for some business in their assembly hall. Ven. Ananda went to the assembly hall and on arrival announced to them, \"The Blessed One, Vasitthas, is totally unbound. Now is the time for you to do as you see fit.\"", "entities": [[36, 42, "PERSON"], [143, 151, "GPE"], [174, 182, "GPE"], [246, 252, "PERSON"], [318, 329, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}
{"text": "Ven. Udayin , too, early in the morning, having put on his robes and carrying his outer robe & bowl, went into Apana for alms. Having wandered for alms in Apana and returning from his alms round after his meal, he went to that forest grove for the day's abiding. Plunging into the grove, he sat down for his day's abiding at the root of a certain tree. Then, as he was alone in seclusion, this train of thought arose in his awareness: \"So many painful things has the Blessed One taken away from us! So many pleasant things has he brought us! So many unskillful qualities has the Blessed One taken away from us! So many skillful qualities has he brought us!\"", "entities": [[467, 478, "PERSON"], [579, 590, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.066.than.html", "title": "Latukikopama Sutta", "para_seq": null}}
{"text": "Not long after he had left, the wanderers, with sneering words, jeered at Potthapada the wanderer from all sides: \"So, whatever Gotama the contemplative says, Sir Potthapada rejoices in his every word: 'So it is, Blessed One. So it is, O One Well-gone.' But we don't understand Gotama the contemplative as having taught any categorical teaching as to whether the cosmos is infinite or the cosmos is finite or... whether after death a Tathagata neither exists nor does not exist.\"", "entities": [[74, 84, "PERSON"], [128, 134, "PERSON"], [163, 173, "PERSON"], [213, 224, "PERSON"], [278, 284, "PERSON"], [434, 443, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.09.0.than.html", "title": "Potthapada Sutta", "para_seq": null}}
{"text": "[5] \"He experiences manifold supranormal powers. Having been one he becomes many; having been many he becomes one. He appears. He vanishes. He goes unimpeded through walls, ramparts, & mountains as if through space. He dives in & out of the earth as if it were water. He walks on water without sinking as if it were dry land. Sitting crosslegged he flies through the air like a winged bird. With his hand he touches & strokes even the sun & moon, so mighty & powerful. He exercises influence with his body even as far as the Brahma worlds.", "entities": [[525, 531, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.108.than.html", "title": "Gopaka Moggallana Sutta", "para_seq": null}}
{"text": "\"Furthermore, he is endowed with verified confidence in the Dhamma: 'The Dhamma is well-expounded by the Blessed One, to be seen here & now, timeless, inviting verification, pertinent, to be realized by the wise for themselves.' This is the second pleasant mental abiding in the here & now that he has attained, for the purification of the mind that is impure, for the cleansing of the mind that is unclean.", "entities": [[105, 116, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an05.179.than.html", "title": "Gihi Sutta", "para_seq": null}}
{"text": "Now, the Blessed One heard the exchange between Ven. Ananda & Subhadda the Wanderer, and so he said to Ven. Ananda, \"Enough, Ananda. Don't stand in his way. Let him see the Tathagata. Whatever he asks me will all be for the sake of knowledge, and not to be bothersome. And whatever I answer when asked, he will quickly understand.\"", "entities": [[9, 20, "PERSON"], [53, 59, "PERSON"], [108, 114, "PERSON"], [125, 131, "PERSON"], [173, 182, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}
{"text": "The Blessed One said, \"Mindfulness of death, when developed & pursued, is of great fruit & great benefit. It gains a footing in the Deathless, has the Deathless as its final end. Therefore you should develop mindfulness of death.\"", "entities": [[4, 15, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an06.019.than.html", "title": "Maranassati Sutta", "para_seq": null}}
{"text": "The Blessed One said: \"Develop concentration, monks. A concentrated monk discerns in line with what has come into being. And what does he discern in line with what has come into being? The origination & disappearance of form. The origination & disappearance of feeling... perception... fabrications. The origination & disappearance of consciousness.", "entities": [[4, 15, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn22.005.than.html", "title": "Samadhi Sutta", "para_seq": null}}
{"text": "Then another monk addressed the Blessed One, \"I, too, develop mindfulness of death.\" ... \"I think, 'O, that I might live for the interval that it takes to swallow having chewed up one morsel of food, that I might attend to the Blessed One's instructions. I would have accomplished a great deal.' ...\"", "entities": [[32, 43, "PERSON"], [227, 238, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an06.019.than.html", "title": "Maranassati Sutta", "para_seq": null}}
{"text": "Then the thought occurred to Uppalavanna the nun: \"Now who has recited this verse — a human being or a non-human one?\" Then it occurred to her: \"This is Mara the Evil One, who has recited this verse wanting to arouse fear, horripilation, & terror in me, wanting to make me fall away from concentration.\"", "entities": [[153, 157, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn05.005.than.html", "title": "Uppalavanna Sutta", "para_seq": null}}
{"text": "\"What do you think, monks: If a person were to gather or burn or do as he likes with the grass, twigs, branches & leaves here in Jeta's Grove, would the thought occur to you, 'It's us that this person is gathering, burning, or doing with as he likes'?\"", "entities": [[32, 38, "['ĀNANDA', 'SĀRIPUTTA', 'SARIPUTTA', 'MOGGALLĀNA', 'MOGGALLANA', 'MAHĀKASSAPA', 'MAHĀKACCĀNA', 'MAHĀKACCANA', 'MAHĀKOTTHITA', 'KACCĀNA', 'MĀRA', 'BUDDHA', 'GOTAMA', 'KING PASENADI', 'VISĀKHĀ', 'PAJĀPATI', 'SUBRAHMA', 'PARAMATTA', 'TISSA', 'SANANKUMARA', 'CUNDA', 'ANURUDDHA', 'DEVADATTA', 'BRAHMA', 'SAKKA', 'BLESSED ONE', 'ACELA-KASSAPA', 'NAKED KASSAPA', 'KING PASENADI KOSALA', 'PASENADI', 'VEN. SARIPUTTA', 'DHANAÑJANIN', 'KING SENIYA BIMBISĀRA', 'BIMBISĀRA', 'TATHĀGATA', 'PURANA KASSAPA', 'AGGIVESSANA', 'SACCAKA THE NIGAṆṬHA-SON', 'LOHICCA', 'AMBAPALI', 'AJATASATTU', 'DHATARATTHA', 'VIRULHAKA', 'VIRUPAKKHA', 'KUVERA', 'SUNIDHA', 'VASSAKARA', 'TATHAGATA', 'ANATHAPINDIKA', 'RAHULA', \"SĀTI THE FISHERMAN'S SON\", 'DHAMMADINNA', 'VISAKHA', 'POTTHAPADA', 'QUEEN MALLIKA', 'MAKKHALI GOSĀLA', 'AJITA KESAKAMBALIN', 'PAKUDHA KACCĀYANA', 'SAÑJAYA VELAṬṬHAPUTTA', 'NIGAṆṬHA NĀṬAPUTTA', 'KASI BHARADVAJA', 'QUEEN VIDEHA', 'VEN. BHUMIJA', 'PUNNA MANTANIPUTTA', 'KING AJATASATTU', 'UTTARA', 'PARASIRI', 'VAJJIYA MAHITA', 'ANURADHA', 'TIGERPAW', 'MARA THE EVIL ONE', 'MASTER KACCANA', 'VEN. SONA', 'KING SENIYA BIMBISARA']"], [129, 141, "LOC"], [194, 200, "['ĀNANDA', 'SĀRIPUTTA', 'SARIPUTTA', 'MOGGALLĀNA', 'MOGGALLANA', 'MAHĀKASSAPA', 'MAHĀKACCĀNA', 'MAHĀKACCANA', 'MAHĀKOTTHITA', 'KACCĀNA', 'MĀRA', 'BUDDHA', 'GOTAMA', 'KING PASENADI', 'VISĀKHĀ', 'PAJĀPATI', 'SUBRAHMA', 'PARAMATTA', 'TISSA', 'SANANKUMARA', 'CUNDA', 'ANURUDDHA', 'DEVADATTA', 'BRAHMA', 'SAKKA', 'BLESSED ONE', 'ACELA-KASSAPA', 'NAKED KASSAPA', 'KING PASENADI KOSALA', 'PASENADI', 'VEN. SARIPUTTA', 'DHANAÑJANIN', 'KING SENIYA BIMBISĀRA', 'BIMBISĀRA', 'TATHĀGATA', 'PURANA KASSAPA', 'AGGIVESSANA', 'SACCAKA THE NIGAṆṬHA-SON', 'LOHICCA', 'AMBAPALI', 'AJATASATTU', 'DHATARATTHA', 'VIRULHAKA', 'VIRUPAKKHA', 'KUVERA', 'SUNIDHA', 'VASSAKARA', 'TATHAGATA', 'ANATHAPINDIKA', 'RAHULA', \"SĀTI THE FISHERMAN'S SON\", 'DHAMMADINNA', 'VISAKHA', 'POTTHAPADA', 'QUEEN MALLIKA', 'MAKKHALI GOSĀLA', 'AJITA KESAKAMBALIN', 'PAKUDHA KACCĀYANA', 'SAÑJAYA VELAṬṬHAPUTTA', 'NIGAṆṬHA NĀṬAPUTTA', 'KASI BHARADVAJA', 'QUEEN VIDEHA', 'VEN. BHUMIJA', 'PUNNA MANTANIPUTTA', 'KING AJATASATTU', 'UTTARA', 'PARASIRI', 'VAJJIYA MAHITA', 'ANURADHA', 'TIGERPAW', 'MARA THE EVIL ONE', 'MASTER KACCANA', 'VEN. SONA', 'KING SENIYA BIMBISARA']"]], "meta": {"nikaya": "MN", "identifier": "mn.022.than.html", "title": "Alagaddupama Sutta", "para_seq": null}}
{"text": "\"'The cosmos is eternal. Only this is true; anything otherwise is worthless,' is a viewpoint. 'The cosmos is not eternal... The cosmos is finite... The cosmos is infinite... The soul & the body are the same... The soul is one thing and the body another... After death a Tathagata exists... After death a Tathagata does not exist... After death a Tathagata both does & does not exist... After death a Tathagata neither does nor does not exist. Only this is true; anything otherwise is worthless,' is a viewpoint. The extent to which there are viewpoints, view-stances, the taking up of views, obsessions of views, the cause of views, & the uprooting of views: that's what I know. That's what I see. Knowing that, I say 'I know.' Seeing that, I say 'I see.' Why should I say 'I don't know, I don't see'? I do know. I do see.\"", "entities": [[270, 279, "PERSON"], [304, 313, "PERSON"], [346, 355, "PERSON"], [400, 409, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an10.096.than.html", "title": "Kokanuda Sutta", "para_seq": null}}
{"text": "\"Master Gotama, of these three miracles, the miracle of psychic power where a certain person wields manifold psychic powers... (and) exercises influence with his body even as far as the Brahma worlds: that is a miracle experienced only by him who does it; it belongs only to him who does it. It seems to me to be of the nature of an illusion.", "entities": [[8, 14, "PERSON"], [86, 92, "['ĀNANDA', 'SĀRIPUTTA', 'SARIPUTTA', 'MOGGALLĀNA', 'MOGGALLANA', 'MAHĀKASSAPA', 'MAHĀKACCĀNA', 'MAHĀKACCANA', 'MAHĀKOTTHITA', 'KACCĀNA', 'MĀRA', 'BUDDHA', 'GOTAMA', 'KING PASENADI', 'VISĀKHĀ', 'PAJĀPATI', 'SUBRAHMA', 'PARAMATTA', 'TISSA', 'SANANKUMARA', 'CUNDA', 'ANURUDDHA', 'DEVADATTA', 'BRAHMA', 'SAKKA', 'BLESSED ONE', 'ACELA-KASSAPA', 'NAKED KASSAPA', 'KING PASENADI KOSALA', 'PASENADI', 'VEN. SARIPUTTA', 'DHANAÑJANIN', 'KING SENIYA BIMBISĀRA', 'BIMBISĀRA', 'TATHĀGATA', 'PURANA KASSAPA', 'AGGIVESSANA', 'SACCAKA THE NIGAṆṬHA-SON', 'LOHICCA', 'AMBAPALI', 'AJATASATTU', 'DHATARATTHA', 'VIRULHAKA', 'VIRUPAKKHA', 'KUVERA', 'SUNIDHA', 'VASSAKARA', 'TATHAGATA', 'ANATHAPINDIKA', 'RAHULA', \"SĀTI THE FISHERMAN'S SON\", 'DHAMMADINNA', 'VISAKHA', 'POTTHAPADA', 'QUEEN MALLIKA', 'MAKKHALI GOSĀLA', 'AJITA KESAKAMBALIN', 'PAKUDHA KACCĀYANA', 'SAÑJAYA VELAṬṬHAPUTTA', 'NIGAṆṬHA NĀṬAPUTTA', 'KASI BHARADVAJA', 'QUEEN VIDEHA', 'VEN. BHUMIJA', 'PUNNA MANTANIPUTTA', 'KING AJATASATTU', 'UTTARA', 'PARASIRI', 'VAJJIYA MAHITA', 'ANURADHA', 'TIGERPAW', 'MARA THE EVIL ONE', 'MASTER KACCANA', 'VEN. SONA', 'KING SENIYA BIMBISARA']"], [186, 192, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an03.060.than.html", "title": "Sangarava Sutta", "para_seq": null}}
{"text": "Now at that time Ven. Maha Kassapa was traveling on the highway from Pava to Kusinara with a large community of monks, approximately 500 monks in all. Leaving the road, he sat down at the foot of a tree. Meanwhile, a certain naked ascetic, carrying a coral-tree flower from Kusinara, was traveling on the highway to Pava. Ven. Maha Kassapa saw the naked ascetic coming from afar, and on seeing him said to him, \"Do you know our teacher, friend?\"", "entities": [[77, 85, "GPE"], [274, 282, "GPE"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}
{"text": "Then the Blessed One, picking up a little bit of dust with the tip of his fingernail, said to the monks, \"What do you think, monks? Which is greater: the little bit of dust I have picked up with the tip of my fingernail, or the great earth?\"", "entities": [[9, 20, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn56.102-113.than.html", "title": "Pansu Suttas", "para_seq": null}}
{"text": "The Blessed One saw the spirit Vajirapāṇin, as did Saccaka the Nigaṇṭha-son. So Saccaka — afraid, terrified, his hair standing on end — seeking shelter in the Blessed One, seeking a cave/asylum in the Blessed One, seeking refuge in the Blessed One — said to the Blessed One, \"Let Master Gotama ask me. I will answer.\"", "entities": [[4, 15, "PERSON"], [51, 75, "PERSON"], [159, 170, "PERSON"], [201, 212, "PERSON"], [236, 247, "PERSON"], [262, 273, "PERSON"], [287, 293, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.035.than.html", "title": "Cula-Saccaka Sutta", "para_seq": null}}
{"text": "\"Then the memory of the Blessed One arose within me: 'Ah, the Blessed One! Ah, the One Well-gone — who surely is well-skilled in these matters.' The Blessed One is skilled and expert in the ultimate cessation of perception. So what, lord, is the ultimate cessation of perception?\"", "entities": [[24, 35, "PERSON"], [62, 73, "PERSON"], [149, 160, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.09.0.than.html", "title": "Potthapada Sutta", "para_seq": null}}
{"text": "At Savatthi . There the Blessed One said: \"Monks, from an inconstruable beginning comes transmigration. A beginning point is not evident, although beings hindered by ignorance and fettered by craving are transmigrating & wandering on.", "entities": [[3, 11, "GPE"], [24, 35, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn22.100.than.html", "title": "Gaddula Sutta", "para_seq": null}}
{"text": "\"It's to this extent, friend Sariputta, that a monk hears Dhamma he has not heard, that the Dhammas he has heard do not get confused, that the Dhammas he has touched with his awareness stay current, and that he understands what (previously) was not understood.\"", "entities": [[29, 38, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an06.051.than.html", "title": "Ananda Sutta", "para_seq": null}}
{"text": "\"Yes, lord, wouldn't one be totally destroyed if the Tathagata doesn't regard one as being worth speaking to or admonishing, and one's knowledgeable fellows in the holy life don't regard one as being worth speaking to or admonishing!", "entities": [[53, 62, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an04.111.than.html", "title": "Kesi Sutta", "para_seq": null}}
{"text": "When this was said, Prince Abhaya said to the Blessed One: \" Magnificent , lord! Magnificent! Just as if he were to place upright what was overturned, to reveal what was hidden, to show the way to one who was lost, or to carry a lamp into the dark so that those with eyes could see forms, in the same way has the Blessed One — through many lines of reasoning — made the Dhamma clear. I go to the Blessed One for refuge, to the Dhamma, and to the Sangha of monks. May the Blessed One remember me as a lay follower who has gone to him for refuge, from this day forward, for life.\"", "entities": [[46, 57, "PERSON"], [313, 324, "PERSON"], [396, 407, "PERSON"], [471, 482, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.058.than.html", "title": "Abhaya Sutta", "para_seq": null}}
{"text": "\"When a disciple of the noble ones is endowed with these seven true qualities and can obtain at will — without difficulty, without trouble — these four jhanas, heightened mental states that provide a pleasant abiding in the here-&-now, he is said to be a disciple of the noble ones who can't be undone by Mara, can't be undone by the Evil One.\"", "entities": [[305, 309, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an07.063.than.html", "title": "Nagara Sutta", "para_seq": null}}
{"text": "The Blessed One said, \"If wanderers who are members of other sects should ask you, 'What, friend, are the prerequisites for the development of the wings to self-awakening?' you should answer, ' There is the case where a monk has admirable friends, admirable companions, admirable comrades. This is the first prerequisite for the development of the wings to self-awakening.", "entities": [[4, 15, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an09.001.than.html", "title": "Sambodhi Sutta", "para_seq": null}}
{"text": "On one occasion Ven. Sariputta was staying in Magadha in Nalaka Village . Then Jambukhadika the wanderer went to Ven. Sariputta and, on arrival, exchanged courteous greetings with him. After this exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there he said to Ven. Sariputta: \"'Stress, stress,' it is said, my friend Sariputta. Which type of stress [are they referring to]?\"", "entities": [[16, 30, "PERSON"], [46, 53, "GPE"], [113, 127, "PERSON"], [296, 310, "PERSON"], [353, 362, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn38.014.than.html", "title": "Dukkha Sutta", "para_seq": null}}
{"text": "\"With his mind thus concentrated, purified, & bright, unblemished, free from defects, pliant, malleable, steady, & attained to imperturbability, he directs & inclines it to knowledge of the awareness of other beings. He knows the awareness of other beings, other individuals, having encompassed it with his own awareness. He discerns a mind with passion as a mind with passion, and a mind without passion as a mind without passion. He discerns a mind with aversion as a mind with aversion, and a mind without aversion as a mind without aversion. He discerns a mind with delusion as a mind with delusion, and a mind without delusion as a mind without delusion. He discerns a restricted mind as a restricted mind, and a scattered mind as a scattered mind. He discerns an enlarged mind as an enlarged mind, and an unenlarged mind as an unenlarged mind. He discerns an excelled mind [one that is not at the most excellent level] as an excelled mind, and an unexcelled mind as an unexcelled mind. He discerns a concentrated mind as a concentrated mind, and an unconcentrated mind as an unconcentrated mind. He discerns a released mind as a released mind, and an unreleased mind as an unreleased mind. Just as if a young woman — or man — fond of ornaments, examining the reflection of her own face in a bright mirror or a bowl of clear water would know 'blemished' if it were blemished, or 'unblemished' if it were not. In the same way — with his mind thus concentrated, purified, & bright, unblemished, free from defects, pliant, malleable, steady, & attained to imperturbability — the monk directs & inclines it to knowledge of the awareness of other beings. He knows the awareness of other beings, other individuals, having encompassed it with his own awareness. He discerns a mind with passion as a mind with passion, and a mind without passion as a mind without passion... a released mind as a released mind, and an unreleased mind as an unreleased mind. When a disciple of a teacher attains this sort of grand distinction, Lohicca, that is a teacher not worthy of criticism in the world, and if anyone were to criticize this sort of teacher, the criticism would be false, unfactual, unrighteous, & blameworthy.", "entities": [[2023, 2030, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.12.0.than.html", "title": "Lohicca Sutta", "para_seq": null}}
{"text": "Then Anathapindika the householder went to the Blessed One and, on arrival, having bowed to him, sat to one side. As he was sitting there, the Blessed One said to him: \"Householder, when the mind is unprotected, bodily actions are unprotected as well, verbal actions are unprotected as well, mental actions are unprotected as well. When one's bodily actions, verbal actions, & mental actions are unprotected, one's bodily actions get soggy, one's verbal actions get soggy, one's mental actions get soggy. When one's bodily actions, verbal actions, & mental actions are soggy, one's bodily actions... verbal actions... mental actions rot. When one's bodily actions, verbal actions, & mental actions rot, one's death is not auspicious, the mode of one's dying not good.", "entities": [[5, 18, "PERSON"], [47, 58, "PERSON"], [143, 154, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an03.105.than.html", "title": "Kuta Sutta", "para_seq": null}}
{"text": "When this was said, Kassapa the clothless ascetic said, \"Magnificent, lord! Magnificent! Just as if he were to place upright what was overturned, to reveal what was hidden, to show the way to one who was lost, or to carry a lamp into the dark so that those with eyes could see forms, in the same way has the Blessed One — through many lines of reasoning — made the Dhamma clear. I go to the Blessed One for refuge, to the Dhamma, and to the community of monks. Let me obtain the going forth in the Blessed One's presence, let me obtain admission.\"", "entities": [[308, 319, "PERSON"], [391, 402, "PERSON"], [498, 509, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn12.017.than.html", "title": "Acela Sutta", "para_seq": null}}
{"text": "The Blessed One said, \"Monks, if those who have gone forth in other sects ask you, 'In what are all phenomena rooted? What is their coming into play? What is their origination? What is their meeting place? What is their presiding state? What is their governing principle? What is their surpassing state? What is their heartwood? Where do they gain a footing? What is their final end?': On being asked this by those who have gone forth in other sects, this is how you should answer them:", "entities": [[4, 15, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an10.058.than.html", "title": "Mula Sutta", "para_seq": null}}
{"text": "Then the thought occurred to the Blessed One: \"It is out of dedication to me that this clansman has gone forth. What if I were to teach him the Dhamma?\" So he said to Ven. Pukkusati, \"I will teach you the Dhamma, monk. Listen & pay close attention. I will speak.\"", "entities": [[33, 44, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.140.than.html", "title": "Dhatu-vibhanga Sutta", "para_seq": null}}
{"text": "Saying \"Good, friend,\" having delighted in and approved of Ven. Sariputta's words, the monks asked him a further question: \"Would there be another line of reasoning by which a disciple of the noble ones is a person of right view... who has arrived at this true Dhamma?\"", "entities": [[59, 73, "PERSON"], [208, 214, "['ĀNANDA', 'SĀRIPUTTA', 'SARIPUTTA', 'MOGGALLĀNA', 'MOGGALLANA', 'MAHĀKASSAPA', 'MAHĀKACCĀNA', 'MAHĀKACCANA', 'MAHĀKOTTHITA', 'KACCĀNA', 'MĀRA', 'BUDDHA', 'GOTAMA', 'KING PASENADI', 'VISĀKHĀ', 'PAJĀPATI', 'SUBRAHMA', 'PARAMATTA', 'TISSA', 'SANANKUMARA', 'CUNDA', 'ANURUDDHA', 'DEVADATTA', 'BRAHMA', 'SAKKA', 'BLESSED ONE', 'ACELA-KASSAPA', 'NAKED KASSAPA', 'KING PASENADI KOSALA', 'PASENADI', 'VEN. SARIPUTTA', 'DHANAÑJANIN', 'KING SENIYA BIMBISĀRA', 'BIMBISĀRA', 'TATHĀGATA', 'PURANA KASSAPA', 'AGGIVESSANA', 'SACCAKA THE NIGAṆṬHA-SON', 'LOHICCA', 'AMBAPALI', 'AJATASATTU', 'DHATARATTHA', 'VIRULHAKA', 'VIRUPAKKHA', 'KUVERA', 'SUNIDHA', 'VASSAKARA', 'TATHAGATA', 'ANATHAPINDIKA', 'RAHULA', \"SĀTI THE FISHERMAN'S SON\", 'DHAMMADINNA', 'VISAKHA', 'POTTHAPADA', 'QUEEN MALLIKA', 'MAKKHALI GOSĀLA', 'AJITA KESAKAMBALIN', 'PAKUDHA KACCĀYANA', 'SAÑJAYA VELAṬṬHAPUTTA', 'NIGAṆṬHA NĀṬAPUTTA', 'KASI BHARADVAJA', 'QUEEN VIDEHA', 'VEN. BHUMIJA', 'PUNNA MANTANIPUTTA', 'KING AJATASATTU', 'UTTARA', 'PARASIRI', 'VAJJIYA MAHITA', 'ANURADHA', 'TIGERPAW', 'MARA THE EVIL ONE', 'MASTER KACCANA', 'VEN. SONA', 'KING SENIYA BIMBISARA']"]], "meta": {"nikaya": "MN", "identifier": "mn.009.than.html", "title": "Sammaditthi Sutta", "para_seq": null}}
{"text": "Then two or three days later, Citta the elephant trainer's son and Potthapada the wanderer went to the Blessed One. On their arrival, Citta bowed down to the Blessed One and sat to one side, while Potthapada the wanderer greeted the Blessed One courteously. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to the Blessed One: \"The other day, not long after the Blessed One had left, the wanderers, with sneering words, jeered at me from all sides: 'So, whatever Gotama the contemplative says, Sir Potthapada rejoices in his every word: \"So it is, Blessed One. So it is, O One Well-gone.\" But we don't understand Gotama the contemplative as having taught any categorical teaching as to whether the cosmos is infinite or the cosmos is finite or... whether after death a Tathagata neither exists nor does not exist.'", "entities": [[67, 77, "PERSON"], [103, 114, "PERSON"], [158, 169, "PERSON"], [197, 207, "PERSON"], [233, 244, "PERSON"], [372, 383, "PERSON"], [420, 431, "PERSON"], [521, 527, "PERSON"], [556, 566, "PERSON"], [606, 617, "PERSON"], [671, 677, "PERSON"], [827, 836, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.09.0.than.html", "title": "Potthapada Sutta", "para_seq": null}}
{"text": "\"When this was said, Makkhali Gosala said to me, 'Great king, there is no cause, no requisite condition, for the defilement of beings. Beings are defiled without cause, without requisite condition. There is no cause, no requisite condition, for the purification of beings. Beings are purified without cause, without requisite condition. There is nothing self-caused, nothing other-caused, nothing human-caused. There is no strength, no effort, no human energy, no human endeavor. All living beings, all life, all beings, all souls are powerless, devoid of strength, devoid of effort. Subject to the changes of fate, serendipity, and nature, they are sensitive to pleasure and pain in the six great classes of birth.", "entities": [[21, 36, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.02.0.than.html", "title": "Samaññaphala Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying among the Sakyans near Kapilavatthu in Nigrodha's Park. Then Mahanama the Sakyan went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there, he said to the Blessed One, \"Lord, this Kapilavatthu is rich & prosperous, populous & crowded, its alleys congested. Sometimes, when I enter Kapilavatthu in the evening after visiting with the Blessed One or with the monks who inspire the mind, I meet up with a runaway elephant, a runaway horse, a runaway chariot, a runaway cart, or a runaway person. At times like that my mindfulness with regard to the Blessed One gets muddled, my mindfulness with regard to the Dhamma... the Sangha gets muddled. The thought occurs to me, 'If I were to die at this moment, what would be my destination? What would be my future course?\"", "entities": [[38, 49, "PERSON"], [85, 97, "GPE"], [155, 166, "PERSON"], [267, 278, "PERSON"], [292, 304, "GPE"], [393, 405, "GPE"], [445, 456, "PERSON"], [597, 603, "['ĀNANDA', 'SĀRIPUTTA', 'SARIPUTTA', 'MOGGALLĀNA', 'MOGGALLANA', 'MAHĀKASSAPA', 'MAHĀKACCĀNA', 'MAHĀKACCANA', 'MAHĀKOTTHITA', 'KACCĀNA', 'MĀRA', 'BUDDHA', 'GOTAMA', 'KING PASENADI', 'VISĀKHĀ', 'PAJĀPATI', 'SUBRAHMA', 'PARAMATTA', 'TISSA', 'SANANKUMARA', 'CUNDA', 'ANURUDDHA', 'DEVADATTA', 'BRAHMA', 'SAKKA', 'BLESSED ONE', 'ACELA-KASSAPA', 'NAKED KASSAPA', 'KING PASENADI KOSALA', 'PASENADI', 'VEN. SARIPUTTA', 'DHANAÑJANIN', 'KING SENIYA BIMBISĀRA', 'BIMBISĀRA', 'TATHĀGATA', 'PURANA KASSAPA', 'AGGIVESSANA', 'SACCAKA THE NIGAṆṬHA-SON', 'LOHICCA', 'AMBAPALI', 'AJATASATTU', 'DHATARATTHA', 'VIRULHAKA', 'VIRUPAKKHA', 'KUVERA', 'SUNIDHA', 'VASSAKARA', 'TATHAGATA', 'ANATHAPINDIKA', 'RAHULA', \"SĀTI THE FISHERMAN'S SON\", 'DHAMMADINNA', 'VISAKHA', 'POTTHAPADA', 'QUEEN MALLIKA', 'MAKKHALI GOSĀLA', 'AJITA KESAKAMBALIN', 'PAKUDHA KACCĀYANA', 'SAÑJAYA VELAṬṬHAPUTTA', 'NIGAṆṬHA NĀṬAPUTTA', 'KASI BHARADVAJA', 'QUEEN VIDEHA', 'VEN. BHUMIJA', 'PUNNA MANTANIPUTTA', 'KING AJATASATTU', 'UTTARA', 'PARASIRI', 'VAJJIYA MAHITA', 'ANURADHA', 'TIGERPAW', 'MARA THE EVIL ONE', 'MASTER KACCANA', 'VEN. SONA', 'KING SENIYA BIMBISARA']"], [658, 669, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn55.021.than.html", "title": "Mahanama Sutta", "para_seq": null}}
{"text": "\"Yes, madam,\" the brahman Nalijangha responded to Queen Mallika. Going to the Blessed One, on arrival he exchanged courteous greetings with the Blessed One. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there he said to the Blessed One: \"Master Gotama, Queen Mallika shows reverence with her head to your feet and asks whether you are free from illness & affliction, are carefree, strong, & living in comfort. And she says further: 'Lord, did the Blessed One say that sorrow, lamentation, pain, distress, & despair are born from one who is dear, come springing from one who is dear?'\"", "entities": [[50, 63, "PERSON"], [78, 89, "PERSON"], [144, 155, "PERSON"], [270, 281, "PERSON"], [291, 297, "PERSON"], [299, 312, "PERSON"], [493, 504, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.087.than.html", "title": "Piyajatika Sutta", "para_seq": null}}
{"text": "When those monks could not pry Ven. Yamaka loose from his evil supposition, they got up from their seats and went to Ven. Sariputta. On arrival they said to him: \"Friend Sariputta, this evil supposition has arisen to Ven. Yamaka: 'As I understand the Teaching explained by the Blessed One, a monk with no more effluents, on the break-up of the body, is annihilated, perishes, & does not exist after death.' It would be good if you would go to Ven. Yamaka out of sympathy for his sake.\"", "entities": [[117, 131, "PERSON"], [170, 179, "PERSON"], [277, 288, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn22.085.than.html", "title": "Yamaka Sutta", "para_seq": null}}
{"text": "\"He/she is endowed with verified confidence in the Dhamma: 'The Dhamma is well-expounded by the Blessed One, to be seen here & now, timeless, inviting verification, pertinent, to be realized by the wise for themselves.'", "entities": [[96, 107, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn55.030.than.html", "title": "Licchavi Sutta", "para_seq": null}}
{"text": "The Licchavis of Vesali heard, \"The Blessed One, they say, has been totally unbound in Kusinara.\" So they sent an envoy to the Kusinara Mallans: \"The Blessed One was a noble warrior. We, too, are noble warriors. We deserve a share of the Blessed One's bone-relics. We, too, will build a burial mound and hold a ceremony for them.\"", "entities": [[4, 13, "NORP"], [17, 23, "GPE"], [36, 47, "PERSON"], [87, 95, "GPE"], [127, 135, "GPE"], [150, 161, "PERSON"], [238, 249, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}
{"text": "\" Venerable sir , concerning the various views that arise in the world — 'The cosmos is eternal' or 'The cosmos isn't eternal'; 'The cosmos is finite' or 'The cosmos is infinite'; 'The soul and the body are the same' or 'The soul is one thing, the body another'; 'A Tathagata exists after death' or 'A Tathagata doesn't exist after death' or 'A Tathagata both exists & doesn't exist after death' or 'A Tathagata neither exists nor doesn't exist after death'; these along with the sixty-two views mentioned in the Brahmajala [1] — when what is present do these views come into being, and when what is absent do they not come into being?\"", "entities": [[266, 275, "PERSON"], [302, 311, "PERSON"], [345, 354, "PERSON"], [402, 411, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn41.003.than.html", "title": "Isidatta Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion, when the Blessed One was on a wandering tour among the Kosalans with a large community of monks, he arrived at the brahman village called Sala . The brahman householders heard, \"Master Gotama the contemplative — the son of the Sakyans, having gone forth from the Sakyan clan — on a wandering tour among the Kosalans with a large community of monks — has arrived at Sala. And of that master Gotama this fine reputation has spread: 'He is indeed a Blessed One, an arahant, rightly self-awakened: consummate in knowledge & conduct, well-gone, a knower of the cosmos, an unexcelled trainer of those persons ready to be tamed, teacher of human & divine beings, awakened, blessed. He has made known — having realized it through direct knowledge — this world with its devas, maras, & brahmas, its generations with their contemplatives & brahmans, their rulers & common people. He has explained the Dhamma admirable in the beginning, admirable in the middle, admirable in the end; has expounded the holy life both in its particulars & in its essence, entirely perfect, surpassingly pure. It is good to see such a worthy one.'\"", "entities": [[44, 55, "PERSON"], [220, 226, "PERSON"], [425, 431, "PERSON"], [481, 492, "PERSON"], [630, 636, "['ĀNANDA', 'SĀRIPUTTA', 'SARIPUTTA', 'MOGGALLĀNA', 'MOGGALLANA', 'MAHĀKASSAPA', 'MAHĀKACCĀNA', 'MAHĀKACCANA', 'MAHĀKOTTHITA', 'KACCĀNA', 'MĀRA', 'BUDDHA', 'GOTAMA', 'KING PASENADI', 'VISĀKHĀ', 'PAJĀPATI', 'SUBRAHMA', 'PARAMATTA', 'TISSA', 'SANANKUMARA', 'CUNDA', 'ANURUDDHA', 'DEVADATTA', 'BRAHMA', 'SAKKA', 'BLESSED ONE', 'ACELA-KASSAPA', 'NAKED KASSAPA', 'KING PASENADI KOSALA', 'PASENADI', 'VEN. SARIPUTTA', 'DHANAÑJANIN', 'KING SENIYA BIMBISĀRA', 'BIMBISĀRA', 'TATHĀGATA', 'PURANA KASSAPA', 'AGGIVESSANA', 'SACCAKA THE NIGAṆṬHA-SON', 'LOHICCA', 'AMBAPALI', 'AJATASATTU', 'DHATARATTHA', 'VIRULHAKA', 'VIRUPAKKHA', 'KUVERA', 'SUNIDHA', 'VASSAKARA', 'TATHAGATA', 'ANATHAPINDIKA', 'RAHULA', \"SĀTI THE FISHERMAN'S SON\", 'DHAMMADINNA', 'VISAKHA', 'POTTHAPADA', 'QUEEN MALLIKA', 'MAKKHALI GOSĀLA', 'AJITA KESAKAMBALIN', 'PAKUDHA KACCĀYANA', 'SAÑJAYA VELAṬṬHAPUTTA', 'NIGAṆṬHA NĀṬAPUTTA', 'KASI BHARADVAJA', 'QUEEN VIDEHA', 'VEN. BHUMIJA', 'PUNNA MANTANIPUTTA', 'KING AJATASATTU', 'UTTARA', 'PARASIRI', 'VAJJIYA MAHITA', 'ANURADHA', 'TIGERPAW', 'MARA THE EVIL ONE', 'MASTER KACCANA', 'VEN. SONA', 'KING SENIYA BIMBISARA']"]], "meta": {"nikaya": "MN", "identifier": "mn.060.than.html", "title": "Apannaka  Sutta", "para_seq": null}}
{"text": "The Blessed One said: \"Monks, whatever in the cosmos — with its devas, Maras, & Brahmas, its generations with their contemplatives & brahmans royalty & common people — is seen, heard, sensed, cognized, attained, sought after, pondered by the intellect: That do I know. Whatever in the cosmos — with its devas, Maras, & Brahmas, its generations with their contemplatives & brahmans, their royalty & common people — is seen, heard, sensed, cognized, attained, sought after, pondered by the intellect: That I directly know. That has been realized by the Tathagata, but in the Tathagata [1] it has not been established. [2]", "entities": [[4, 15, "PERSON"], [71, 76, "NORP"], [80, 87, "NORP"], [310, 315, "NORP"], [319, 326, "NORP"], [551, 560, "PERSON"], [573, 582, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an04.024.than.html", "title": "Kalaka Sutta", "para_seq": null}}
{"text": "\"There is the case, Aggivessana, where a disciple of mine sees with right discernment any form whatsoever — past, future, or present; internal or external; blatant or subtle; common or sublime; far or near: every form as it has come to be — as 'This is not mine. This is not my self. This is not what I am.'", "entities": [[20, 31, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.035.than.html", "title": "Cula-Saccaka Sutta", "para_seq": null}}
{"text": "And so the Blessed One, encompassing Kapadika's awareness with his awareness, met his gaze. Kapadika thought, \"Gotama the contemplative has turned to me. Suppose I ask him a question.\" So he said to the Blessed One, \"Master Gotama, with regard to the ancient hymns of the brahmans — passed down through oral transmission & included in their canon — the brahmans have come to the definite conclusion that \"Only this is true; anything else is worthless.\" What does Master Gotama have to say to this?\"", "entities": [[11, 22, "PERSON"], [111, 117, "PERSON"], [203, 214, "PERSON"], [224, 230, "PERSON"], [470, 476, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.095x.than.html", "title": "Canki Sutta", "para_seq": null}}
{"text": "\"Then is the cosmos finite?\"... \"Is the cosmos infinite?\"... \"Is the body the same as the soul?\"... \"Is the body one thing, and the soul another?\"... \"Does the Tathagata exist after death?\"... \"Does the Tathagata not exist after death?\"... \"Does the Tathagata both exist and not exist after death?\"... \"Does the Tathagata neither exist nor not exist after death?\"", "entities": [[160, 169, "PERSON"], [203, 212, "PERSON"], [250, 259, "PERSON"], [312, 321, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn44.008.than.html", "title": "Vacchagotta Sutta", "para_seq": null}}
{"text": "On one occasion the Blessed One was staying among the Sakyans at Kapilavatthu in the Banyan Park. Then, after having dismissed the community of monks over a particular incident, he early in the morning put on his robes and, carrying his bowl and outer robe, went into Kapilavatthu for alms. After having gone for alms in Kapilavatthu, after his meal, returning from his almsround, he went to the Great Forest for the day's abiding. Plunging into the Great Forest, he sat down at the root of a beluva sapling as his day's abiding.", "entities": [[20, 31, "PERSON"], [65, 77, "GPE"], [268, 280, "GPE"], [321, 333, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn22.080.than.html", "title": "Pindolya Sutta", "para_seq": null}}
{"text": "While this explanation was being given, there arose to Sakka the dustless, stainless Dhamma eye — \"Whatever is subject to origination is all subject to cessation\" — as it also did to [his following of] 80,000 other devas.", "entities": [[55, 60, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.21.2x.than.html", "title": "Sakka-pañha Sutta", "para_seq": null}}
{"text": "At Savatthi. \"For a monk practicing the Dhamma in accordance with the Dhamma, what accords with the Dhamma is this: that he keep focused on stress with regard to form, that he keep focused on stress with regard to feeling, that he keep focused on stress with regard to perception, that he keep focused on stress with regard to fabrications, that he keep focused on stress with regard to consciousness. As he keeps focusing on stress with regard to form... feeling... perception... fabrications... consciousness, he comprehends form... feeling... perception... fabrications... consciousness. As he comprehends form... feeling... perception... fabrications... consciousness, he is totally released from form... feeling... perception... fabrications... consciousness. He is totally released from sorrows, lamentations, pains, distresses, & despairs. He is totally released, I tell you, from suffering & stress.\"", "entities": [[3, 11, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn22.041.than.html", "title": "Anudhamma Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Rajagaha in the Cool Grove. Now at that time Anathapindika the householder had arrived in Rajagaha on some business. He heard, \"An Awakened One, they say, has appeared in the world,\" and he wanted to go right then to see the Blessed One. Then the thought occurred to him, \"Today is not the proper time to go to see the Blessed One. Tomorrow I will go to see the Blessed One at the proper time.\" With his mindfulness immersed in the Awakened One he lay down to sleep. Three times he got up during the night, thinking it was light. Then he went to the gate to the charnel ground. Non-human beings opened the gate.", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [112, 125, "PERSON"], [157, 165, "GPE"], [292, 303, "PERSON"], [386, 397, "PERSON"], [429, 440, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn10.008.than.html", "title": "Sudatta Sutta", "para_seq": null}}
{"text": "\"Excellent, Sariputta. Excellent. Those who have not known, seen, penetrated, realized, or attained it by means of discernment would have to take it on conviction in others that the faculty of conviction... persistence... mindfulness... concentration... discernment, when developed & pursued, gains a footing in the Deathless, has the Deathless as its goal & consummation; whereas those who have known, seen, penetrated, realized, & attained it by means of discernment would have no doubt or uncertainty that the faculty of conviction... persistence... mindfulness... concentration... discernment, when developed & pursued, gains a footing in the Deathless, has the Deathless as its goal & consummation.\"", "entities": [[12, 21, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn48.044.than.html", "title": "Pubbakotthaka Sutta", "para_seq": null}}
{"text": "\"For us, lord, the teachings have the Blessed One as their root, their guide, & their arbitrator. It would be good if the Blessed One himself would explicate the meaning of this statement. Having heard it from the Blessed One, the monks will remember it.\"", "entities": [[38, 49, "PERSON"], [122, 133, "PERSON"], [214, 225, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn22.058.than.html", "title": "Buddha Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Vesali in the Great Wood, at the Gabled Hall. Now on that occasion the Blessed One, with many lines of reasoning, was giving the monks a talk on the unattractiveness [of the body], was speaking in praise of [the perception of] unattractiveness, was speaking in praise of the development of [the perception of] unattractiveness. Then the Blessed One addressed the monks: \"Monks, I wish to go into seclusion for half a month. I am not to be approached by anyone at all except for the one who brings almsfood.\"", "entities": [[38, 49, "PERSON"], [67, 73, "GPE"], [138, 149, "PERSON"], [404, 415, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn54.009.than.html", "title": "Vesali Sutta", "para_seq": null}}
