{
  "text": "With that, some of the monks present who were not without passion wept, uplifting their arms. As if their feet were cut out from under them, they fell down and rolled back & forth, crying, \"All too soon is the Blessed One totally unbound! All too soon is the One Well-gone totally unbound! All too soon, the One with Eyes has disappeared from the world!\" But those monks who were free from passion acquiesced, mindful & alert: \"Fabrications are inconstant. What else is there to expect?\"",
  "entities": [
    [210, 221, "PERSON"],  // Blessed One
    [246, 258, "PERSON"],  // One Well-gone
    [286, 298, "PERSON"]   // One with Eyes
  ],
  "meta": {
    "nikaya": "DN",
    "identifier": "dn.16.5-6.than.html",
    "title": "Maha-parinibbana Sutta",
    "para_seq": null
  }
}

{
  "text": "Then early in the morning Ven. Assaji [2] adjusted his under robe and — carrying his bowl & robes — went into Vesālī for alms. Saccaka the Nigaṇṭha-son, walking & wandering around Vesālī to exercise his legs, saw Ven. Assaji coming from afar. On seeing him, he went up to him and exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he stood to one side. As he was standing there, he said to him, \"Master Assaji, how does Gotama the contemplative discipline his disciples? Or what part of his instruction is generally presented to his disciples?\"",
  "entities": [
    [27, 39, "PERSON"],   // Ven. Assaji
    [110, 116, "GPE"],    // Vesālī
    [127, 151, "PERSON"], // Saccaka the Nigaṇṭha-son
    [180, 186, "GPE"],    // Vesālī
    [191, 203, "PERSON"], // Ven. Assaji
    [463, 475, "PERSON"], // Master Assaji
    [486, 492, "PERSON"]  // Gotama
  ],
  "meta": {
    "nikaya": "MN",
    "identifier": "mn.035.than.html",
    "title": "Cula-Saccaka Sutta",
    "para_seq": null
  }
}
{
  "text": "Ven. Mahā Moggallāna said, \"Friends, once as I was withdrawn in seclusion, this train of thought arose to my awareness, '\"Noble silence, noble silence,\" it is said. But what is noble silence?' Then the thought occurred to me, 'There is the case where a monk, with the stilling of directed thoughts & evaluations, [1] enters & remains in the second jhāna: rapture & pleasure born of concentration, unification of awareness free from directed thought & evaluation — internal assurance. This is called noble silence.' So, with the stilling of directed thoughts & evaluations, I entered & remained in the second jhāna: rapture & pleasure born of concentration, unification of awareness free from directed thought & evaluation — internal assurance. While I remained in that [mental] dwelling, I was assailed by perceptions & [acts of] attention connected with directed thought.",
  "entities": [
    [0, 20, "PERSON"]   // Ven. Mahā Moggallāna
  ],
  "meta": {
    "nikaya": "SN",
    "identifier": "sn21.001.than.html",
    "title": "Kolita Sutta",
    "para_seq": null
  }
}
{
  "text": "Then Ven. Anuradha went to the Blessed One and on arrival, having bowed down to the Blessed One, sat to one side. As he was sitting there he said to the Blessed One: \"Just now I was staying not far from the Blessed One in a wilderness hut. Then a large number of wandering sectarians came and... said to me, 'Friend Anuradha, the Tathagata — the supreme man, the superlative man, attainer of the superlative attainment — being described, is described with [one of] these four positions: The Tathagata exists after death, does not exist after death, both does & does not exist after death, neither exists nor does not exist after death.'",
  "entities": [
    [5, 18, "PERSON"],   // Ven. Anuradha
    [31, 42, "PERSON"],  // Blessed One
    [84, 95, "PERSON"],  // Blessed One
    [153, 164, "PERSON"],// Blessed One
    [207, 218, "PERSON"],// Blessed One
    [309, 324, "PERSON"],// Friend Anuradha
    [330, 339, "PERSON"],// Tathagata
    [491, 500, "PERSON"] // Tathagata
  ],
  "meta": {
    "nikaya": "SN",
    "identifier": "sn22.086.than.html",
    "title": "Anuradha Sutta",
    "para_seq": null
  }
}
{
  "text": "Then the Blessed One, having gone for alms, after his meal, on returning from his alms round, said to Ven. Ananda, \"Ananda, let's go to the Eastern Park, the palace of Migara's mother , for the day's abiding.\"",
  "entities": [
    [9, 20, "PERSON"],   // Blessed One
    [107, 113, "PERSON"],// Ven. Ananda
    [116, 122, "PERSON"],// Ananda
    [138, 167, "LOC"]    // the palace of Migara's mother
  ],
  "meta": {
    "nikaya": "MN",
    "identifier": "mn.026.than.html",
    "title": "Ariyapariyesana Sutta",
    "para_seq": null
  }
}
{"text": "\"Not a valid question,\" the Blessed One said. \"I don't say 'clings.' If I were to say 'clings,' then 'Who clings?' would be a valid question. But I don't say that. When I don't say that, the valid question is 'From what as a requisite condition comes clinging?' And the valid answer is, 'From craving as a requisite condition comes clinging. From clinging as a requisite condition comes becoming. From becoming as a requisite condition comes birth. From birth as a requisite condition, then aging & death, sorrow, lamentation, pain, distress, & despair come into play. Such is the origination of this entire mass of stress & suffering. [1]", "entities": [[28, 39, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn12.012.than.html", "title": "Phagguna Sutta", "para_seq": null}}
{"text": "\"There might, monk,\" the Blessed One said. \"There is the case where someone has this view: 'This cosmos is the self. After death this I will be constant, permanent, eternal, not subject to change. I will stay just like that for an eternity.' He hears a Tathagata or a Tathagata's disciple teaching the Dhamma for the elimination of all view-positions, determinations, biases, inclinations, & obsessions; for the stilling of all fabrications; for the relinquishing of all acquisitions; the ending of craving; dispassion; cessation; Unbinding. The thought occurs to him, 'So it might be that I will be annihilated! So it might be that I will perish! So it might be that I will not exist!' He grieves & is tormented, weeps, beats his breast, & grows delirious. It's thus that there is agitation over what is internally not present.\"", "entities": [[25, 36, "PERSON"], [253, 262, "PERSON"], [268, 277, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.022.than.html", "title": "Alagaddupama Sutta", "para_seq": null}}

{"text": "\"And what, Ananda, is another pleasure more extreme & refined than that? There is the case where a monk, with the complete transcending of the dimension of the infinitude of space, [perceiving,] 'Infinite consciousness,' enters & remains in the dimension of the infinitude of consciousness. This is another pleasure more extreme & refined than that. Though some might say, 'That is the highest pleasure that beings experience,' I would not grant them that. Why is that? Because there is another pleasure, more extreme & refined than that.", "entities": [[11, 17, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn36.019.than.html", "title": "Pañcakanga Sutta", "para_seq": null}}

{
  "text": "When this was said, Magandiya the wanderer said, \" Magnificent , Master Gotama! Magnificent! Just as if he were to place upright what was overturned, to reveal what was hidden, to point out the way to one who was lost, or to carry a lamp into the dark so that those with eyes could see forms, in the same way has Master Gotama — through many lines of reasoning — made the Dhamma clear. I go to Master Gotama for refuge, to the Dhamma, & to the community of monks. Let me obtain the going forth in Master Gotama's presence, let me obtain admission.\"",
  "entities": [
    [21, 30, "PERSON"],   // Magandiya
    [72, 78, "PERSON"],   // Gotama
    [320, 326, "PERSON"], // Gotama
    [401, 407, "PERSON"], // Gotama
    [504, 510, "PERSON"]  // Gotama
  ],
  "meta": {
    "nikaya": "MN",
    "identifier": "mn.075x.than.html",
    "title": "Magandiya Sutta",
    "para_seq": null
  }
}
{
  "text": "That is what Anathapindika the deva's son said. The Teacher approved. Then Anathapindika the deva's son, [knowing,] \"The Teacher has approved of me,\" bowed down to him, circled him three times, keeping him to his right, and then disappeared right there.",
  "entities": [
    [13, 26, "PERSON"],  // Anathapindika
    [31, 47, "PERSON"],  // the deva's son
    [52, 63, "PERSON"],  // The Teacher
    [69, 95, "PERSON"],  // Anathapindika the deva's son
    [108, 119, "PERSON"] // The Teacher
  ],
  "meta": {
    "nikaya": "MN",
    "identifier": "mn.143.than.html",
    "title": "Anathapindikovada Sutta",
    "para_seq": null
  }
}

{"text": "At Savatthi. \"Monks, any desire-passion with regard to intentions involving forms is a defilement of the mind. Any desire-passion with regard to intentions involving sounds... intentions involving aromas... intentions involving flavors... intentions involving tactile sensations... intentions involving ideas is a defilement of the mind. When, with regard to these six bases, the defilements of awareness are abandoned, then the mind is inclined to renunciation. The mind fostered by renunciation feels malleable for the direct knowing of those qualities worth realizing.\"", "entities": [[3, 11, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn27.001-010.than.html", "title": "Upakkilesa Samyutta", "para_seq": null}}

{
  "text": "So the brahman householders of Sala went to the Blessed One. On arrival, some of them, bowing down to him, sat to one side. Some of them exchanged courteous greetings with him and, after an exchange of friendly greetings & courtesies, sat to one side. Some of them, placing their hands palm-to-palm over the heart in his direction, sat to one side. Some of them, announcing their name and clan in his presence, sat to one side. Some of them, remaining silent, sat to one side.",
  "entities": [
    [7, 29, "NORP"],     // brahman householders
    [33, 37, "GPE"],     // Sala
    [48, 59, "PERSON"]   // Blessed One
  ],
  "meta": {
    "nikaya": "MN",
    "identifier": "mn.041.than.html",
    "title": "Saleyyaka Sutta",
    "para_seq": null
  }
}
{
  "text": "\"Lord, the sisters Soma and Sakula heard, 'Today, they say, King Pasenadi Kosala will go to see the Blessed One after his morning meal.' So they approached me while my meal was being served and on arrival said to me, 'In that case, great king, show reverence with your head to his feet in our name, too, and ask whether he is free from illness & affliction, is carefree, strong, & living in comfort, saying: \"The sisters Soma and Sakula, lord, show reverence with their heads to your feet and ask whether you are free from illness & affliction, are carefree, strong, & living in comfort.\"' Lord, the sisters Soma and Sakula show reverence with their heads to your feet and ask whether you are free from illness & affliction, are carefree, strong, & living in comfort.\"",
  "entities": [
    [18, 22, "PERSON"],   // Soma
    [27, 33, "PERSON"],   // Sakula
    [58, 78, "PERSON"],   // King Pasenadi Kosala
    [93, 104, "PERSON"]   // Blessed One
  ],
  "meta": {
    "nikaya": "MN",
    "identifier": "mn.090.than.html",
    "title": "Kannakatthala Sutta",
    "para_seq": null
  }
}

{"text": "\"What do you think, Aggivessana? When you say, 'Feeling is my self... Perception is my self... Fabrications are my self... Consciousness is my self,' do you wield power over that consciousness: 'May my consciousness be thus, may my consciousness not be thus'?\"", "entities": [[20, 31, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.035.than.html", "title": "Cula-Saccaka Sutta", "para_seq": null}}

{
  "text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery. Now on that occasion Uggahamana , a follower of Mundika the contemplative, [1] together with a large following of about 500 wanderers, had taken up residence in the debating hall near the Tinduka tree in the single-pavilion park of Queen Mallika . Then Pañcakanga the carpenter left Savatthi in the middle of the day to see the Blessed One, but the thought occurred to him, \"Now is not the right time to see the Blessed One, for he is in seclusion. And it is not the right time to see the mind-developing monks, for they too are in seclusion. Why don't I go to the debating hall near the Tinduka tree in the single-pavilion park of Queen Mallika to see Uggahamana, a follower of Mundika the contemplative?\" So he headed to the debating hall near the Tinduka tree in the single-pavilion park of Queen Mallika.",
  "entities": [
    [38, 49, "PERSON"],   // Blessed One
    [67, 75, "GPE"],      // Savatthi
    [79, 91, "LOC"],      // Jeta's Grove
    [93, 106, "PERSON"],  // Anathapindika
    [129, 140, "PERSON"], // Uggahamana
    [158, 180, "PERSON"], // Mundika the contemplative
    [352, 365, "PERSON"], // Pañcakanga
    [403, 411, "GPE"],    // Savatthi
    [448, 459, "PERSON"], // Blessed One
    [532, 543, "PERSON"], // Blessed One
    [752, 765, "PERSON"], // Uggahamana
    [783, 805, "PERSON"], // Mundika the contemplative
    [914, 927, "PERSON"]  // Queen Mallika
  ],
  "meta": {
    "nikaya": "MN",
    "identifier": "mn.078.than.html",
    "title": "Samana-Mundika Sutta",
    "para_seq": null
  }
}
{"text": "[When this was said, the Blessed One responded:] \" I tell you , friend, that it is not possible by traveling to know or see or reach a far end of the cosmos where one does not take birth, age, die, pass away, or reappear. But at the same time, I tell you that there is no making an end of suffering & stress without reaching the end of the cosmos. Yet it is just within this fathom-long body, with its perception & intellect, that I declare that there is the cosmos, the origination of the cosmos, the cessation of the cosmos, and the path of practice leading to the cessation of the cosmos.\"", "entities": [[25, 36, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn02.026.than.html", "title": "Rohitassa Sutta", "para_seq": null}}

{
  "text": "\"And, monks, as long as this — my three-round, twelve-permutation knowledge & vision concerning these four noble truths as they have come to be — was not pure, I did not claim to have directly awakened to the right self-awakening unexcelled in the cosmos with its deities, Maras, & Brahmas, with its contemplatives & brahmans, its royalty & commonfolk. But as soon as this — my three-round, twelve-permutation knowledge & vision concerning these four noble truths as they have come to be — was truly pure, then I did claim to have directly awakened to the right self-awakening unexcelled in the cosmos with its deities, Maras & Brahmas, with its contemplatives & brahmans, its royalty & commonfolk. Knowledge & vision arose in me: 'Unprovoked is my release. This is the last birth. There is now no further becoming.'\"",
  "entities": [
    [273, 278, "NORP"],  // Maras
    [282, 289, "NORP"],  // Brahmas
    [292, 318, "NORP"],  // contemplatives & brahmans
    [620, 625, "NORP"],  // Maras
    [628, 635, "NORP"],  // Brahmas
    [635, 661, "NORP"]   // contemplatives & brahmans
  ],
  "meta": {
    "nikaya": "SN",
    "identifier": "sn56.011.than.html",
    "title": "Dhammacakkappavattana Sutta",
    "para_seq": null
  }
}

{"text": "Staying at Savatthi. Then a brahman cosmologist [1] went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to the Blessed One, \"Now, then, Master Gotama, does everything [2] exist?\"", "entities": 

[
	[11, 19, "GPE"], 
	[64, 75, "PERSON"], 
	[247, 258, "PERSON"], 
	[279, 285, "PERSON"]
], 
	"meta": {"nikaya": "SN", "identifier": "sn12.048.than.html", "title": "Lokayatika Sutta", "para_seq": null}
}

{
  "text": "Then a large number of monks approached the Blessed One and, on arrival, having bowed down to him, sat to one side. As they were sitting there, they said to the Blessed One, \"Lord, the clansman Pukkusati, whom the Blessed One instructed with a brief instruction, has died. What is his destination? What is his future state?\"",
  "entities": [
    [44, 55, "PERSON"],   // Blessed One
    [161, 172, "PERSON"], // Blessed One
    [194, 203, "PERSON"], // Pukkusati
    [214, 225, "PERSON"]  // Blessed One
  ],
  "meta": {
    "nikaya": "MN",
    "identifier": "mn.140.than.html",
    "title": "Dhatu-vibhanga Sutta",
    "para_seq": null
  }
}
{"text": "Then the Blessed One, picking up a little bit of dust with the tip of his fingernail, said to the monks, \"What do you think, monks? Which is greater: the little bit of dust I have picked up with the tip of my fingernail, or the great earth?\"", "entities": [[9, 20, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn56.102-113.than.html", "title": "Pansu Suttas", "para_seq": null}}

{"text": "Then the monks — [thinking,] \"The Blessed One, with many lines of reasoning, has given a talk on the unattractiveness [of the body], has spoken in praise of [the perception of] unattractiveness, has spoken in praise of the development of [the perception of] unattractiveness\" — remained committed to the development of [the perception of] unattractiveness in many modes & manners. They — ashamed, repelled, & disgusted with this body — sought for an assassin. In one day, ten monks took the knife. In one day, twenty monks took the knife. In one day, thirty monks took the knife.", "entities": [[34, 45, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn54.009.than.html", "title": "Vesali Sutta", "para_seq": null}}

{
  "text": "[5] \"He experiences manifold supranormal powers. Having been one he becomes many; having been many he becomes one. He appears. He vanishes. He goes unimpeded through walls, ramparts, & mountains as if through space. He dives in & out of the earth as if it were water. He walks on water without sinking as if it were dry land. Sitting crosslegged he flies through the air like a winged bird. With his hand he touches & strokes even the sun & moon, so mighty & powerful. He exercises influence with his body even as far as the Brahma worlds.",
  "entities": [
    [525, 538, "LOC"]  // Brahma worlds
  ],
  "meta": {
    "nikaya": "MN",
    "identifier": "mn.108.than.html",
    "title": "Gopaka Moggallana Sutta",
    "para_seq": null
  }
}
{
  "text": "I have heard that on one occasion the Blessed One was staying near Savatthi in the Eastern Monastery, the palace of Migara's mother. Now on that occasion the Blessed One, on emerging from seclusion in the late afternoon, sat warming his back in the western sun. Then Ven. Ananda went to the Blessed One and, on arrival, having bowed down to the Blessed One, massaged the Blessed One's limbs with his hand and said, \" It's amazing , lord. It's astounding, how the Blessed One's complexion is no longer so clear & bright; his limbs are flabby & wrinkled; his back, bent forward; there's a discernible change in his faculties — the faculty of the eye, the faculty of the ear, the faculty of the nose, the faculty of the tongue, the faculty of the body.\"",
  "entities": [
    [38, 49, "PERSON"],   // Blessed One
    [67, 75, "GPE"],      // Savatthi
    [83, 101, "LOC"],     // Eastern Monastery
    [107, 138, "LOC"],    // the palace of Migara's mother
    [158, 169, "PERSON"], // Blessed One
    [272, 278, "PERSON"], // Ven. Ananda
    [291, 302, "PERSON"], // Blessed One
    [345, 356, "PERSON"], // Blessed One
    [371, 382, "PERSON"], // Blessed One
    [463, 474, "PERSON"]  // Blessed One
  ],
  "meta": {
    "nikaya": "SN",
    "identifier": "sn48.041.than.html",
    "title": "Jara Sutta",
    "para_seq": null
  }
}
{
  "text": "[6] \"Furthermore, you should recollect the devas : 'There are the devas of the Four Great Kings, the devas of the Thirty-three, the devas of the Hours, the Contented Devas, the devas who delight in creation, the devas who have power over the creations of others, the devas of Brahma's retinue, the devas beyond them. Whatever conviction they were endowed with that — when falling away from this life — they re-arose there, the same sort of conviction is present in me as well. Whatever virtue they were endowed with that — when falling away from this life — they re-arose there, the same sort of virtue is present in me as well. Whatever learning they were endowed with that — when falling away from this life — they re-arose there, the same sort of learning is present in me as well. Whatever generosity they were endowed with that — when falling away from this life — they re-arose there, the same sort of generosity is present in me as well. Whatever discernment they were endowed with that — when falling away from this life — they re-arose there, the same sort of discernment is present in me as well.' At any time when a disciple of the noble ones is recollecting the conviction, virtue, learning, generosity, and discernment found both in himself and the devas, his mind is not overcome with passion, not overcome with aversion, not overcome with delusion. His mind heads straight, based on the [qualities of the] devas. And when the mind is headed straight, the disciple of the noble ones gains a sense of the goal, gains a sense of the Dhamma, gains joy connected with the Dhamma. In one who is joyful, rapture arises. In one who is rapturous, the body grows calm. One whose body is calmed experiences ease. In one at ease, the mind becomes concentrated.\"",
  "entities": [
    [79, 95, "NORP"],    // Four Great Kings
    [114, 126, "NORP"],  // Thirty-three
    [145, 150, "NORP"],  // Hours (Yāma)
    [156, 171, "NORP"],  // Contented Devas (Tusita)
    [177, 206, "NORP"],  // devas who delight in creation (Nimmānarati)
    [212, 261, "NORP"],  // devas who have power over the creations of others (Paranimmita-vasavatti)
    [276, 292, "NORP"]   // Brahma's retinue
  ],
  "meta": {
    "nikaya": "AN",
    "identifier": "an11.012.than.html",
    "title": "Mahanama Sutta",
    "para_seq": null
  }
}
{
  "text": "\"Now, Ānanda, in the case where the contemplative or brahman says, 'So there really are fine actions, there really is the result of good conduct,' I allow him that. And when he says, 'For I saw the case where a person who abstained from taking life... & held right view, with the breakup of the body, after death, has reappeared in a good destination, a heavenly world,' I allow him that, too. But when he says, 'Anyone who abstains from taking life... & holds right view: They all, on the breakup of the body, after death, reappear in a good destination, a heavenly world,' I don't allow him that. And when he says, 'Whoever knows this, knows rightly. Whoever knows otherwise, their knowledge is wrong,' I don't allow him that. When, insisting through obstinacy & grasping right there on what was seen by himself, known by himself, understood by himself, he states: 'Only this is true. Everything otherwise is worthless,' I don't allow him that, either. Why is that? Because the Tathāgata's knowledge with regard to the greater analysis of action is otherwise.",
  "entities": [
    [6, 12, "PERSON"],   // Ānanda
    [980, 989, "PERSON"] // Tathāgata
  ],
  "meta": {
    "nikaya": "MN",
    "identifier": "mn.136.than.html",
    "title": "Maha Kammavibhanga Sutta",
    "para_seq": null
  }
}
{"text": "\"How is it, Master Gotama, when Master Gotama is asked if the monk reappears... does not reappear... both does & does not reappear... neither does nor does not reappear, he says, '...doesn't apply' in each case. At this point, Master Gotama, I am befuddled; at this point, confused. The modicum of clarity coming to me from your earlier conversation is now obscured.\"", "entities": [[19, 25, "PERSON"], [39, 45, "PERSON"], [234, 240, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.072.than.html", "title": "Aggi-Vacchagotta Sutta", "para_seq": null}}

{
  "text": "On one occasion the Blessed One was staying near Sāvatthī in Jeta's Grove, Anāthapiṇḍika's monastery. Then Anāthapiṇḍika the householder went to the Blessed One and, on arrival, bowed down to him and sat to one side. As he was sitting there, the Blessed One said to him, \"Householder, are gifts still given in your family?\"",
  "entities": [
    [20, 31, "PERSON"],    // Blessed One
    [49, 57, "GPE"],       // Sāvatthī
    [61, 73, "LOC"],       // Jeta's Grove
    [75, 100, "LOC"],      // Anāthapiṇḍika's monastery
    [107, 136, "PERSON"],  // Anāthapiṇḍika the householder
    [149, 160, "PERSON"],  // Blessed One
    [246, 257, "PERSON"]   // Blessed One
  ],
  "meta": {
    "nikaya": "AN",
    "identifier": "an09.020.than.html",
    "title": "Velāma Sutta",
    "para_seq": null
  }
}
{"text": "\" Even so , my friend Sariputta, are those who have people like you as their fellows in the holy life, teaching them, admonishing them out of sympathy, desiring their welfare. For now that I have heard this explanation of the Dhamma from you, my mind — through lack of clinging/sustenance — has been released from the effluents.\"", "entities": [[22, 31, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn22.085.than.html", "title": "Yamaka Sutta", "para_seq": null}}

{
  "text": "[The Blessed One said:] \"Ananda, true was the exposition that Pañcakanga the carpenter would not accept from Ven. Udayin. And true was the exposition that Ven. Udayin would not accept from Pañcakanga the carpenter. There is the exposition by which I have spoken of two feelings, the exposition by which I have spoken of three feelings ... five feelings ... six feelings ... eighteen feelings ... 36 feelings ... 108 feelings. [1] Thus I have taught the Dhamma by means of exposition. When I have taught the Dhamma by means of exposition, it can be expected that when there are those who do not consent to, assent to, or accept what is well-said and well-stated by one another, there will be arguing, quarreling, & disputing, and they will dwell wounding one another with the sword of the tongue. Thus I have taught the Dhamma by means of exposition. When I have taught the Dhamma by means of exposition, it can be expected that when there are those who do consent to, assent to, & accept what is well-said and well-stated by one another, they will live in harmony, with courtesy, without quarreling, like milk mixed with water, regarding one another with friendly eyes.",
  "entities": [
    [5, 16, "PERSON"],     // Blessed One
    [25, 31, "PERSON"],    // Ananda
    [62, 86, "PERSON"],    // Pañcakanga the carpenter
    [109, 120, "PERSON"],  // Ven. Udayin
    [155, 166, "PERSON"],  // Ven. Udayin
    [189, 213, "PERSON"]   // Pañcakanga the carpenter
  ],
  "meta": {
    "nikaya": "MN",
    "identifier": "mn.059.than.html",
    "title": "Bahuvedaniya Sutta",
    "para_seq": null
  }
}
{
  "text": "\"Even though Master Gotama says that, still the brahmans think, 'Brahmans are the superior caste... Only brahmans are pure, not non-brahmans. Only brahmans are the sons & offspring of Brahma: born of his mouth, born of Brahma, created by Brahma, heirs of Brahma.'\"",
  "entities": [
    [20, 26, "PERSON"],
    [184, 190, "PERSON"],
    [219, 225, "PERSON"],
    [238, 244, "PERSON"],
    [255, 261, "PERSON"]
  ],
  "meta": {
    "nikaya": "MN",
    "identifier": "mn.093.than.html",
    "title": "Assalayana Sutta",
    "para_seq": null
  }
}

{
  "text": "\"Amazing, lord. Stupendous. How well the Blessed One has put it: 'Whatever stress, in arising, arose for me in the past, all of it had desire as its root, had desire as its cause — for desire is the cause of stress. And whatever stress, in arising, will arise for me in the future, all of it will have desire as the root, will have desire as its cause — for desire is the cause of stress.' I have a son , lord, named Ciravasi, who lives far away from here. When I get up in the morning, I send a man, saying, 'Go, learn how Ciravasi is doing.' And as long as that man has not returned, I am simply beside myself, [thinking], 'Don't let Ciravasi be sick!'\"",
  "entities": [
    [41, 52, "PERSON"],   // Blessed One
    [417, 425, "PERSON"], // Ciravasi (named ...)
    [524, 532, "PERSON"], // Ciravasi (how ... is doing)
    [636, 644, "PERSON"]  // Ciravasi (Don't let ... be sick)
  ],
  "meta": {
    "nikaya": "SN",
    "identifier": "sn42.011.than.html",
    "title": "Gandhabhaka (Bhadraka) Sutta",
    "para_seq": null
  }
}

{"text": "[7] \" There are these four perceptions . Which four? One perceives the limited [ordinary perceptions]. One perceives the enlarged [the mind in jhana]. One perceives the immeasurable [the mind in the Brahma attitudes]. One perceives the dimension of nothingness: 'There is nothing.' These are the four perceptions. Now, of these four perceptions, this is supreme: when one perceives the dimension of nothingness: 'There is nothing.' And there are beings who are percipient in this way. Yet even in the beings who are percipient in this way there is still aberration, there is change. Seeing this, the instructed disciple of the noble ones grows disenchanted with that. Being disenchanted with that, he becomes dispassionate toward what is supreme, and even more so toward what is inferior.", "entities": [
 [199, 205, "PERSON"]
], "meta": {"nikaya": "AN", "identifier": "an10.029.than.html", "title": "Kosala Sutta", "para_seq": null}}

{
  "text": "So he went to Upavattana, the Mallans' sal-grove and, on arrival, said to Ven. Ananda, \"I have heard the elder wanderers, teachers of teachers, saying that only once in a long, long time do Tathagatas — worthy ones, rightly self-awakened — appear in the world. Tonight, in the last watch of the night, the total Unbinding of Gotama the contemplative will occur. Now there is a doubt that has arisen in me, but I have faith that he could teach me the Dhamma in such a way that I might abandon that doubt. It would be good, Ven. Ananda, if you would let me see him.\"",
  "entities": [
    [14, 24, "GPE"],       // Upavattana
    [26, 48, "LOC"],       // the Mallans' sal-grove
    [74, 85, "PERSON"],    // Ven. Ananda
    [325, 331, "PERSON"],  // Gotama
    [522, 533, "PERSON"]   // Ven. Ananda
  ],
  "meta": {
    "nikaya": "DN",
    "identifier": "dn.16.5-6.than.html",
    "title": "Maha-parinibbana Sutta",
    "para_seq": null
  }
}
{"text": "At Savatthi. \"Monks, any desire-passion with regard to contact at the eye is a defilement of the mind. Any desire-passion with regard to contact at the ear... contact at the nose... contact at the tongue... contact at the body... contact at the intellect is a defilement of the mind. When, with regard to these six bases, the defilements of awareness are abandoned, then the mind is inclined to renunciation. The mind fostered by renunciation feels malleable for the direct knowing of those qualities worth realizing.\"", "entities": [[3, 11, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn27.001-010.than.html", "title": "Upakkilesa Samyutta", "para_seq": null}}

{"text": "\" Magnificent , lord! Magnificent! Just as if he were to place upright what was overturned, to reveal what was hidden, to show the way to one who was lost, or to carry a lamp into the dark so that those with eyes could see forms, in the same way the has Blessed One — through many lines of reasoning — made the Dhamma clear. I go to the Blessed One for refuge, to the Dhamma, and to the Community of monks. May the Blessed One remember me as a lay follower who has gone to him for refuge, from this day forward, for life.\"", 
  "entities": [
  [254, 265, "PERSON"], [337, 348, "PERSON"], [415, 426, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an06.047.than.html", "title": "Sanditthika Sutta", "para_seq": null}}

{
  "text": "On one occasion the Blessed One was staying among the Mallans in a Mallan town named Uruvelakappa . Then Gandhabhaka the headman went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the Blessed One: \"It would be good, lord, if the Blessed One would teach me the origination & ending of stress.\"",
  "entities": [
    [20, 31, "PERSON"],   // Blessed One
    [52, 59, "NORP"],     // Mallans (ethnic group)
    [69, 85, "GPE"],      // Mallan town
    [93, 106, "GPE"],     // Uruvelakappa
    [141, 152, "PERSON"], // Gandhabhaka
    [252, 263, "PERSON"], // Blessed One
    [297, 308, "PERSON"]  // Blessed One
  ],
  "meta": {
    "nikaya": "SN",
    "identifier": "sn42.011.than.html",
    "title": "Gandhabhaka (Bhadraka) Sutta",
    "para_seq": null
  }
}

{
  "text": "So King Pasenadi Kosala said to the Blessed One, \"Lord, we have asked the Blessed One about omniscience, the Blessed One has answered about omniscience, and that is pleasing & agreeable to us, and we are gratified because of it. We have asked the Blessed One about the purity of the four castes, the Blessed One has answered about the purity of the four castes, and that is pleasing & agreeable to us, and we are gratified because of it. We have asked the Blessed One about the higher devas, the Blessed One has answered about the higher devas, and that is pleasing & agreeable to us, and we are gratified because of it. We have asked the Blessed One about the higher brahmas, the Blessed One has answered about the higher brahmas, and that is pleasing & agreeable to us, and we are gratified because of it. Whatever we have asked the Blessed One about, that he has answered, and that is pleasing & agreeable to us, and we are gratified because of it. Now, lord, we must go. Many are our duties, many our responsibilities.\"",
  "entities": [
    [3, 23, "PERSON"],   // King Pasenadi Kosala
    [36, 47, "PERSON"],  // Blessed One
    [74, 85, "PERSON"],  // Blessed One
    [109, 120, "PERSON"], // Blessed One
    [247, 258, "PERSON"], // Blessed One
    [300, 311, "PERSON"], // Blessed One
    [456, 467, "PERSON"], // Blessed One
    [496, 507, "PERSON"], // Blessed One
    [639, 650, "PERSON"], // Blessed One
    [681, 692, "PERSON"], // Blessed One
    [835, 846, "PERSON"]  // Blessed One
  ],
  "meta": {
    "nikaya": "MN",
    "identifier": "mn.090.than.html",
    "title": "Kannakatthala Sutta",
    "para_seq": null
  }
}
{
  "text": "\"That's the way it is, great king. That's the way it is. Once in the past that money-lending householder provided alms for the Private Buddha named Tagarasikhi . Saying [to his servant], 'Give alms to the contemplative,' he got up from his seat and left. After giving, though, he felt regret: 'It would have been better if my slaves or servants had eaten those alms.' And he also murdered his brother's only heir for the sake of his fortune. Now, the result of his action in having provided alms for the Private Buddha named Tagarasikhi was that he appeared seven times in a good destination, the heavenly world. And through the remaining result of that action he acted as money-lender seven times in this very same Savatthi. But the result of his action in feeling regret after giving [those] alms — 'It would have been better if my slaves or servants had eaten those alms' — was that his mind didn't lend itself to the lavish enjoyment of food, didn't lend itself to the lavish enjoyment of clothing, didn't lend itself to the lavish enjoyment of a vehicle, didn't lend itself to the lavish enjoyment of the five strings of sensuality. The result of his action in having murdered his brother's only heir for the sake of his fortune was that he boiled in hell for many years, many hundreds of years, many thousands of years, many hundred-thousands of years. And through the remaining result of that action he has left this seventh heirless fortune to the royal treasury.",
  "entities": [
    [112, 149, "PERSON"],  // Private Buddha named Tagarasikhi
    [135, 146, "PERSON"],  // Tagarasikhi (specific Buddha)
    [716, 724, "GPE"]      // Savatthi
  ],
  "meta": {
    "nikaya": "SN",
    "identifier": "sn03.020.than.html",
    "title": "Aputtaka Sutta",
    "para_seq": null
  }
}

{
  "text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika 's monastery. Then King Pasenadi Kosala went to the Blessed One and, on arrival, exchanged courteous greetings with him. After this exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there he said to the Blessed One: \"Now then, does Master Gotama claim, 'I have awakened to the unexcelled right self-awakening'?\"",
  "entities": [
    [38, 49, "PERSON"],   // Blessed One
    [67, 75, "GPE"],      // Savatthi
    [79, 91, "LOC"],      // Jeta's Grove
    [93, 106, "PERSON"],  // Anathapindika
    [108, 118, "LOC"],    // monastery
    [126, 146, "PERSON"], // King Pasenadi Kosala
    [159, 170, "PERSON"], // Blessed One
    [343, 354, "PERSON"], // Master Gotama
    [379, 385, "PERSON"]  // Blessed One
  ],
  "meta": {
    "nikaya": "SN",
    "identifier": "sn03.001.than.html",
    "title": "Dahara Sutta",
    "para_seq": null
  }
}
{"text": "\"And for what reason is a disciple of a Tathagata worthy of a burial mound? [At the thought,] 'This is the burial mound of a disciple of a Tathagata,' many people will brighten their minds. Having brightened their minds there, then — on the break-up of the body, after death — they will reappear in a good destination, the heavenly world...", "entities": [[40, 49, "PERSON"], [139, 148, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}

{
  "text": "On one occasion the Blessed One was staying near Alavi on a spread of leaves by a cattle track in a simsapa forest. Then Hatthaka of Alavi , out roaming & rambling for exercise, saw the Blessed One sitting on a spread of leaves by the cattle track in the simsapa forest. On seeing him, he went to him and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the Blessed One, \"Lord, I hope the Blessed One has slept in ease.\"",
  "entities": [
    [20, 31, "PERSON"],        // Blessed One
    [47, 52, "GPE"],           // Alavi
    [76, 88, "LOC"],           // cattle track
    [94, 109, "LOC"],          // simsapa forest
    [115, 132, "PERSON"],      // Hatthaka of Alavi
    [197, 208, "PERSON"],      // Blessed One
    [400, 411, "PERSON"],      // Blessed One
    [431, 442, "PERSON"]       // Blessed One
  ],
  "meta": {
    "nikaya": "AN",
    "identifier": "an03.034.than.html",
    "title": "Hatthaka Sutta",
    "para_seq": null
  }
}
{
  "text": "When this was said, Dasama the householder from Atthakanagara said to Ven. Ananda, \"Venerable Ananda, just as if a man seeking a single opening onto treasure were all at once to come upon eleven openings onto treasure, in the same way I — seeking a single doorway to the Deathless — have all at once come to hear of eleven doorways to the Deathless. And just as if a man whose house had eleven doors could take himself to safety by means of any one of those doors, in the same way I can take myself to safety by means of any one of these eleven doors to the Deathless. Venerable sir, when sectarians search for a teacher's fee for their teachers, why shouldn't I pay homage to Ven. Ananda?\"",
  "entities": [
    [27, 33, "PERSON"],   // Dasama
    [54, 68, "GPE"],      // Atthakanagara
    [94, 100, "PERSON"],  // Ven. Ananda
    [682, 688, "PERSON"]  // Ven. Ananda
  ],
  "meta": {
    "nikaya": "AN",
    "identifier": "an11.017.than.html",
    "title": "Dasama Sutta",
    "para_seq": null
  }
}
{"text": "\"What do you think, Aggivessana? When one adheres to stress, holds to stress, is attached to stress, and envisions of stress that 'This is mine; this is my self; this is what I am,' would he comprehend stress or dwell having totally destroyed stress?\"", "entities": [[20, 31, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.035.than.html", "title": "Cula-Saccaka Sutta", "para_seq": null}}

{
  "text": "\"When this was said, the Great Brahma said to the monk, 'I, monk, am Brahma, the Great Brahma, the Conqueror, the Unconquered, the All-Seeing, All-Powerful, the Sovereign Lord, the Maker, Creator, Chief, Appointer and Ruler, Father of All That Have Been and Shall Be.'",
  "entities": [
    [31, 43, "PERSON"],   // the Great Brahma
    [69, 75, "PERSON"],   // Brahma
    [81, 93, "PERSON"],   // the Great Brahma (repeated self-reference)
    [95, 107, "PERSON"],  // the Conqueror
    [113, 125, "PERSON"], // the Unconquered
    [131, 142, "PERSON"], // the All-Seeing
    [144, 157, "PERSON"], // All-Powerful
    [163, 178, "PERSON"], // the Sovereign Lord
    [184, 189, "PERSON"], // the Maker
    [191, 198, "PERSON"], // Creator
    [200, 205, "PERSON"], // Chief
    [207, 216, "PERSON"], // Appointer
    [221, 227, "PERSON"]  // Ruler
  ],
  "meta": {
    "nikaya": "DN",
    "identifier": "dn.11.0.than.html",
    "title": "Kevatta (Kevaddha) Sutta",
    "para_seq": null
  }
}

{
  "text": "\"There are ideas cognizable via the intellect — agreeable, pleasing, charming, endearing, fostering desire, enticing. If a monk relishes them, welcomes them, & remains fastened to them, he is said to be a monk who has swallowed Mara's hook, who has fallen into misfortune & disaster. The Evil One can do with him as he will.",
  "entities": [
    [228, 232, "PERSON"],   // Mara
    [271, 283, "PERSON"]    // The Evil One
  ],
  "meta": {
    "nikaya": "SN",
    "identifier": "sn35.189.than.html",
    "title": "Balisika Sutta",
    "para_seq": null
  }
}
{"text": "As he was sitting there he said to the Blessed One, \"There are, Master Gotama, some brahmans & contemplatives who live committed to the development of the body but not to the development of the mind. They are touched by bodily painful feeling. It has happened in the past that when one (of them) was touched by bodily painful feeling, his thighs would grow rigid, his heart would burst, hot blood would gush from his mouth, he would go mad, out of his mind. His mind was thus subservient to his body and fell under the power of the body. Why was that? A lack of development of the mind.", "entities": [[39, 50, "PERSON"], [71, 77, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.036.than.html", "title": "Maha-Saccaka Sutta", "para_seq": null}}

{
  "text": "\"Now it may be that you are thinking, 'Nakula's mother will not reach firm ground in this Doctrine & Discipline, will not attain a firm foothold, will not attain consolation, overcome her doubts, dispel her perplexity, reach fearlessness or gain independence from others with regard to the Teacher's message,' [2] but you shouldn't see things in that way. To the extent that the Blessed One has white-clad householder female disciples who reach firm ground in this Doctrine & Discipline, attain a firm foothold, attain consolation, overcome their doubts, dispel their perplexity, reach fearlessness, & gain independence from others with regard to the Teacher's message, I am one of them. If anyone doubts or denies this, let him go ask the Blessed One, the worthy one, the rightly self-awakened one who is staying among the Bhaggas in the Deer Park at Bhesakala Grove, near Crocodile Haunt. So don't be worried as you die, householder. Death is painful for one who is worried. The Blessed One has criticized being worried at the time of death.\"",
  "entities": [
    [39, 54, "PERSON"],   // Nakula's mother
    [379, 390, "PERSON"], // Blessed One
    [740, 751, "PERSON"], // Blessed One
    [824, 831, "NORP"],   // Bhaggas
    [839, 848, "LOC"],    // Deer Park
    [852, 867, "LOC"],    // Bhesakala Grove
    [874, 889, "LOC"],    // Crocodile Haunt
    [981, 992, "PERSON"]  // Blessed One
  ],
  "meta": {
    "nikaya": "AN",
    "identifier": "an06.016.than.html",
    "title": "Nakula Sutta",
    "para_seq": null
  }
}

{"text": "\"Friend, concerning these five clinging-aggregates described by the Blessed One — i.e., form as a clinging-aggregate... feeling... perception... fabrications... consciousness as a clinging-aggregate: With regard to these five clinging-aggregates, there is nothing I assume to be self or belonging to self.\"", "entities": [[68, 79, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn22.089.than.html", "title": "Khemaka Sutta", "para_seq": null}}

{
  "text": "Then Ven. Upali went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the Blessed One: \"It would be good, lord, if the Blessed One would teach me the Dhamma in brief such that, having heard the Dhamma from the Blessed One, I might dwell alone, secluded, heedful, ardent, & resolute.\"",
  "entities": [
    [10, 21, "PERSON"],   // Ven. Upali
    [39, 50, "PERSON"],   // Blessed One
    [139, 150, "PERSON"], // Blessed One
    [184, 195, "PERSON"], // Blessed One
    [275, 286, "PERSON"]  // Blessed One
  ],
  "meta": {
    "nikaya": "AN",
    "identifier": "an07.079.than.html",
    "title": "Satthusasana Sutta",
    "para_seq": null
  }
}

{"text": "\"And did you ever say to me, 'Lord, I will live the holy life under the Blessed One and [in return] he will declare to me that 'The cosmos is eternal,' or 'The cosmos is not eternal,' or 'The cosmos is finite,' or 'The cosmos is infinite,' or 'The soul & the body are the same,' or 'The soul is one thing and the body another,' or 'After death a Tathagata exists,' or 'After death a Tathagata does not exist,' or 'After death a Tathagata both exists & does not exist,' or 'After death a Tathagata neither exists nor does not exist'?\"", "entities": [

[72, 83, "PERSON"], 
[346, 355, "PERSON"], 
[383, 392, "PERSON"], 
[428, 437, "PERSON"], 
[487, 496, "PERSON"]
], "meta": {"nikaya": "MN", "identifier": "mn.063.than.html", "title": "Cula-Malunkyovada Sutta", "para_seq": null}}


{
  "text": "On one occasion the Blessed One was staying among the Sakyans at Kapilavatthu in the Banyan Park. Now at that time many monks were at work making robes for the Blessed One, [thinking,] \"When the robes are finished, at the end of the three months, the Blessed One will set out wandering.\"",
  "entities": [
    [20, 31, "PERSON"],   // Blessed One
    [54, 61, "NORP"],     // Sakyans
    [65, 77, "GPE"],      // Kapilavatthu
    [85, 96, "LOC"],      // Banyan Park
    [160, 171, "PERSON"], // Blessed One
    [251, 262, "PERSON"]  // Blessed One
  ],
  "meta": {
    "nikaya": "SN",
    "identifier": "sn55.054.than.html",
    "title": "Gilana Sutta",
    "para_seq": null
  }
}
{"text": "\"There is the case where a monk has conviction, is convinced of the Tathagata's Awakening: 'Indeed, the Blessed One is pure & rightly self-awakened, consummate in knowledge & conduct, well-gone, an expert with regard to the world, unexcelled as a trainer for those people fit to be tamed, the Teacher of divine & human beings, awakened, blessed.'", "entities": [[68, 77, "PERSON"], [104, 115, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an05.053.than.html", "title": "Anga Sutta", "para_seq": null}}

{
  "text": "Then early in the morning a certain monk, having put on his robes and carrying his bowl & outer robe, went to Hatthaka of Alavi's home. On arrival, he sat down on a seat made ready. Then Hatthaka of Alavi approached the monk and, having bowed down to him, sat to one side. As he was sitting there the monk said to him, \"Friend, the Blessed One has described you as being endowed with seven amazing, astounding qualities. Which seven? 'Hatthaka of Alavi is endowed with conviction. He is virtuous. He has a sense of conscience. He has a sense of concern. He is learned. He is generous. He is discerning.' Friend, the Blessed One has described you as being endowed with these seven amazing, astounding qualities.\"",
  "entities": [
    [83, 100, "PERSON"],   // Hatthaka of Alavi
    [94, 99, "GPE"],       // Alavi
    [179, 196, "PERSON"],  // Hatthaka of Alavi
    [190, 195, "GPE"],     // Alavi
    [332, 343, "PERSON"],  // Blessed One
    [616, 627, "PERSON"]   // Blessed One
  ],
  "meta": {
    "nikaya": "AN",
    "identifier": "an08.023.than.html",
    "title": "Hatthaka Sutta",
    "para_seq": null
  }
}

{
  "text": "\"He/she is endowed with verified confidence in the Sangha: 'The Sangha of the Blessed One's disciples who have practiced well...who have practiced straight-forwardly...who have practiced methodically...who have practiced masterfully — in other words, the four types of noble disciples when taken as pairs, the eight when taken as individual types [1] — they are the Sangha of the Blessed One's disciples: worthy of gifts, worthy of hospitality, worthy of offerings, worthy of respect, the incomparable field of merit for the world.'",
  "entities": [
    [51, 57, "NORP"],    // Sangha
    [64, 70, "NORP"],    // Sangha
    [78, 89, "PERSON"],  // Blessed One
    [366, 372, "NORP"],  // Sangha
    [380, 391, "PERSON"] // Blessed One
  ],
  "meta": {
    "nikaya": "SN",
    "identifier": "sn55.001.than.html",
    "title": "Raja Sutta",
    "para_seq": null
  }
}

{
  "text": "\"'If you can't catch sight of the top of the deva-king Pajapati's standard, then you should catch sight of the top of the deva-king Varuna's standard. For when you have caught sight of the top of the deva-king Varuna's standard, whatever fear, terror, or horripilation there is will be abandoned.\"",
  "entities": [
    [35, 43, "PERSON"],   // Pajapati (deva-king)
    [96, 102, "PERSON"],  // Varuna (deva-king)
    [153, 159, "PERSON"]  // Varuna (repeated reference)
  ],
  "meta": {
    "nikaya": "SN",
    "identifier": "sn11.003.than.html",
    "title": "Dhajagga Sutta",
    "para_seq": null
  }
}
{"text": "\"For us, lord, the teachings have the Blessed One as their root, their guide, & their arbitrator. It would be good if the Blessed One himself would explicate the meaning of this statement. Having heard it from the Blessed One, the monks will remember it.\"", "entities": [

[38, 49, "PERSON"], 
[122, 133, "PERSON"], 
[214, 225, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn22.058.than.html", "title": "Buddha Sutta", "para_seq": null}
}

{
  "text": "\"He has not killed his mother; he has not killed his father; he has not killed an arahant; he has not, with corrupt intent, caused the blood of a Tathagata to flow; he has not caused a split in the Sangha; and he is a discerning person, not slow or dull-witted.\"",
  "entities": [
    [135, 144, "PERSON"],  // Tathagata (specific epithet of the Buddha)
    [177, 183, "NORP"]     // Sangha (collective monastic order)
  ],
  "meta": {
    "nikaya": "AN",
    "identifier": "an06.087.than.html",
    "title": "Kammavaranata Sutta",
    "para_seq": null
  }
}

{
  "text": "The brahman householders of Sala heard it said: \"Gotama the contemplative — the son of the Sakyans, having gone forth from the Sakyan clan — on a wandering tour among the Kosalans with a large community of monks — has arrived at Sala. And of that Master Gotama this fine reputation has spread: 'He is indeed a Blessed One, worthy, & rightly self-awakened, consummate in knowledge & conduct, well-gone, a knower of the cosmos, an unexcelled trainer of those persons ready to be tamed, teacher of human & divine beings, awakened, blessed. He has made known — having realized it through direct knowledge — this world with its devas, maras, & brahmas, its generations with their contemplatives & brahmans, their rulers & common people; has explained the Dhamma admirable in the beginning, admirable in the middle, admirable in the end; has expounded the holy life both in its particulars & in its essence, entirely perfect & pure. It is good to see such a worthy one.'\"",
  "entities": [
    [4, 24, "NORP"],       // brahman householders
    [28, 32, "GPE"],       // Sala
    [49, 55, "PERSON"],    // Gotama
    [91, 98, "NORP"],      // Sakyans
    [127, 138, "NORP"],    // Sakyan clan
    [171, 179, "NORP"],    // Kosalans
    [229, 233, "GPE"],     // Sala (second mention)
    [247, 260, "PERSON"],  // Master Gotama
    [310, 321, "PERSON"],  // Blessed One
    [623, 628, "NORP"],    // devas
    [630, 635, "NORP"],    // maras
    [639, 646, "NORP"],    // brahmas
    [675, 689, "NORP"],    // contemplatives
    [692, 700, "NORP"],    // brahmans
    [708, 714, "NORP"],    // rulers
    [717, 730, "NORP"]     // common people
  ],
  "meta": {
    "nikaya": "MN",
    "identifier": "mn.041.than.html",
    "title": "Saleyyaka Sutta",
    "para_seq": null
  }
}

{"text": "\"Then is it the case, friend Sariputta, that the holy life is lived under the Blessed One with the purpose, 'May an action [whose result] is to be experienced as pain be turned into an action [whose result] is to be experienced by me as pleasure?'\"", "entities": [[29, 38, "PERSON"], [78, 89, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an09.013.than.html", "title": "Kotthita Sutta", "para_seq": null}}

{
  "text": "\"In the same way, monks, on whatever occasion a monk — secluded from sensuality, secluded from unskillful qualities — enters the first jhāna: rapture & pleasure born of seclusion, accompanied by directed thought & evaluation, on that occasion the thought occurs to him, 'Having come to this shelter for the fearful, I will now keep here to myself, having nothing to do with Māra.' And the thought occurs to Māra, the Evil One, 'Having gone to this shelter for the fearful, the monk will now keep here to himself, having nothing to do with me.'",
  "entities": [
    [374, 378, "PERSON"],  // Māra (first)
    [407, 411, "PERSON"],  // Māra (second)
    [413, 425, "PERSON"]   // the Evil One
  ],
  "meta": {
    "nikaya": "AN",
    "identifier": "an09.039.than.html",
    "title": "Deva Sutta",
    "para_seq": null
  }
}

{
  "text": "\"Furthermore, there is the case where the Teacher — out of sympathy, seeking their well-being — teaches the Dhamma to his disciples: 'This is for your well-being, this is for your happiness.' His disciples listen, lend ear, & apply their minds to gnosis. They do not turn aside or stray from the Teacher's message. In this case the Tathagata is satisfied and is sensitive to satisfaction, yet he remains untroubled, mindful, & alert. This is the third frame of reference that a noble one cultivates, cultivating which he is a teacher fit to instruct a group.",
  "entities": [
    [38, 49, "PERSON"],   // the Teacher (first mention)
    [292, 303, "PERSON"], // the Teacher (in “the Teacher's message”)
    [328, 341, "PERSON"]  // the Tathagata
  ],
  "meta": {
    "nikaya": "MN",
    "identifier": "mn.137.than.html",
    "title": "Salayatana-vibhanga Sutta",
    "para_seq": null
  }
}

{
  "text": "Then Ven. Rahula, emerging from his seclusion in the late afternoon, went to the Blessed One and, having bowed down, sat to one side. As he was sitting there he said to him, \"How, lord, is mindfulness of in-&-out breathing to be developed & pursued so as to be of great fruit, of great benefit?\"",
  "entities": [
    [5, 16, "PERSON"],   // Ven. Rahula
    [81, 92, "PERSON"]   // Blessed One
  ],
  "meta": {
    "nikaya": "MN",
    "identifier": "mn.062.than.html",
    "title": "Maha-Rahulovada Sutta",
    "para_seq": null
  }
}

{
  "text": "\"This, too, is called a footprint of the Tathagata, a scratch mark of the Tathagata, a tusk slash of the Tathagata, but a disciple of the noble ones would not yet come to the conclusion, 'The Blessed One is rightly self-awakened; the Dhamma is well-taught by the Blessed One; the Sangha of the Blessed One's disciples has practiced rightly.'",
  "entities": [
    [41, 50, "PERSON"],   // the Tathagata
    [74, 83, "PERSON"],   // the Tathagata
    [105, 114, "PERSON"], // the Tathagata
    [192, 203, "PERSON"], // the Blessed One
    [263, 274, "PERSON"], // the Blessed One
    [280, 286, "NORP"],   // Sangha
    [294, 305, "PERSON"]  // the Blessed One
  ],
  "meta": {
    "nikaya": "MN",
    "identifier": "mn.027.than.html",
    "title": "Cula-hatthipadopama Sutta",
    "para_seq": null
  }
}
{
  "text": "Then in the evening Ven. Sariputta left his seclusion, went to Ven. Yamaka, and on arrival exchanged courteous greetings. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to Ven. Yamaka, \"Is it true, my friend Yamaka, that this evil supposition has arisen to you: 'As I understand the Teaching explained by the Blessed One, a monk with no more effluents, on the break-up of the body, is annihilated, perishes, & does not exist after death.'",
  "entities": [
    [20, 34, "PERSON"],   // Ven. Sariputta
    [63, 74, "PERSON"],   // Ven. Yamaka (first)
    [232, 243, "PERSON"], // Ven. Yamaka (second)
    [268, 274, "PERSON"], // Yamaka (my friend Yamaka)
    [369, 380, "PERSON"]  // Blessed One
  ],
  "meta": {
    "nikaya": "SN",
    "identifier": "sn22.085.than.html",
    "title": "Yamaka Sutta",
    "para_seq": null
  }
}

{"text": "As they were sitting there, the wanderers of other sects said to them, \"Friends, Gotama the contemplative teaches the Dhamma to his disciples in this way: 'Come, monks — abandoning the five hindrances, the corruptions of awareness that weaken discernment — keep pervading the first direction [the east] with an awareness imbued with good will, likewise the second, likewise the third, likewise the fourth. Thus above, below, & all around, everywhere, in its entirety, keep pervading the all-encompassing cosmos with an awareness imbued with good will — abundant, expansive, immeasurable, without hostility, without ill will.", "entities": [[81, 87, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn46.054.than.html", "title": "Metta Sutta", "para_seq": null}
}

{
  "text": "Now at that time Ven. Ananda , together with many other monks, was making robes at the dwelling of Ghata the Sakyan. Then, when it was evening, the Blessed One rose from seclusion and went to the dwelling of Ghata the Sakyan . On arrival, he sat down on a seat made ready. Having sat down, he asked Ven. Ananda, \"There are many resting places prepared in Kala-khemaka the Sakyan's dwelling. Do many monks live there?\"",
  "entities": [
    [22, 34, "PERSON"],   // Ven. Ananda
    [148, 163, "PERSON"], // Ghata the Sakyan (first mention)
    [304, 319, "PERSON"], // Ghata the Sakyan (second mention)
    [393, 424, "LOC"]     // Kala-khemaka the Sakyan's dwelling
  ],
  "meta": {
    "nikaya": "MN",
    "identifier": "mn.122.than.html",
    "title": "Maha-suññata Sutta",
    "para_seq": null
  }
}

{
  "text": "\"Then — just as a strong man might extend his flexed arm or flex his extended arm — the monk disappeared from the Brahma world and immediately appeared in front of me. Having bowed down to me, he sat to one side. As he was sitting there he said to me, 'Lord, where do these four great elements — the earth property, the liquid property, the fire property, and the wind property — cease without remainder?'",
  "entities": [
    [72, 84, "LOC"]  // Brahma world
  ],
  "meta": {
    "nikaya": "DN",
    "identifier": "dn.11.0.than.html",
    "title": "Kevatta (Kevaddha) Sutta",
    "para_seq": null
  }
}

{"text": "(e) \"Having a single formless perception internally, one sees forms externally as blue, blue in their color, blue in their features, blue in their glow. Just as a flax-flower is blue, blue in its color, blue in its features, blue in its glow, or just as Benares muslin, smooth on both sides, is blue, blue in its color, blue in its features, blue in its glow; in the same way, having a single formless perception internally, one sees forms externally as blue, blue in their color, blue in their features, blue in their glow. Mastering them, one has the perception, 'I know; I see.' This is the fifth dimension of [mental] mastery.", "entities": [[254, 261, "GPE"]], "meta": {"nikaya": "AN", "identifier": "an10.029.than.html", "title": "Kosala Sutta", "para_seq": null}}

{"text": "\"You've gone too far, friend Visakha. You can't keep holding on up to the limit of questions. For the holy life gains a footing in Unbinding, culminates in Unbinding, has Unbinding as its final end. If you wish, go to the Blessed One and ask him the meaning of these things. Whatever he says, that's how you should remember it.\"", "entities": [[29, 36, "PERSON"], [222, 233, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.044.than.html", "title": "Culavedalla Sutta", "para_seq": null}}

{"text": "\"What do you think, Tissa: In one who is not without passion, desire, love, thirst, fever, & craving for feeling... perception... fabrications, does there arise sorrow, lamentation, pain, distress, & despair from change & alteration in his fabrications?\"", "entities": [[20, 25, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn22.084.than.html", "title": "Tissa Sutta", "para_seq": null}}

{
  "text": "\"This, too, is called a footprint of the Tathagata, a scratch mark of the Tathagata, a tusk slash of the Tathagata, but a disciple of the noble ones would not yet come to the conclusion, 'The Blessed One is rightly self-awakened; the Dhamma is well-taught by the Blessed One; the Sangha of the Blessed One's disciples has practiced rightly.'",
  "entities": [
    [41, 50, "PERSON"], 
    [74, 83, "PERSON"], 
    [105, 114, "PERSON"], 
    [192, 203, "PERSON"], 
    [263, 274, "PERSON"], 
    [294, 305, "PERSON"],
    [281, 287, "NORP"]  // Sangha
  ],
  "meta": {
    "nikaya": "MN",
    "identifier": "mn.027.than.html",
    "title": "Cula-hatthipadopama Sutta",
    "para_seq": null
  }
}