{"text": "\"This, Sariputta, is the cause, this is the reason, why a person gives a gift of a certain sort and it does not bear great fruit or great benefit, whereas another person gives a gift of the same sort and it bears great fruit and great benefit.\"", "entities": [[7, 16, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an07.049.than.html", "title": "Dana Sutta", "para_seq": null}}
{"text": "So Nanda the cowherd obtained the Going-forth in the Blessed One's presence, he obtained the Full Acceptance. And not long after his Acceptance — dwelling alone, secluded, heedful, ardent, & resolute — he in no long time reached & remained in the supreme goal of the holy life, for which clansmen rightly go forth from home into homelessness, knowing & realizing it for himself in the here & now. He knew: \"Birth is ended, the holy life fulfilled, the task done. There is nothing further for the sake of this world.\" And thus Ven. Nanda became another one of the arahants.", "entities": [[53, 64, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn35.200.than.html", "title": "Daruka-khandha Sutta", "para_seq": null}}
{"text": "So when the monks were unable to pry the monk Arittha Formerly-of-the-Vulture-Killers away from that pernicious viewpoint, they went to the Blessed One and on arrival, having bowed down to him, sat to one side. As they were sitting there, they [told him what had happened.]", "entities": [[140, 151, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.022.than.html", "title": "Alagaddupama Sutta", "para_seq": null}}
{"text": "\"Absorbed in this way, the excellent thoroughbred of a man is absorbed dependent neither on earth, liquid, fire, wind, the sphere of the infinitude of space, the sphere of the infinitude of consciousness, the sphere of nothingness, the sphere of neither perception nor non-perception, this world, the next world, nor on whatever is seen, heard, sensed, cognized, attained, sought after, or pondered by the intellect — and yet he is absorbed. And to this excellent thoroughbred of a man, absorbed in this way, the gods, together with Indra, the Brahmas, & Pajapati, pay homage even from afar:", "entities": [[544, 551, "NORP"], [555, 563, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an11.010.than.html", "title": "Sandha Sutta", "para_seq": null}}
{"text": "\"Then his companions in the holy life admonish & instruct him, 'Friend, the Blessed One has said that sensual pleasures are of little satisfaction, of much stress, much despair, & greater drawbacks. The Blessed One has compared sensual pleasures to a chain of bones — of much stress, much despair, & greater drawbacks. He has compared sensual pleasures to a lump of flesh... a grass torch... a pit of glowing embers... a dream... borrowed goods... the fruits of a tree... a slaughterhouse... spears & swords... a poisonous snake — of much stress, much despair, & greater drawbacks. Find delight, friend, in the holy life. Don't declare your weakness in the training, renounce the training, or return to the lower life.'", "entities": [[76, 87, "PERSON"], [203, 214, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an05.076.than.html", "title": "Yodhajiva Sutta", "para_seq": null}}
{"text": "When this was said, Ven. Sariputta said to the Blessed One, \"It's amazing, lord. It's astounding, how well put that was by the Blessed One: 'Householder, you have provided the community of monks with robes, alms food, lodgings, & medicinal requisites for the sick, but you shouldn't rest content with the thought, \"We have provided the community of monks with robes, alms food, lodgings, & medicinal requisites for the sick.\" So you should train yourself, \"Let's periodically enter & remain in seclusion & rapture.\" That's how you should train yourself.'", "entities": [[20, 34, "PERSON"], [47, 58, "PERSON"], [127, 138, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an05.176.than.html", "title": "Piti Sutta", "para_seq": null}}
{"text": "Saying \"Good, friend,\" having delighted in and approved of Ven. Sariputta's words, the monks asked him a further question: \"Would there be another line of reasoning by which a disciple of the noble ones is a person of right view... who has arrived at this true Dhamma?\"", "entities": [[59, 73, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.009.than.html", "title": "Sammaditthi Sutta", "para_seq": null}}
{"text": "\"This, too, is called a footprint of the Tathagata, a scratch mark of the Tathagata, a tusk slash of the Tathagata. A disciple of the noble ones has not yet come to conclusion, but he comes to the conclusion, [4] 'The Blessed One is rightly self-awakened; the Dhamma is well-taught by the Blessed One; the Sangha of the Blessed One's disciples has practiced rightly.' [5]", "entities": [[41, 50, "PERSON"], [74, 83, "PERSON"], [105, 114, "PERSON"], [218, 229, "PERSON"], [289, 300, "PERSON"], [320, 331, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.027.than.html", "title": "Cula-hatthipadopama Sutta", "para_seq": null}}
{"text": "\"Wander, monks, in what is your proper range, your own ancestral territory. In one who wanders in what is his proper range, his own ancestral territory, Mara gains no opening, Mara gains no foothold. And what, for a monk, is his proper range, his own ancestral territory? The four frames of reference. Which four? There is the case where a monk remains focused on the body in & of itself — ardent, alert, & mindful — putting aside greed & distress with reference to the world. He remains focused on feelings in & of themselves... mind in & of itself... mental qualities in & of themselves — ardent, alert, & mindful — putting aside greed & distress with reference to the world. This, for a monk, is his proper range, his own ancestral territory.\"", "entities": [[153, 157, "PERSON"], [176, 180, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn47.007.than.html", "title": "Makkata Sutta", "para_seq": null}}
{"text": "\"Then you should train yourselves: 'We will be endowed with verified confidence in the Buddha: \"Indeed, the Blessed One [the Buddha] is worthy & rightly self-awakened, consummate in knowledge & conduct, well-gone, an expert with regard to the cosmos, unexcelled as a trainer for those people fit to be tamed, the Teacher of divine & human beings, awakened, blessed.\" \"'We will be endowed with verified confidence in the Dhamma: \"The Dhamma is well-expounded by the Blessed One, to be seen here & now, timeless, inviting verification, pertinent, to be realized by the wise for themselves.\"", "entities": [[87, 93, "PERSON"], [108, 119, "PERSON"], [125, 131, "PERSON"], [465, 476, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn41.010.than.html", "title": "Gilana Sutta", "para_seq": null}}
{"text": "\"He perceives water as water... fire as fire... wind as wind [1] ... beings as beings... gods as gods... Pajapati as Pajapati... Brahma as Brahma... the luminous gods as luminous gods... the gods of refulgent glory as gods of refulgent glory... the gods of abundant fruit as the gods of abundant fruit... the Conqueror as the Conqueror [2] ... the dimension of the infinitude of space as the dimension of the infinitude of space... the dimension of the infinitude of consciousness as the dimension of the infinitude of consciousness... the dimension of nothingness as the dimension of nothingness... the dimension of neither-perception-nor-non-perception as the dimension of neither-perception-nor-non-perception [3] ... the seen as the seen... the heard as the heard... the sensed as the sensed... the cognized as the cognized [4] ... singleness as singleness... multiplicity as multiplicity [5] ... the All as the All [6] ...", "entities": [[105, 113, "PERSON"], [117, 125, "PERSON"], [129, 135, "PERSON"], [139, 145, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.001.than.html", "title": "Mulapariyaya Sutta", "para_seq": null}}
{"text": "Ven. Susima heard that \"A large number of monks, it seems, have declared final gnosis in the Blessed One's presence: 'We discern that \"Birth is ended, the holy life fulfilled, the task done. There is nothing further for the sake of this world.\"'\" Then Ven. Susima went to those monks and, on arrival, exchanged courteous greetings with them. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to them, \"Is it true, as they say, that you have declared final gnosis in the Blessed One's presence: 'We discern that \"Birth is ended, the holy life fulfilled, the task done. There is nothing further for the sake of this world\"'?\"", "entities": [[93, 104, "PERSON"], [527, 538, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn12.070.than.html", "title": "Susima Sutta", "para_seq": null}}
{"text": "Then the thought occurred to Ven. Ananda , \"Here the Blessed One has just recovered from being ill, is not long recovered from his illness, and yet Mahanama the Sakyan asks him this very deep question. What if I were to take Mahanama the Sakyan to one side and teach him the Dhamma?\" So Ven. Ananda, taking Mahanama the Sakyan by the arm, led him to one side and said to him, \"Mahanama, the Blessed One has talked both of the virtue of one who is in training [a stream-winner, a once-returner, or a non-returner] and of the virtue of one whose training is complete [an arahant]. He has talked both of the concentration of one who is in training and of the concentration of one whose training is complete. He has talked both of the discernment of one who is in training and of the discernment of one whose training is complete.", "entities": [[34, 40, "PERSON"], [53, 64, "PERSON"], [292, 298, "PERSON"], [391, 402, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an03.073.than.html", "title": "Sakka Sutta", "para_seq": null}}
{"text": "When this was said, a certain monk addressed the Blessed One: \"What, lord, is the near shore? What is the far shore? What is sinking in the middle? What is being washed up on high ground? What is being snared by human beings? What is being snared by non-human beings? What is being snared by a whirlpool? What is becoming rotten inside?\"", "entities": [[49, 60, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn35.200.than.html", "title": "Daruka-khandha Sutta", "para_seq": null}}
{"text": "Then the nun — getting up from her bed, arranging her upper robe over one shoulder, and bowing down with her head at Ven. Ananda's feet — said, \"A transgression has overcome me, venerable sir, in that I was so foolish, so muddle-headed, and so unskilled as to act in this way. May my lord Ananda please accept this confession of my transgression as such, so that I may restrain myself in the future.\"", "entities": [[122, 128, "PERSON"], [289, 295, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an04.159.than.html", "title": "Bhikkhuni Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Vesali , in the Great Wood , at the Hall of the Gabled Pavilion. At that time Ven. Anuradha was staying not far from the Blessed One in a wilderness hut.", "entities": [[38, 49, "PERSON"], [67, 73, "GPE"], [188, 199, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn44.002.than.html", "title": "Anuradha Sutta", "para_seq": null}}
{"text": "\"So then, monks, I fabricated a fabrication of psychic power to the extent that Brahma, the Brahma assembly, and the attendants of the Brahma assembly heard my voice but did not see me. Having disappeared, I recited this verse:", "entities": [[80, 86, "PERSON"], [92, 98, "PERSON"], [135, 141, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.049.than.html", "title": "Brahma-nimantanika Sutta", "para_seq": null}}
{"text": "When this was said, a certain monk addressed the Blessed One: \"Lord, with regard to the property of light... the property of the cessation of feeling & perception: In dependence on what are these properties discerned?\"", "entities": [[49, 60, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn14.011.than.html", "title": "Sattadhatu Sutta", "para_seq": null}}
{"text": "Then Uttiya the wanderer went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to the Blessed One,", "entities": [[37, 48, "PERSON"], [220, 231, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an10.095.than.html", "title": "Uttiya Sutta", "para_seq": null}}
{"text": "On one occasion the Blessed One was staying near Savatthi , in Jeta's Grove, Anathapindika 's monastery. Then Rohitassa , the son of a deva, in the far extreme of the night, his extreme radiance lighting up the entirety of Jeta's Grove, went to the Blessed One. On arrival, having bowed down to the Blessed One, he stood to one side. As he was standing there he said to the Blessed One: \"Is it possible, lord, by traveling, to know or see or reach a far end of the cosmos where one does not take birth, age, die, pass away or reappear?\"", "entities": [[20, 31, "PERSON"], [49, 57, "GPE"], [63, 75, "LOC"], [77, 90, "PERSON"], [223, 235, "LOC"], [249, 260, "PERSON"], [299, 310, "PERSON"], [374, 385, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn02.026.than.html", "title": "Rohitassa Sutta", "para_seq": null}}
{"text": "So the brahmans went to the brahman student Assalayana and said to him, \"Master Assalayana, this Gotama the contemplative prescribes purity for the four castes. Come and dispute with him on this statement.\"", "entities": [[97, 103, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.093.than.html", "title": "Assalayana Sutta", "para_seq": null}}
{"text": "Then Janussonin the brahman went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there he said to the Blessed One: \"I am of the view & opinion that there is no one who, subject to death, is not afraid or in terror of death.\"", "entities": [[40, 51, "PERSON"], [222, 233, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an04.184.than.html", "title": "Abhaya Sutta", "para_seq": null}}
{"text": "\"Furthermore, the monk who is a learner reflects, 'Is there outside of this [doctrine & discipline] any brahman or contemplative who teaches the true, genuine, & accurate Dhamma like the Blessed One?' And he discerns, 'No, there is no brahman or contemplative outside of this doctrine & discipline who teaches the true, genuine, & accurate Dhamma like the Blessed One.' This too is a manner of reckoning whereby a monk who is a learner, standing at the level of a learner, can discern that 'I am a learner.'", "entities": [[187, 198, "PERSON"], [356, 367, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn48.053.than.html", "title": "Sekha Sutta", "para_seq": null}}
{"text": "\"Then the person without faith, without conviction, would say to the person with faith and with conviction: 'Sir, there is a charm called the Gandhari charm by which the monk wielded manifold psychic powers... exercising influence with his body even as far as the Brahma worlds.' What do you think, Kevatta — isn't that what the man without faith, without conviction, would say to the man with faith and with conviction?\"", "entities": [[264, 270, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.11.0.than.html", "title": "Kevatta (Kevaddha) Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion Ven. Ananda was staying near Vesali at Veluvagamaka. Now on that occasion Dasama the householder from Atthakanagara had arrived at Pataliputta on some business. Then he went to a certain monk at Kukkata Monastery and on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the monk, \"Where is Ven. Ananda staying now? I'd like to see him.\"", "entities": [[39, 45, "PERSON"], [63, 69, "GPE"], [366, 372, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.052.than.html", "title": "Atthakanagara Sutta", "para_seq": null}}
{"text": "\" Magnificent , lord! Magnificent! Just as if he were to place upright what was overturned, to reveal what was hidden, to show the way to one who was lost, or to carry a lamp into the dark so that those with eyes could see forms, in the same way has the Blessed One — through many lines of reasoning — made the Dhamma clear. I go to the Blessed One for refuge, to the Dhamma, and to the Community of monks. May the Blessed One remember me as a lay follower who has gone to him for refuge, from this day forward, for life.\"", "entities": [[254, 265, "PERSON"], [337, 348, "PERSON"], [415, 426, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn42.003.than.html", "title": "Yodhajiva Sutta", "para_seq": null}}
{"text": "\"Of one who does this, Mahanama, it is said: 'Among those who are out of tune, the disciple of the noble ones dwells in tune; among those who are malicious, he dwells without malice; having attained the stream of Dhamma, he develops the recollection of the Buddha.'", "entities": [[257, 263, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an11.012.than.html", "title": "Mahanama Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi at Jeta's Grove, Anathapindika's monastery. Then the Blessed One, picking up a little bit of dust with the tip of his fingernail, said to the monks, \"What do you think, monks? Which is greater: the little bit of dust I have picked up with the tip of my fingernail, or the great earth?\"", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [79, 91, "LOC"], [93, 106, "PERSON"], [129, 140, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn13.001.than.html", "title": "Nakhasikha Sutta", "para_seq": null}}
{"text": "\"Then there is the case of a person who gives a gift not seeking his own profit, not with a mind attached [to the reward], not seeking to store up for himself, nor [with the thought], 'I'll enjoy this after death.' Instead, he gives a gift with the thought, 'Giving is good.' He gives his gift — food, drink, clothing, a vehicle; a garland, perfume, & ointment; bedding, shelter, & a lamp — to a brahman or a contemplative. What do you think, Sariputta? Might a person give such a gift as this?\"", "entities": [[443, 452, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an07.049.than.html", "title": "Dana Sutta", "para_seq": null}}
{"text": "\"[ He reflects :] 'The Blessed One in a variety of ways criticizes & censures stealing... indulging in illicit sex... the telling of lies, and says, \"Abstain from the telling of lies.\" There are lies that I have told, to a greater or lesser extent. That was not right. That was not good. But if I become remorseful for that reason, that evil deed of mine will not be undone.' So, reflecting thus, he abandons right then the telling of lies, and in the future refrains from telling lies. This is how there comes to be the abandoning of that evil deed. This is how there comes to be the transcending of that evil deed.", "entities": [[23, 34, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn42.008.than.html", "title": "Sankha Sutta", "para_seq": null}}
{"text": "\"And what, Ananda, is another pleasure more extreme & refined than that? There is the case where a monk, with the complete transcending of the dimension of the infinitude of space, [perceiving,] 'Infinite consciousness,' enters & remains in the dimension of the infinitude of consciousness. This is another pleasure more extreme & refined than that. Though some might say, 'That is the highest pleasure that beings experience,' I would not grant them that. Why is that? Because there is another pleasure, more extreme & refined than that.", "entities": [[11, 17, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.059.than.html", "title": "Bahuvedaniya Sutta", "para_seq": null}}
{"text": "Then, having gone for alms in Vesali, after his meal, returning from his alms round, Ven. Ananda went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there, he said to the Blessed One: \"Just now, lord, in the early morning, having put on my robe and carrying my bowl and outer robe, I went into Vesali for alms. I saw a large number of Licchavi boys practicing archery in the stadium building. From a distance they were shooting arrows through a tiny keyhole without missing, one right after the other. On seeing this, the thought occurred to me 'How trained these Licchavi boys are, how well-trained these Licchavi boys are, in that from a distance they can shoot arrows through a tiny keyhole without missing, one right after the other!'\"", "entities": [[30, 36, "GPE"], [90, 96, "PERSON"], [109, 120, "PERSON"], [221, 232, "PERSON"], [344, 350, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn56.045.than.html", "title": "Vala Sutta", "para_seq": null}}
{"text": "The Blessed One said: \"Now, what is the noble purgative that always succeeds and never fails, a purgative whereby beings subject to birth are freed from birth; beings subject to aging are freed from aging; beings subject to death are freed from death; beings subject to sorrow, lamentation, pain, distress & despair are freed from sorrow, lamentation, pain, distress & despair?", "entities": [[4, 15, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an10.108.than.html", "title": "Virecana (Tikicchaka) Sutta", "para_seq": null}}
{"text": "\"If they insult and ridicule me, I will think, 'These Sunaparanta people are civilized, very civilized, in that they don't hit me with their hands.' That is what I will think, O Blessed One. That is what I will think, O One Well-gone.\"", "entities": [[178, 189, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn35.088.than.html", "title": "Punna Sutta", "para_seq": null}}
{"text": "\"Then is it the case, friend Sariputta, that the holy life is lived under the Blessed One with the purpose, 'May an action [whose result] is to be experienced when fully ripened be turned into an action [whose result] is to be experienced by me when not fully ripened?'\"", "entities": [[29, 38, "PERSON"], [78, 89, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an09.013.than.html", "title": "Kotthita Sutta", "para_seq": null}}
{"text": "\"'The cessation of becoming — Unbinding — the cessation of becoming — Unbinding': One perception arose in me, friend Ananda, as another perception ceased. Just as in a blazing woodchip fire, one flame arises as another flame ceases, even so, 'The cessation of becoming — Unbinding — the cessation of becoming — Unbinding': One perception arose in me as another one ceased. I was percipient at that time of 'The cessation of becoming — Unbinding.'\"", "entities": [[117, 123, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an10.007.than.html", "title": "Sariputta Sutta", "para_seq": null}}
{"text": "The Buliyans of Allakappa ... The Koliyans of Ramagama heard, \"The Blessed One, they say, has been totally unbound in Kusinara.\" So they sent an envoy to the Kusinara Mallans: \"The Blessed One was a noble warrior. We, too, are noble warriors. We deserve a share of the Blessed One's bone-relics. We, too, will build a burial mound and hold a ceremony for them.\"", "entities": [[67, 78, "PERSON"], [118, 126, "GPE"], [158, 166, "GPE"], [181, 192, "PERSON"], [269, 280, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}
{"text": "The Blessed One said: \"Develop concentration, monks. A concentrated monk discerns in line with what has come into being. And what does he discern in line with what has come into being? The origination & disappearance of form. The origination & disappearance of feeling... perception... fabrications. The origination & disappearance of consciousness.", "entities": [[4, 15, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn22.005.than.html", "title": "Samadhi Sutta", "para_seq": null}}
{"text": "\"Thus, when asked about a fruit of the contemplative life, visible here and now, Nigantha Nataputta answered with fourfold restraint. Just as if a person, when asked about a mango, were to answer with a breadfruit; or, when asked about a breadfruit, were to answer with a mango: In the same way, when asked about a fruit of the contemplative life, visible here and now, Nigantha Nataputta answered with fourfold restraint. The thought occurred to me: 'How can anyone like me think of disparaging a brahman or contemplative living in his realm?' Yet I neither delighted in Nigantha Nataputta's words nor did I protest against them. Neither delighting nor protesting, I was dissatisfied. Without expressing dissatisfaction, without accepting his teaching, without adopting it, I got up from my seat and left.", "entities": [[81, 99, "PERSON"], [370, 388, "PERSON"], [572, 590, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.02.0.than.html", "title": "Samaññaphala Sutta", "para_seq": null}}
{"text": "\"Furthermore, the monk reminds himself of this: At present I am free from illness and discomfort, endowed with good digestion: not too cold, not too hot, of medium strength and tolerance. The time will come, though, when this body is beset with illness. When one is overcome with illness, it is not easy to pay attention to the Buddha's teachings. It is not easy to reside in isolated forest or wilderness dwellings. Before this unwelcome, disagreeable, displeasing thing happens, let me first make an effort for the attaining of the as-yet-unattained, the reaching of the as-yet-unreached, the realization of the as-yet-unrealized, so that — endowed with that Dhamma — I will live in peace even when ill.", "entities": [[328, 334, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an05.078.than.html", "title": "Anagata-bhayani Sutta", "para_seq": null}}
{"text": "\"A transgression has overcome me, lord, in that I was so foolish, so muddle-headed, and so unskilled as to kill my father — a righteous man, a righteous king — for the sake of sovereign rulership. May the Blessed One please accept this confession of my transgression as such, so that I may restrain myself in the future.\"", "entities": [[205, 216, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.02.0.than.html", "title": "Samaññaphala Sutta", "para_seq": null}}
{"text": "On one occasion the Blessed One was staying near Alavi on a spread of leaves by a cattle track in a simsapa forest. Then Hatthaka of Alavi , out roaming & rambling for exercise, saw the Blessed One sitting on a spread of leaves by the cattle track in the simsapa forest. On seeing him, he went to him and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the Blessed One, \"Lord, I hope the Blessed One has slept in ease.\"", "entities": [[20, 31, "PERSON"], [186, 197, "PERSON"], [400, 411, "PERSON"], [431, 442, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an03.034.than.html", "title": "Hatthaka Sutta", "para_seq": null}}
{"text": "Then in the early morning, a large number of monks, having put on their robes and carrying their bowls & outer robes, went into Savatthi for alms. Having gone for alms in Savatthi, after the meal, returning from their alms round, they went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As they were sitting there, they said to the Blessed One: \"Just now, lord, King Ajatasattu of Magadha, the son of Queen Videha, raising a fourfold army, marched toward Kasi against King Pasenadi Kosala. King Pasenadi heard, 'King Ajatasattu of Magadha, the son of Queen Videha, they say, has raised a fourfold army and is marching toward Kasi against me.' So King Pasenadi, raising a fourfold army, launched a counter-attack toward Kasi against King Ajatasattu. Then King Ajatasattu & King Pasenadi fought a battle, and in that battle King Ajatasattu defeated King Pasenadi. King Pasenadi, defeated, marched back to his capital at Savatthi.\"", "entities": [[128, 136, "GPE"], [171, 179, "GPE"], [247, 258, "PERSON"], [364, 375, "PERSON"], [399, 409, "PERSON"], [413, 420, "GPE"], [433, 445, "PERSON"], [487, 491, "GPE"], [500, 520, "PERSON"], [522, 535, "PERSON"], [549, 559, "PERSON"], [563, 570, "GPE"], [583, 595, "PERSON"], [657, 661, "GPE"], [678, 691, "PERSON"], [751, 755, "GPE"], [769, 779, "PERSON"], [791, 801, "PERSON"], [804, 817, "PERSON"], [859, 869, "PERSON"], [879, 892, "PERSON"], [894, 907, "PERSON"], [950, 958, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn03.014.than.html", "title": "Sangama Sutta", "para_seq": null}}
{"text": "The Blessed One said: \"A woman attends inwardly to her feminine faculties, her feminine gestures, her feminine manners, feminine poise, feminine desires, feminine voice, feminine charms. She is excited by that, delighted by that. Being excited & delighted by that, she attends outwardly to masculine faculties, masculine gestures, masculine manners, masculine poise, masculine desires, masculine voices, masculine charms. She is excited by that, delighted by that. Being excited & delighted by that, she wants to be bonded to what is outside her, wants whatever pleasure & happiness that arise based on that bond. Delighting, caught up in her femininity, a woman goes into bondage with reference to men. This is how a woman does not transcend her femininity.", "entities": [[4, 15, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an07.048.than.html", "title": "Saññoga Sutta", "para_seq": null}}
{"text": "\"Precisely this noble eightfold path — right view, right resolve, right speech, right action, right livelihood, right effort, right mindfulness, right concentration: This, friend Visakha, is the way of practice leading to the cessation of self-identification described by the Blessed One.\"", "entities": [[179, 186, "PERSON"], [276, 287, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.044.than.html", "title": "Culavedalla Sutta", "para_seq": null}}
{"text": "\"Certainly, brahman, the Bamboo Grove is delightful, quiet, free of noise, with an air of isolation, remote from human beings, & appropriate for retreat because of guardians & protectors like yourself.\"", "entities": [[25, 37, "LOC"]], "meta": {"nikaya": "MN", "identifier": "mn.108.than.html", "title": "Gopaka Moggallana Sutta", "para_seq": null}}
{"text": "At Savatthi. \"Monks, any desire-passion with regard to forms is a defilement of the mind. Any desire-passion with regard to sounds... aromas... flavors... tactile sensations... ideas is a defilement of the mind. When, with regard to these six bases, the defilements of awareness are abandoned, then the mind is inclined to renunciation. The mind fostered by renunciation feels malleable for the direct knowing of those qualities worth realizing.\"", "entities": [[3, 11, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn27.001-010.than.html", "title": "Upakkilesa Samyutta", "para_seq": null}}
{"text": "The Blessed One acquiesced with silence. Sensing his acquiescence, the Kapilavatthu Sakyans got up from their seats, bowed down to him, circumambulated him, and then went to the new reception hall. On arrival, they spread it all over with felt rugs, arranged seats, set out a water vessel, and raised an oil lamp. Then they went to the Blessed One and, on arrival, having bowed down, stood to one side. As they were standing there they said to him, \"Lord, the reception hall has been covered all over with felt rugs, seats have been arranged, a water vessel has been set out, and an oil lamp raised. It is now time for the Blessed One to do as he sees fit.\"", "entities": [[4, 15, "PERSON"], [71, 83, "GPE"], [336, 347, "PERSON"], [623, 634, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.053.than.html", "title": "Sekha-patipada Sutta", "para_seq": null}}
{"text": "\"Excellent, Mahanama, excellent! It is fitting for clansmen like you to approach the Tathagata and ask, 'For those of us living by means of various dwelling places [for the mind], by means of which dwelling place should we live?'", "entities": [[85, 94, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an11.012.than.html", "title": "Mahanama Sutta", "para_seq": null}}
{"text": "Then the monks neither delighted in the words of the wanderers of other sects, nor did they reject them. Without delighting or rejecting, they got up from their seats and left, (thinking,) \"We will learn the meaning of these words in the presence of the Blessed One.\"", "entities": [[254, 265, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn46.054.than.html", "title": "Metta Sutta", "para_seq": null}}
{"text": "Responding, \"As you say, good sirs,\" to the groups & factions, Dona the brahman divided the Blessed One's bone-relics into eight equal shares and then said to the groups & factions, \"Good sirs, give me this urn. I will build a burial mound and hold a ceremony for the urn.\" They gave him the urn.", "entities": [[92, 103, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}
{"text": "\"He is absorbed dependent neither on earth, liquid, fire, wind, the sphere of the infinitude of space, the sphere of the infinitude of consciousness, the sphere of nothingness, the sphere of neither perception nor non-perception, this world, the next world, nor on whatever is seen, heard, sensed, cognized, attained, sought after, or pondered by the intellect — and yet he is absorbed. And to this excellent thoroughbred of a man, absorbed in this way, the gods, together with Indra , the Brahmas, & Pajapati , pay homage even from afar:", "entities": [[490, 497, "NORP"], [501, 509, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an11.010.than.html", "title": "Sandha Sutta", "para_seq": null}}
{"text": "\"Now, Ānanda, in the case where the contemplative or brahman says, 'So there really are no evil actions, there really is no result of misconduct,' I don't allow him that. But when he says, 'For I saw the case where a person who took life... & held wrong view, with the breakup of the body, after death, has reappeared in a good destination, a heavenly world,' I do allow him that. But when he says, 'Anyone who takes life... & hold wrong view: They all, on the breakup of the body, after death, reappear in a good destination, a heavenly world,' I don't allow him that. And when he says, 'Whoever knows this, knows rightly. Whoever knows otherwise, their knowledge is wrong,' I don't allow him that. When, insisting through obstinacy & grasping right there on what was seen by himself, known by himself, understood by himself, he states: 'Only this is true. Everything otherwise is worthless,' I don't allow him that, either. Why is that? Because the Tathāgata's knowledge with regard to the greater analysis of action is otherwise.", "entities": [[6, 12, "PERSON"], [951, 960, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.136.than.html", "title": "Maha Kammavibhanga Sutta", "para_seq": null}}
{"text": "\"Being asked in this way, the wanderers of other sects will be unable to respond and, on top of that, will fall into vexation. Why is that? Because it lies beyond their range. Monks, don't see anyone in this cosmos — with its devas, Maras, and Brahmas, with its people with their contemplatives & brahmans, their royalty & commonfolk — who would satisfy the mind with their answer to these questions, aside from the Tathagata, a disciple of the Tathagata, or one who had heard it from them.", "entities": [[233, 238, "NORP"], [244, 251, "NORP"], [416, 425, "PERSON"], [445, 454, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn46.054.than.html", "title": "Metta Sutta", "para_seq": null}}
{"text": "\"Then again the monk, with the fading of rapture, he remains equanimous, mindful, & alert, and senses pleasure with the body. He enters & remains in the third jhana, of which the Noble Ones declare, 'Equanimous & mindful, he has a pleasant abiding.' This monk is said to have blinded Mara. Trackless, he has destroyed Mara's vision and has become invisible to the Evil One.", "entities": [[284, 288, "PERSON"], [318, 322, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.026.than.html", "title": "Ariyapariyesana Sutta", "para_seq": null}}
{"text": "At Savatthi . There the Blessed One said: \"From an inconstruable beginning comes transmigration. A beginning point is not evident, though beings hindered by ignorance and fettered by craving are transmigrating & wandering on. When you see someone who is happy & well-provided in life, you should conclude: 'We, too, have experienced just this sort of thing in the course of that long, long time.'", "entities": [[3, 11, "GPE"], [24, 35, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn15.012.than.html", "title": "Sukhita Sutta", "para_seq": null}}
{"text": "\" Magnificent , lord! Magnificent! Just as if he were to place upright what was overturned, to reveal what was hidden, to show the way to one who was lost, or to carry a lamp into the dark so that those with eyes could see forms, in the same way the has Blessed One — through many lines of reasoning — made the Dhamma clear. I go to the Blessed One for refuge, to the Dhamma, and to the Community of monks. May the Blessed One remember me as a lay follower who has gone to him for refuge, from this day forward, for life.\"", "entities": [[254, 265, "PERSON"], [337, 348, "PERSON"], [415, 426, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an06.047.than.html", "title": "Sanditthika Sutta", "para_seq": null}}
{"text": "Now at that time Subhadda the Wanderer was staying in Kusinara. He heard, \"Tonight, in the last watch of the night, the total Unbinding of Gotama the contemplative will take place.\" Then the thought occurred to him: \"I have heard the elder wanderers, teachers of teachers, saying that only once in a long, long time do Tathagatas — worthy ones, rightly self-awakened — appear in the world. Tonight, in the last watch of the night, the total Unbinding of Gotama the contemplative will occur. Now there is a doubt that has arisen in me, but I have faith that he could teach me the Dhamma in such a way that I might abandon that doubt.\"", "entities": [[54, 62, "GPE"], [139, 145, "PERSON"], [454, 460, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}
{"text": "Then a certain monk went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the Blessed One, \"'One who dwells in the Dhamma, one who dwells in the Dhamma': thus it is said, lord. To what extent is a bhikkhu one who dwells in the Dhamma?\"", "entities": [[32, 43, "PERSON"], [143, 154, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an05.073.than.html", "title": "Dhamma-viharin Sutta", "para_seq": null}}
{"text": "\"There is the case where in any assembly when discourses that are literary works — the works of poets, artful in sound, artful in rhetoric, the work of outsiders, words of disciples — are recited, the monks don't listen, don't lend ear, don't set their hearts on knowing them; don't regard them as worth grasping or mastering. But when the discourses of the Tathagata — deep, deep in their meaning, transcendent, connected with emptiness — are recited, they listen, they lend ear, they set their hearts on knowing them; they regard them as worth grasping & mastering. And when they have mastered that Dhamma, they cross-question one another about it and dissect it: 'How is this? What is the meaning of this?' They make open what isn't open, make plain what isn't plain, dispel doubt on its various doubtful points. This is called an assembly trained in cross-questioning and not in bombast.\"", "entities": [[358, 367, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an02.046.than.html", "title": "Ukkacita Sutta", "para_seq": null}}
{"text": "\"If a man is one who takes life, lord, then taking into consideration time spent doing & not doing, whether by day or by night, then the time he spends taking life is less, and the time he spends not taking life is certainly more. If it's true that 'Whatever one keeps doing frequently, by that is one led [to a state of rebirth],' then no one is destined for a state of deprivation or destined to hell in line with Nigantha Nataputta's words.\"", "entities": [[416, 434, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn42.008.than.html", "title": "Sankha Sutta", "para_seq": null}}
{"text": "Then Pañcakanga the carpenter went to Ven. Udayin and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to Ven. Udayin, \"Venerable sir, how many feelings has the Blessed One spoken of?\"", "entities": [[200, 211, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn36.019.than.html", "title": "Pañcakanga Sutta", "para_seq": null}}
{"text": "Then Ven. Upasena said, \"Quick, friends, lift this body of mine onto a couch and carry it outside before it is scattered like a fistful of chaff! Friend Sariputta, in anyone who had the thought, 'I am the eye' or 'The eye is mine,' 'I am the ear' or 'The ear is mine,' 'I am the nose' or 'The nose is mine,' 'I am the tongue' or 'The tongue is mine,' 'I am the body or 'The body is mine,' 'I am the intellect' or 'The intellect is mine': in him there would be an alteration in his body or a change in his faculties. But as for me, the thought does not occur to me that 'I am the eye' or 'The eye is mine,'... 'I am the tongue' or 'The tongue is mine,'... 'I am the intellect' or 'The intellect is mine.' So what alteration should there be in my body, what change should there be in my faculties?\"", "entities": [[153, 162, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn35.069.than.html", "title": "Upasena Sutta", "para_seq": null}}
{"text": "When this was said, the brahman student Assalayana said to the Blessed One: \" Magnificent , Master Gotama! Magnificent! Just as if he were to place upright what was overturned, to reveal what was hidden, to show the way to one who was lost, or to carry a lamp into the dark so that those with eyes could see forms, in the same way has Master Gotama — through many lines of reasoning — made the Dhamma clear. I go to Master Gotama for refuge, to the Dhamma, and to the Sangha of monks. May Master Gotama remember me as a lay follower who has gone to him for refuge, from this day forward, for life.\"", "entities": [[63, 74, "PERSON"], [99, 105, "PERSON"], [342, 348, "PERSON"], [423, 429, "PERSON"], [496, 502, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.093.than.html", "title": "Assalayana Sutta", "para_seq": null}}
{"text": "Responding, \"As you say, venerable sir,\" Prince Abhaya got up from his seat, bowed down to Nigantha Nataputta, circumambulated him, and then went to the Blessed One. On arrival, he bowed down to the Blessed One and sat to one side. As he was sitting there, he glanced up at the sun and thought, \"Today is not the time to refute the Blessed One's words. Tomorrow in my own home I will overturn the Blessed One's words.\" So he said to the Blessed One, \"May the Blessed One, together with three others, acquiesce to my offer of tomorrow's meal.\"", "entities": [[91, 109, "PERSON"], [153, 164, "PERSON"], [199, 210, "PERSON"], [332, 343, "PERSON"], [397, 408, "PERSON"], [437, 448, "PERSON"], [459, 470, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.058.than.html", "title": "Abhaya Sutta", "para_seq": null}}
{"text": "So the monks went to Ven. Maha Kaccana and, on arrival exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, they sat to one side. As they were sitting there, they [told him what had happened, and added,] \"Analyze the meaning, Ven. Maha Kaccana!\"", "entities": [[31, 38, "PERSON"], [277, 284, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.018.than.html", "title": "Madhupindika Sutta", "para_seq": null}}
{"text": "When this was said, Dasama the householder from Atthakanagara said to Ven. Ananda, \"Venerable Ananda, just as if a man seeking a single opening onto treasure were all at once to come upon eleven openings onto treasure, in the same way I — seeking a single doorway to the Deathless — have all at once come to hear of eleven doorways to the Deathless. And just as if a man whose house had eleven doors could take himself to safety by means of any one of those doors, in the same way I can take myself to safety by means of any one of these eleven doors to the Deathless. Venerable sir, when sectarians search for a teacher's fee for their teachers, why shouldn't I pay homage to Ven. Ananda?\"", "entities": [[75, 81, "PERSON"], [94, 100, "PERSON"], [682, 688, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.052.than.html", "title": "Atthakanagara Sutta", "para_seq": null}}
{"text": "\"For one who doesn't love consciousness, who isn't fond of consciousness, who doesn't cherish consciousness, who knows & sees, as it actually is present, the cessation of consciousness, the thought, 'The Tathagata exists after death' or 'The Tathagata does not exist after death' or 'The Tathagata both exists and does not exist after death' or 'The Tathagata neither exists nor does not exist after death' doesn't occur.", "entities": [[204, 213, "PERSON"], [242, 251, "PERSON"], [288, 297, "PERSON"], [350, 359, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn44.006.than.html", "title": "Sariputta-Kotthita Sutta", "para_seq": null}}
{"text": "\"The Tathagata — the worthy one, the rightly self-awakened one, who from disenchantment with feeling... perception... fabrication, from dispassion, from cessation, from lack of clinging (for feeling... perception... fabrication) is released — is termed 'rightly self-awakened.' And a discernment-released monk — who from disenchantment with feeling... perception... fabrication, from dispassion, from cessation, from lack of clinging (for feeling... perception... fabrication) is released — is termed 'discernment-released.'", "entities": [[5, 14, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn22.058.than.html", "title": "Buddha Sutta", "para_seq": null}}
{"text": "As they were sitting there, the wanderers of other sects said to them, \"Friends, Gotama the contemplative teaches the Dhamma to his disciples in this way: 'Come, monks — abandoning the five hindrances, the corruptions of awareness that weaken discernment — keep pervading the first direction [the east] with an awareness imbued with good will, likewise the second, likewise the third, likewise the fourth. Thus above, below, & all around, everywhere, in its entirety, keep pervading the all-encompassing cosmos with an awareness imbued with good will — abundant, expansive, immeasurable, without hostility, without ill will.", "entities": [[81, 87, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn46.054.than.html", "title": "Metta Sutta", "para_seq": null}}
{"text": "When this was said, Magandiya the wanderer said, \" Magnificent , Master Gotama! Magnificent! Just as if he were to place upright what was overturned, to reveal what was hidden, to point out the way to one who was lost, or to carry a lamp into the dark so that those with eyes could see forms, in the same way has Master Gotama — through many lines of reasoning — made the Dhamma clear. I go to Master Gotama for refuge, to the Dhamma, & to the community of monks. Let me obtain the going forth in Master Gotama's presence, let me obtain admission.\"", "entities": [[72, 78, "PERSON"], [320, 326, "PERSON"], [401, 407, "PERSON"], [504, 510, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.075x.than.html", "title": "Magandiya Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery. Now on that occasion Uggahamana , a follower of Mundika the contemplative, [1] together with a large following of about 500 wanderers, had taken up residence in the debating hall near the Tinduka tree in the single-pavilion park of Queen Mallika . Then Pañcakanga the carpenter left Savatthi in the middle of the day to see the Blessed One, but the thought occurred to him, \"Now is not the right time to see the Blessed One, for he is in seclusion. And it is not the right time to see the mind-developing monks, for they too are in seclusion. Why don't I go to the debating hall near the Tinduka tree in the single-pavilion park of Queen Mallika to see Uggahamana, a follower of Mundika the contemplative?\" So he headed to the debating hall near the Tinduka tree in the single-pavilion park of Queen Mallika.", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [79, 91, "LOC"], [93, 106, "PERSON"], [352, 365, "PERSON"], [403, 411, "GPE"], [448, 459, "PERSON"], [532, 543, "PERSON"], [752, 765, "PERSON"], [914, 927, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.078.than.html", "title": "Samana-Mundika Sutta", "para_seq": null}}
{"text": "\"As you say, lord,\" Ven. Nandaka replied. Then, after the night had passed, early in the morning, having put on his robes and carrying his bowl & outer robe, he went into Rajagaha for alms ... [as before, from \"Then the Blessed One addressed Ven. Nandaka\" up to:]", "entities": [[171, 179, "GPE"], [220, 231, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.146.than.html", "title": "Nandakovada Sutta", "para_seq": null}}
{"text": "\"Well, Aggivessana, there are more than many in the world who say, 'It would still be the same, it would still be the same,' yet they both do not abandon that view and they cling to another view. There are fewer than few in the world who say, 'It would still be the same, it would still be the same,' and they both abandon that view and do not cling to another view.", "entities": [[7, 18, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.074.than.html", "title": "Dighanaka Sutta", "para_seq": null}}
{"text": "When this was said, a certain monk said to the Blessed One, \"In what way would a monk set on this — 'It should not be, it should not occur to me; it will not be, it will not occur to me' — break the [five] lower fetters?\"", "entities": [[47, 58, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn22.055.than.html", "title": "Udana Sutta", "para_seq": null}}
{"text": "\"Then Mara, the Evil One, taking possession of an attendant of the Brahma assembly, said to me, 'If, good sir, this is what you discern, if this is what you have awakened to, do not lead (lay) disciples or those gone forth. Do not teach the Dhamma to (lay) disciples or those gone forth. Do not yearn for (lay) disciples or those gone forth. There were, good sir, before your time, brahmans & contemplatives in the world who claimed to be worthy & rightly self-awakened. They led (lay) disciples & those gone forth. They taught the Dhamma to (lay) disciples & those gone forth. They yearned for (lay) disciples & those gone forth. Having led (lay) disciples & those gone forth, having taught the Dhamma to (lay) disciples & those gone forth, having yearned for (lay) disciples & those gone forth, they — on the break-up of the body, with the cutting off of life — were established in a coarse body.", "entities": [[6, 10, "PERSON"], [67, 73, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.049.than.html", "title": "Brahma-nimantanika Sutta", "para_seq": null}}
{"text": "At Savatthi. Then King Pasenadi Kosala went to the Blessed One in the middle of the day and, on arrival, having bowed down to the Blessed One, sat to one side. As he was sitting there the Blessed One said to him, \"Well now, great king, where are you coming from in the middle of the day?\"", "entities": [[3, 11, "GPE"], [18, 38, "PERSON"], [51, 62, "PERSON"], [130, 141, "PERSON"], [188, 199, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn03.019.than.html", "title": "Aputtaka Sutta", "para_seq": null}}
{"text": "\"A householder or householder's son, hearing the Dhamma, gains conviction in the Tathagata and reflects: ' Household life is confining , a dusty path. The life gone forth is like the open air. It is not easy living at home to practice the holy life totally perfect, totally pure, like a polished shell . What if I were to shave off my hair & beard, put on the ochre robes, and go forth from the household life into homelessness?'", "entities": [[81, 90, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.12.0.than.html", "title": "Lohicca Sutta", "para_seq": null}}
{"text": "When this was said, the elder monks said to Ven. Khemaka, \"We didn't cross-examine Ven. Khemaka with the purpose of troubling him, just that [we thought] Ven. Khemaka is capable of declaring the Blessed One's message, teaching it, describing it, setting it forth, revealing it, explaining it, making it plain — just as he has in fact declared it, taught it, described it, set it forth, revealed it, explained it, made it plain.\"", "entities": [[195, 206, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn22.089.than.html", "title": "Khemaka Sutta", "para_seq": null}}
{"text": "Now at that time Susima the wanderer was living in Rajagaha with a large following of wanderers. And so Susima's following of wanderers said to him, \"Come now, friend Susima. Go live the holy life under Gotama the contemplative. When you have completely mastered the Dhamma, tell it to us; when we have completely mastered it, we will teach it to householders and then we, too, will be worshipped, revered, honored, venerated, given homage; we too will become recipients of robes, almsfood, lodgings, & medical requisites for the sick.\"", "entities": [[51, 59, "GPE"], [203, 209, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn12.070.than.html", "title": "Susima Sutta", "para_seq": null}}
{"text": "\"Now, lady, when asked if the Tathagata exists after death, you say, 'That has not been declared by the Blessed One: \"The Tathagata exists after death.\"' When asked if the Tathagata does not exist after death... both exists and does not exist after death... neither exists nor does not exist after death, you say, 'That too has not been declared by the Blessed One: \"The Tathagata neither exists nor does not exist after death.\"' Now, what is the cause, what is the reason, why that has not been declared by the Blessed One?\"", "entities": [[30, 39, "PERSON"], [104, 115, "PERSON"], [122, 131, "PERSON"], [172, 181, "PERSON"], [353, 364, "PERSON"], [371, 380, "PERSON"], [512, 523, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn44.001.than.html", "title": "Khema Sutta", "para_seq": null}}
{"text": "\"Yes, Sariputta, there would be the case where a person gives a gift of a certain sort and it does not bear great fruit or great benefit, whereas another person gives a gift of the same sort and it bears great fruit and great benefit.\"", "entities": [[6, 15, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an07.049.than.html", "title": "Dana Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying at Savatthi in the Eastern Monastery, the palace of Migara 's mother, together with many well-known elder disciples — with Ven. Sariputta , Ven. Maha Moggallana , Ven. Maha Kassapa , Ven. Maha Kaccana , Ven. Maha Kotthita , Ven. Maha Kappina , Ven. Maha Cunda , Ven. Revata , Ven. Ananda , and other well-known elder disciples. On that occasion the elder monks were teaching & instructing. Some elder monks were teaching & instructing ten monks, some were teaching & instructing twenty monks, some were teaching & instructing thirty monks, some were teaching & instructing forty monks. The new monks, being taught & instructed by the elder monks, were discerning grand, successive distinctions.", "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [185, 199, "PERSON"], [212, 222, "PERSON"], [255, 262, "PERSON"], [316, 321, "PERSON"], [343, 349, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.118.than.html", "title": "Anapanasati Sutta", "para_seq": null}}
{"text": "[6] \"Furthermore, you should recollect the devas : 'There are the Devas of the Four Great Kings, the Devas of the Thirty-three, the Devas of the Hours, the Contented Devas, the devas who delight in creation, the devas who have power over the creations of others, the devas of Brahma's retinue, the devas beyond them. Whatever conviction they were endowed with that — when falling away from this life — they re-arose there, the same sort of conviction is present in me as well. Whatever virtue they were endowed with that — when falling away from this life — they re-arose there, the same sort of virtue is present in me as well. Whatever learning they were endowed with that — when falling away from this life — they re-arose there, the same sort of learning is present in me as well. Whatever generosity they were endowed with that — when falling away from this life — they re-arose there, the same sort of generosity is present in me as well. Whatever discernment they were endowed with that — when falling away from this life — they re-arose there, the same sort of discernment is present in me as well.' At any time when a disciple of the noble ones is recollecting the conviction, virtue, learning, generosity, and discernment found both in himself and the devas, his mind is not overcome with passion, not overcome with aversion, not overcome with delusion. His mind heads straight, based on the [qualities of the] devas. And when the mind is headed straight, the disciple of the noble ones gains a sense of the goal, gains a sense of the Dhamma, gains joy connected with the Dhamma. In one who is joyful, rapture arises. In one who is rapturous, the body grows calm. One whose body is calmed experiences ease. In one at ease, the mind becomes concentrated.", "entities": [[79, 95, "NORP"], [276, 282, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an11.013.than.html", "title": "Mahanama Sutta", "para_seq": null}}
{"text": "Then Anathapindika the householder went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there the Blessed One said to him: \"These five things, householder, are welcome, agreeable, pleasant, & hard to obtain in the world. Which five?", "entities": [[5, 18, "PERSON"], [47, 58, "PERSON"], [147, 158, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an05.043.than.html", "title": "Ittha Sutta", "para_seq": null}}
{"text": "As he was sitting there, he said to Ven. Ananda: \"Master Ananda, is there any one monk endowed in each & every way with the qualities with which Master Gotama — worthy & rightly self-awakened — was endowed?\"", "entities": [[41, 47, "PERSON"], [57, 63, "PERSON"], [152, 158, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.108.than.html", "title": "Gopaka Moggallana Sutta", "para_seq": null}}
{"text": "That is what the Blessed One said. Gratified, the monks delighted in the Blessed One's words. And while this explanation was being given, the minds of the thirty monks from Pava — through lack of clinging — were released from fermentations.", "entities": [[17, 28, "PERSON"], [73, 84, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn15.013.than.html", "title": "Timsa Sutta", "para_seq": null}}
{"text": "\"If anyone were to say with regard to a monk whose mind is thus released that 'The Tathagata exists after death,' is his view, that would be mistaken; that 'The Tathagata does not exist after death'... that 'The Tathagata both exists and does not exist after death'... that 'The Tathagata neither exists nor does not exist after death' is his view, that would be mistaken. Why? Having directly known the extent of designation and the extent of the objects of designation, the extent of expression and the extent of the objects of expression, the extent of description and the extent of the objects of description, the extent of discernment and the extent of the objects of discernment, the extent to which the cycle revolves: Having directly known that, the monk is released. [To say that,] 'The monk released, having directly known that, does not see, does not know is his opinion,' that would be mistaken. [1]", "entities": [[83, 92, "PERSON"], [161, 170, "PERSON"], [212, 221, "PERSON"], [279, 288, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.15.0.than.html", "title": "Maha-nidana Sutta", "para_seq": null}}
{"text": "Staying at Savatthi... [the Blessed One said,] \"From ignorance as a requisite condition come fabrications... From birth as a requisite condition, then aging-&-death, sorrow, lamentation, pain, distress, & despair come into play. Such is the origination of this entire mass of stress & suffering.\"", "entities": [[11, 19, "GPE"], [28, 39, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn12.035.than.html", "title": "Avijjapaccaya Sutta", "para_seq": null}}
{"text": "\"Even though Master Gotama says that, still the brahmans think, 'Brahmans are the superior caste... Only brahmans are pure, not non-brahmans. Only brahmans are the sons & offspring of Brahma: born of his mouth, born of Brahma, created by Brahma, heirs of Brahma.'\"", "entities": [[20, 26, "PERSON"], [184, 190, "PERSON"], [219, 225, "PERSON"], [238, 244, "PERSON"], [255, 261, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.093.than.html", "title": "Assalayana Sutta", "para_seq": null}}
{"text": "Then a large number of wandering sectarians went to Ven. Anuradha and on arrival exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, they sat to one side. As they were sitting there, they said to Ven. Anuradha, \"Friend Anuradha, the Tathagata — the supreme man, the superlative man, attainer of the superlative attainment — being described, is described with [one of] these four positions: The Tathagata exists after death, does not exist after death, both does & does not exist after death, neither exists nor does not exist after death.\"", "entities": [[275, 284, "PERSON"], [436, 445, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn22.086.than.html", "title": "Anuradha Sutta", "para_seq": null}}
{"text": "\"Monk, it's not easy for us to go to the Blessed One, as he is surrounded by other devas of great influence. But if you go to the Blessed One and ask him this matter, I will come along to hear the Dhamma.\"", "entities": [[41, 52, "PERSON"], [130, 141, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn01.020.than.html", "title": "Samiddhi Sutta", "para_seq": null}}
{"text": "On one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery. Then, early in the morning, a large number of monks adjusted their under robes and — carrying their bowls & robes — went into Savatthi for alms. Then the thought occurred to them, \"It's still too early to go for alms in Savatthi. Why don't we go to the park of the wanderers of other sects?\"", "entities": [[20, 31, "PERSON"], [49, 57, "GPE"], [61, 73, "LOC"], [75, 88, "PERSON"], [228, 236, "GPE"], [322, 330, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn46.053.than.html", "title": "Aggi Sutta", "para_seq": null}}
{"text": "Dwelling at Savatthi ... \"Monks, before my Awakening, when I was just an unawakened Bodhisatta, the realization came to me: 'How this world has fallen on difficulty! It is born, it ages, it dies, it falls away & rearises, but it does not discern the escape from this stress, from this aging & death. O when will it discern the escape from this stress, from this aging & death?'", "entities": [[12, 20, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn12.065.than.html", "title": "Nagara Sutta", "para_seq": null}}
{"text": "Responding, \"As you say, sir,\" to the brahman Lohicca, Rosika the barber went to the Blessed One and, on arrival, bowing down to him, stood to one side. As he was standing there, he announced the time, [saying,] \"It is time, lord. The meal is ready.\"", "entities": [[46, 53, "PERSON"], [85, 96, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.12.0.than.html", "title": "Lohicca Sutta", "para_seq": null}}
{"text": "\"Furthermore, with the complete transcending of the dimension of nothingness, Sariputta entered & remained in the dimension of neither perception nor non-perception. He emerged mindfully from that attainment. On emerging mindfully from that attainment, he regarded the past qualities that had ceased & changed: 'So this is how these qualities, not having been, come into play. Having been, they vanish.' He remained unattracted & unrepelled with regard to those qualities, independent, detached, released, dissociated, with an awareness rid of barriers. He discerned that 'There is a further escape,' and pursuing it there really was for him. [4]", "entities": [[78, 87, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.111.than.html", "title": "Anupada Sutta", "para_seq": null}}
{"text": "\"Aggivessana, [3] the Blessed One disciplines his disciples in this way; this part of the Blessed One's instruction is generally presented to his disciples: 'Form is inconstant. Feeling is inconstant. Perception is inconstant. Fabrications are inconstant. Consciousness is inconstant. Form is not-self. Feeling is not-self. Perception is not-self. Fabrications are not-self. Consciousness is not-self. All fabrications are inconstant. All phenomena are not-self.' This, Aggivessana, is the way in which the Blessed One disciplines his disciples; this part of the Blessed One's instruction is generally presented to his disciples.\"", "entities": [[1, 12, "PERSON"], [22, 33, "PERSON"], [90, 101, "PERSON"], [470, 481, "PERSON"], [507, 518, "PERSON"], [563, 574, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.035.than.html", "title": "Cula-Saccaka Sutta", "para_seq": null}}
{"text": "\"Yes , lord,\" Subhadda answered, and the Blessed One said, \"In any doctrine & discipline where the noble eightfold path is not found, no contemplative of the first... second... third... fourth order [stream-winner, once-returner, non-returner, or arahant] is found. But in any doctrine & discipline where the noble eightfold path is found, contemplatives of the first... second... third... fourth order are found. The noble eightfold path is found in this doctrine & discipline, and right here there are contemplatives of the first... second... third... fourth order. Other teachings are empty of knowledgeable contemplatives. And if the monks dwell rightly, this world will not be empty of arahants.\"", "entities": [[41, 52, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": null}}
{"text": "\" Potthapada , it's as if a man at a crossroads were to build a staircase for ascending to a palace, and other people were to say to him, 'Well, my good man, this palace for which you are building a staircase: do you know whether it's east, west, north, or south of here? Whether it's high, low, or in between?' and, when asked this, he would say, 'No.' Then they would say to him, 'So you don't know or see the palace for which you are building a staircase?' When asked this, he would say, 'Yes.'", "entities": [[2, 12, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.09.0.than.html", "title": "Potthapada Sutta", "para_seq": null}}
{"text": "Ven. Sariputta said, \"When a disciple of the noble ones discerns what is unskillful, discerns the root of what is unskillful, discerns what is skillful, and discerns the root of what is skillful, it is to that extent that he is a person of right view, one whose view is made straight, who is endowed with verified confidence in the Dhamma, and who has arrived at this true Dhamma.", "entities": [[0, 14, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.009.than.html", "title": "Sammaditthi Sutta", "para_seq": null}}
