{ "text": "On one occasion the Blessed One was staying near Kusinara in Upavattana , the Sal Tree Grove of the Mallans , on the occasion of his total Unbinding. Then the Blessed One addressed the monks, \"I exhort you, monks: All fabrications are subject to decay. Bring about completion by being heedful.\" Those were the Tathagata's last words.", "entities": [ [ "PERSON", "Blessed One" ], [ "GPE", "Kusinara" ], [ "PERSON", "Upavattana" ], [ "LOC", "Sal Tree Grove" ], [ "NORP", "Mallans" ], [ "PERSON", "Blessed One" ], [ "PERSON", "Tathagata" ] ] }
{ "text": "On one occasion the Blessed One was dwelling near Rajagaha in the Bamboo Grove Monastery, the Squirrel's Feeding Place. There Moliyasivaka the wanderer went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to the Blessed One, \"Master Gotama, there are some brahmans & contemplatives who are of this doctrine, this view: Whatever an individual feels — pleasure, pain, neither-pleasure-nor-pain — is entirely caused by what was done before. Now what does Master Gotama say to that?\"", "entities": [ [ "PERSON", "Blessed One" ], [ "GPE", "Rajagaha" ], [ "LOC", "Bamboo Grove Monastery" ], [ "LOC", "Squirrel's Feeding Place" ], [ "PERSON", "Moliyasivaka" ], [ "PERSON", "Blessed One" ], [ "PERSON", "Blessed One" ], [ "PERSON", "Master Gotama" ], [ "NORP", "brahmans" ], [ "PERSON", "Master Gotama" ] ] }
{ "text": "Setting at Savatthi. Then, in the morning, the bhikkhuni Vijaya dressed... she sat down at the foot of a tree for the day's abiding.", "entities": [ [ "GPE", "Savatthi" ], [ "PERSON", "Vijaya"] ] }
{ "text": "Thus have I heard. At one time the Blessed One was living among the Kurus, at Kammasadamma, a market town of the Kuru people. There the Blessed One addressed the bhikkhu thus: \"Monks,\" and they replied to him, \"Venerable Sir.\" The Blessed One spoke as follows:", "entities": [ [ "PERSON", "Blessed One" ], [ "NORP", "Kurus" ], [ "PERSON", "Kammasadamma" ], [ "NORP", "Kuru people" ], [ "PERSON", "Blessed One" ], [ "NORP", "Monks" ], [ "PERSON", "Venerable Sir" ], [ "PERSON", "Blessed One" ] ] }
{ "text": "I have heard that on one occasion the Blessed One, on a wandering tour among the Kosalans with a large community of monks, arrived at a Kosalan brahman village named Icchanangala . There he stayed in the Icchanangala forest grove.", "entities": [ [ "PERSON", "Blessed One" ], [ "NORP", "Kosalans" ], [ "NORP", "Kosalan" ], [ "NORP", "brahman" ], [ "GPE", "Icchanangala" ], [ "GPE", "Icchanangala" ] ] }
{ "text": "On one occasion the Blessed One was staying near Savatthi at Jeta's Grove, Anathapindika's monastery. Then Channa the Wanderer [1] went to Ven. Ananda and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to Ven. Ananda, \"Do you, too, friend Ananda, advocate the abandoning of passion? Do you advocate the abandoning of aversion? Do you advocate the abandoning of delusion?\"", "entities": [ [ "PERSON", "Blessed One" ], [ "GPE", "Savatthi" ], [ "LOC", "Jeta's Grove" ], [ "LOC", "Anathapindika's monastery" ], [ "PERSON", "Channa the Wanderer" ], [ "PERSON", "Ven. Ananda" ], [ "PERSON", "Ven. Ananda" ], [ "PERSON", "Ananda" ] ] }
{ "text": "When this was said, the brahman Akkosaka Bharadvaja said to the Blessed One, \" Magnificent , Master Gotama! Magnificent! \"", "entities": [ [ "NORP", "brahman" ], [ "PERSON", "Akkosaka Bharadvaja" ], [ "PERSON", "Blessed One" ] ] }
{ "text": "\"He perceives water as water... fire as fire... wind as wind [1] ... beings as beings... gods as gods... Pajapati as Pajapati... Brahma as Brahma... the luminous gods as luminous gods... the gods of refulgent glory as gods of refulgent glory... the gods of abundant fruit as the gods of abundant fruit... the Conqueror as the Conqueror [2] ... the dimension of the infinitude of space as the dimension of the infinitude of space... the dimension of the infinitude of consciousness as the dimension of the infinitude of consciousness... the dimension of nothingness as the dimension of nothingness... the dimension of neither-perception-nor-non-perception as the dimension of neither-perception-nor-non-perception [3] ... the seen as the seen... the heard as the heard... the sensed as the sensed... the cognized as the cognized [4] ... singleness as singleness... multiplicity as multiplicity [5] ... the All as the All [6] ...", "entities": [ [ "PERSON", "Pajapati" ], [ "PERSON", "Pajapati" ], [ "PERSON", "Brahma" ], [ "GPE", "Brahma" ] ] }
{ "text": "When the Lord proclaimed this, the brahman Akkosa Bharadvaja said this to the Blessed One:", "entities": [ [ "PERSON", "Lord" ], [ "NORP", "brahman" ], [ "PERSON", "Akkosa Bharadvaja" ] ] }
{ "text": "Now, the Blessed One heard the exchange between Ven. Ananda & Subhadda the Wanderer, and so he said to Ven. Ananda, \"Enough, Ananda. Don't stand in his way. Let him see the Tathagata. Whatever he asks me will all be for the sake of knowledge, and not to be bothersome. And whatever I answer when asked, he will quickly understand.\"", "entities": [ [ "PERSON", "Blessed One" ], [ "PERSON", "Ven. Ananda" ], [ "PERSON", "Subhadda the Wanderer" ], [ "PERSON", "Ven. Ananda" ], [ "PERSON", "Ananda" ], [ "PERSON", "Tathagata" ] ] }
{ "text": "\"So the monk approached the Four Great Kings and, on arrival, asked them, 'Friends, where do these four great elements... cease without remainder?'", "entities": [ [ "PERSON", "Four Great Kings" ] ]}
{ "text": "\"Surely,\" [said Ven. Ananda,] \"it's because Ven. Sariputta's I-making & mine-making and obsessions with conceit have long been well uprooted that even if there were change & alteration in the Teacher, there would arise within him no sorrow, lamentation, pain, distress, or despair.\"", "entities": [ [ "PERSON", "Ven. Ananda" ], [ "PERSON", "Ven. Sariputta" ] ] }
{ "text": "There is the case where the disciple of the noble ones recollects the devas, thus: 'There are the Devas of the Four Great Kings, the Devas of the Thirty-three, the Yama Devas, the Contented Devas, the devas who delight in creation, the devas who have power over the creations of others, the devas of Brahma's retinue, the devas beyond them. Whatever conviction they were endowed with that — when falling away from this life — they re-arose there, the same sort of conviction is present in me as well.", "entities": [ [ "NORP", "Devas" ], [ "PERSON", "Four Great Kings" ], [ "NORP", "Devas"], [ "LOC", "Thirty-three" ], [ "NORP", "Yama Devas" ], ["NORP" , "Contented Deva" ], [ "PERSON", "Brahma" ] ] }
{ "text": "\"But, monks, when the top of the deva-chief Sakka's standard is caught sight of, or when the top of the deva-king Pajapati's standard is caught sight of, or when the top of the deva-king Varuna's standard is caught sight of, or when the top of the deva-king Isana's standard is caught sight of, whatever fear, terror, or horripilation there is may be abandoned or may not be abandoned. Why is that? Because Sakka the chief of the devas is not devoid of passion, not devoid of aversion, not devoid of delusion. He feels fear, feels terror, feels dread. He runs away.", "entities": [ [ "PERSON", "Sakka" ], [ "PERSON", "king Pajapati" ], [ "PERSON", "king Varuna" ], [ "PERSON", "king Isana" ], [ "PERSON", "Sakka" ] ] }
{ "text": "When this had been said, the brahman Ganaka-Moggallana spoke thus to the Lord:", "entities": [ [ "NORP", "brahman" ], [ "PERSON", "Ganaka-Moggallana" ], [ "PERSON", "Lord" ] ] }
{ "text": "On one occasion the Blessed One was staying near Kapilavatthu at the Banyan Park. Then many Sakyan lay followers, it being the Uposatha day, went to the Blessed One. On arrival, having bowed down to him, they sat to one side. As they were sitting there, the Blessed One said to them, \"Sakyans, do you observe the eight-factored uposatha?\"", "entities": [ [ "PERSON", "Blessed One" ], [ "GPE", "Kapilavatthu" ], [ "LOC", "Banyan Park" ], [ "NORP", "Sakyan" ], [ "EVENT", "Uposatha" ], [ "PERSON", "Blessed One" ], [ "PERSON", "Blessed One" ], [ "NORP", "Sakyans" ], [ "EVENT", "uposatha" ] ] }
{ "text": "47. When they heard the Venerable Ananda speak these words, the Mallas with their sons, their wives, and the wives of their sons, were sorely grieved, grieved at heart and afflicted; and some, with their hair all dishevelled, with arms uplifted in despair, wept; flinging themselves on the ground, they rolled from side to side, lamenting: \"Too soon has the Blessed One come to his Parinibbana! Too soon has the Happy One come to his Parinibbana! Too soon will the Eye of the World vanish from sight!\"", "entities": [ [ "PERSON", "Venerable Ananda" ], [ "NORP", "Mallas" ], [ "PERSON", "Blessed One" ], [ "EVENT", "Parinibbana" ], [ "EVENT", "Parinibbana" ] ] }
{ "text": ". \"Wanderers of other sects who ask thus may be answered in this way: 'How then, friends, is the goal one or many?' Answering rightly, the wanderers of other sects would answer thus: 'Friends, the goal is one, not many.' [2] — 'But, friends, is that goal for one affected by lust or free from lust?' Answering rightly, the wanderers of other sects would answer thus: 'Friends, that goal is for one free from lust, not for one affected by lust.' — 'But, friends, is that goal for one affected by hate or free from hate?' Answering rightly, they would answer: 'Friends, that goal is for one free from hate, not for one affected by hate.' — 'But, friends, is that goal for one affected by delusion or free from delusion?' Answering rightly, they would answer: 'Friends, that goal is for one free from delusion, not for one affected by delusion.' — 'But, friends, is that goal for one affected by craving or free from craving?' [65] Answering rightly, they would answer: 'Friends, that goal is for one free from craving, not for one affected by craving.' — 'But, friends, is that goal for one affected by clinging or free from clinging?' Answering rightly, they would answer: 'Friends, that goal is for one free from clinging, not for one affected by clinging.' — 'But, friends, is that goal for one who has vision or for one without vision?' Answering rightly, they would answer: 'Friends, that goal is for one with vision, not for one without vision.' — 'But, friends, is that goal for one who favors and opposes, or for one who does not favor and oppose?' Answering rightly, they would answer: 'Friends, that goal is for one who does not favor and oppose, not for one who favors and opposes.' [3] — 'But, friends is that goal for one who delights in and enjoys proliferation, or for one who does not delight in and enjoy proliferation?' Answering rightly, they would answer: 'Friends, that goal is for one who does not delight in and enjoy proliferation, not for one who delights in and enjoys proliferation.' [4]", "entities": [ [ "NORP", "Wanderers" ], [ "NORP", "wanderers" ], [ "NORP", "wanderers" ] ] }
{ "text": "[ The young man who had persuaded the lady to invite the Ven. Udaayii goes to him again, receives instruction, and returns to the lady with a renewed request to incite him. She says: ] \"You are speaking thus, my lad, in praise of the recluse Udaayii. But when I said to this Udaayii, 'Teach me your doctrine, recluse,' he replied, 'The time will come for that, sister,' and then got up from his seat and returned home.\"", "entities": [ [ "PERSON", "Ven. Udaayii" ], [ "PERSON", "Udaayii" ] , [ "PERSON", "Udaayii" ] ] }
{ "text": "After these words, Carpenter Fivetools said: \"Not three kinds of feelings, reverend Udayi, were taught by the Blessed One. It is two kinds of feelings that were stated by the Blessed One: pleasant and painful feelings. The neutral feeling was said by the Blessed One to belong to peaceful and sublime happiness.\"", "entities": [ [ "PERSON", "Carpenter Fivetools" ], [ "PERSON", "Udayi" ], [ "PERSON", "Blessed One" ], [ "PERSON", "Blessed One" ], [ "PERSON", "Blessed One" ] ] }
{ "text": "Another attempt to explain the Buddha's silence on this issue focuses on the second reason for his silence, saying that the annihilationists had laid claim to the slogan that there is no self, so — because the Buddha did not want his own doctrine of no self to be confused with theirs — he avoided their slogan. This explanation, however, is not supported by the Canon. The doctrines of the annihilationists are presented in a fair amount of detail in the Canon, and nowhere are they quoted as saying outright that there is no self. Thus there is no basis for saying that it was their slogan. Second, there are many instances where the Buddha, when asked a categorical question concerning an issue where he wanted to give a nuanced answer, showed himself perfectly capable of rephrasing the question in more nuanced terms before giving his reply. Had he held a nuanced doctrine that there is no self, he could have easily rephrased Vacchagotta's question before answering it. The fact that he chose not to do so, either in Vacchagotta's or Ven. Ananda's presence, indicates that he felt that this issue, too, was a thicket of views based on a misunderstanding, accompanied by suffering, and not leading to awakening.", "entities": [ [ "PERSON", "Buddha" ], [ "PERSON", "Buddha" ], [ "PERSON", "Buddha" ], [ "PERSON", "Vacchagotta" ], [ "PERSON", "Vacchagotta" ], [ "PERSON", "Ven. Ananda" ] ] }
{ "text": "\"Friends, in foreign lands there are wise nobles & brahmans, householders & contemplatives — for the people there are wise & discriminating — who will question a monk: 'What is your teacher's doctrine? What does he teach?' Have you listened well to the teachings — grasped them well, attended to them well, considered them well, penetrated them well by means of discernment — so that in answering you will speak in line with what the Blessed One has said, will not misrepresent the Blessed One with what is unfactual, will answer in line with the Dhamma, and no one whose thinking is in line with the Dhamma will have grounds for criticizing you?\"", "entities": [ [ "NORP", "nobles" ], [ "NORP", "brahmans" ], [ "NORP", "householders" ], [ "NORP", "contemplatives" ], [ "PERSON", "Blessed One" ], [ "PERSON", "Blessed One" ] ] }
{ "text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery. Now on that occasion Uggahamana, a follower of Mundika the contemplative, [1] together with a large following of about 500 wanderers, had taken up residence in the debating hall near the Tinduka tree in the single-pavilion park of Queen Mallika. Then Pañcakanga the carpenter left Savatthi in the middle of the day to see the Blessed One, but the thought occurred to him, \"Now is not the right time to see the Blessed One, for he is in seclusion. And it is not the right time to see the mind-developing monks, for they too are in seclusion. Why don't I go to the debating hall near the Tinduka tree in the single-pavilion park of Queen Mallika to see Uggahamana, a follower of Mundika the contemplative?\" So he headed to the debating hall near the Tinduka tree in the single-pavilion park of Queen Mallika.", "entities": [ [ "PERSON", "Blessed One" ], [ "GPE", "Savatthi" ], [ "LOC", "Jeta's Grove" ], [ "LOC", "Anathapindika's monastery" ], [ "PERSON", "Uggahamana" ], [ "PERSON", "Mundika the contemplative" ], [ "NORP", "wanderers" ], [ "PERSON", "Queen Mallika" ], [ "PERSON", "Pañcakanga" ], [ "GPE", "Savatthi" ], [ "PERSON", "Blessed One" ], [ "PERSON", "Blessed One" ], [ "PERSON", "Queen Mallika" ], [ "PERSON", "Uggahamana" ], [ "PERSON", "Mundika the contemplative" ], [ "PERSON", "Queen Mallika" ] ] }
{ "text": "The brahman householders of Icchanangala heard it said, 'Gotama the contemplative — the son of the Sakyans, having gone forth from the Sakyan clan — on a wandering tour among the Kosalans with a large community of monks — has arrived at Icchanangala and is staying in the Icchanangala forest grove.'", "entities" : [ [ "NORP", "brahman"], [ "NORP", "householders"], [ "GPE", "Icchanangala" ], [  "PERSON",  "Gotama" ], [ "NORP",  "Sakyans"], [ "NORP" , "Sakyan"], [ "NORP" ,  "Kosalans"], ["GPE" , "Icchanangala"], ["GPE" , "Icchanangala"] ] }
{ "text": "I have heard that on one occasion Ven. Maha Kaccana was staying in Avanti at Osprey's Haunt, on Sheer-face Peak. Then Haliddakani the householder went to him and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to Ven. Maha Kaccana: \"Venerable sir, this was said by the Blessed One in Magandiya's Questions in the Atthaka Vagga", "entities": [ [ "PERSON", "Ven. Maha Kaccana" ],  [ "GPE", "Avanti" ], [ "LOC", "Osprey's Haunt" ], [ "LOC", "Sheer-face Peak" ], [ "PERSON", "Haliddakani" ], ["PERSON", "Ven. Maha Kaccana" ],  [ "PERSON", "Venerable sir" ] , [ "PERSON", "Blessed One" ] , [ "PERSON", "Magandiya" ] ] }
{"text": "Once upon a time [3] there was a royal fig tree called Steadfast, belonging to king Koravya, whose five outstretched branches provided a cool and pleasing shade. Its girth extended a hundred miles, and its roots spread out for forty miles. And the fruits of that tree were indeed great: As large as harvest baskets — such were its succulent fruits — and as clear as the honey of bees.", "entities": [ ["PERSON", "king Koravya"]]}
{"text": "Now on that occasion it was hot & sweltering. The senior monks went along with their bodies melting, as it were, from the meal they had finished. And on that occasion Ven. Mahaka was the most junior of all the monks in that Community. He said to the senior monk: \"Wouldn't it be nice, venerable elder, if a cool wind were to blow, and there were a thundering cloud, and rain would fall in scattered drops?\" Then Ven. Mahaka willed a psychic feat such that a cool wind blew, a thundering cloud developed, and the rain fell in scattered drops. The thought occurred to Citta the householder, \"Such is the psychic power of the most junior of all the monks in this Community!\"", "entities": [["PERSON", "Ven. Mahaka"], ["NORP", "Community"], ["PERSON", "Ven. Mahaka"], ["PERSON", "Citta"], ["NORP", "Community"] ] }
{"text": "\"Householders, there are these four types of individuals to be found existing in the world. Which four? There is the case where a certain individual torments himself and is devoted to the practice of torturing himself. There is the case where a certain individual torments others and is devoted to the practice of torturing others. There is the case where a certain individual torments himself and is devoted to the practice of torturing himself, and also torments others and is devoted to the practice of torturing others. There is the case where a certain individual neither torments himself nor is he devoted to the practice of torturing himself, neither torments others nor is he devoted to the practice of torturing others. Neither tormenting himself nor tormenting others, he dwells in the here-&-now free of hunger, unbound, cooled, sensitive to happiness, with a Brahma-like mind. \"And which is the individual who neither torments himself nor is devoted to the practice of torturing himself, neither torments others nor is devoted to the practice of torturing others; who — neither tormenting himself nor tormenting others — dwells in the here-&-now free of hunger, unbound, cooled, sensitive to happiness with a Brahma-like mind? \"This is called an individual who neither torments himself nor is devoted to the practice of torturing himself, who neither torments others nor is devoted to the practice of torturing others. Neither tormenting himself nor tormenting others, he dwells in the here-&-now free of hunger, unbound, cooled, sensitive to happiness, with a Brahma-like mind.\"", "entities": [["NORP", "Householders"],["PERSON", "Brahma" ] , ["PERSON", "Brahma"],["PERSON", "Brahma"]]}
{"text": "I have heard that on one occasion the Blessed One was staying near Rajagaha in the Cool Grove. Now at that time Anathapindika the householder had arrived in Rajagaha on some business. He heard, \"An Awakened One, they say, has appeared in the world,\" and he wanted to go right then to see the Blessed One. Then the thought occurred to him, \"Today is not the proper time to go to see the Blessed One. Tomorrow I will go to see the Blessed One at the proper time.\" With his mindfulness immersed in the Awakened One he lay down to sleep. Three times he got up during the night, thinking it was light. Then he went to the gate to the charnel ground. Non-human beings opened the gate. So Anathapindika went to the Cool Grove. Now at that time, the Blessed One — having gotten up as the night was ending — was pacing back & forth in the open air. He saw Anathapindika the householder coming from afar. On seeing him, he got down from his meditation path and sat on a seat made ready. As he was sitting there he said to Anathapindika, \"Come, Sudatta.\"", "entities": [["PERSON", "Blessed One"], ["GPE", "Rajagaha"], ["LOC", "Cool Grove"], ["PERSON", "Anathapindika"], ["GPE", "Rajagaha"], ["PERSON", "Awakened One"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["PERSON", "Awakened One"], ["PERSON", "Anathapindika"], ["LOC", "Cool Grove"], ["PERSON", "Blessed One"], ["PERSON", "Anathapindika"], ["PERSON", "Anathapindika"], [ "PERSON", "Sudatta"] ]}
{"text": "56. \"So also at the Banyan Grove, at Robbers' Cliff, at the Sattapanni Cave on the Vebhara Mountain, at the Black Rock of Isigili , at the Serpents' Pool in the Cool Forest, at the Tapoda Grove, at the Bamboo Grove in the Squirrels' Feeding-ground, at Jivaka's Mango Grove, and at Small Nook in the Deer Park I spoke to you in the same words, saying: 'Pleasant, Ananda, is Rajagaha, pleasant are these places. Whosoever, Ananda, has developed... Therefore the Tathagata could, if he so desired, remain throughout a world-period or until the end of it.' 26. And the Venerable Ananda answered the Blessed One: \"But just now, Lord, a great number of carts, five hundred carts, have passed over, and the shallow water has been cut through by the wheels, so that it flows turbid and muddy. But the Kakuttha River, Lord, is quite close by, and its waters are clear, pleasant, cool, and translucent. It is easily approachable and delightfully placed. There the Blessed One can quench his thirst and refresh his limbs.\"", "entities": [["LOC", "Banyan Grove"], ["LOC", "Robbers' Cliff"], ["LOC", "Sattapanni Cave"], ["LOC", "Vebhara Mountain"], ["LOC", "Black Rock of Isigili"], ["LOC", "Serpents' Pool"], ["LOC", "Cool Forest"], ["LOC", "Tapoda Grove"], ["LOC", "Bamboo Grove"], ["LOC", "Squirrels' Feeding-ground"], ["LOC", "Jivaka's Mango Grove"], ["LOC", "Small Nook"], ["LOC", "Deer Park"], ["PERSON", "Ananda"], ["GPE", "Rajagaha"], ["PERSON", "Ananda"], ["PERSON", "Tathagata"], ["PERSON", "Venerable Ananda"], ["PERSON", "Blessed One"], ["PERSON", "Lord"], ["LOC", "Kakuttha River"], ["PERSON", "Lord"], ["PERSON", "Blessed One"]]}
{"text": "On one occasion Ven. Ananda was staying near Vesali at Veluvagamaka. Now on that occasion Dasama the householder from Atthakanagara had arrived at Pataliputta on some business.", "entities": [["PERSON", "Ven. Ananda"], ["GPE", "Vesali"], ["GPE", "Veluvagamaka"], ["PERSON", "Dasama"], ["GPE", "Atthakanagara"], ["GPE", "Pataliputta"]]}
{"text": "I have heard that on one occasion Ven. Maha Kaccana was staying in Avanti at Osprey's Haunt, on Sheer-face Peak. Then Haliddakani the householder went to him and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to Ven. Maha Kaccana: \"Venerable sir, this was said by the Blessed One in Magandiya's Questions in the Atthaka Vagga : [Ven. Maha Kaccana:] \"The property of form, householder, is the home of consciousness. When consciousness is in bondage through passion to the property of form, it is said to be living at home. The property of feeling... perception... fabrication is the home of consciousness. When consciousness is in bondage through passion to the property of fabrication, it is said to be dwelling at home.", "entities": [["PERSON","Ven. Maha Kaccana"], ["GPE", "Avanti"], ["LOC", "Osprey's Haunt"], ["LOC",  "Sheer-face Peak"], ["PERSON",  "Ven. Maha Kaccana"], ["PERSON", "Venerable sir"], [ "PERSON", "Blessed One" ], [ "PERSON", "Magandiya" ] , [ "PERSON", "Ven. Maha Kaccana"] ] }
{"text": "On one occasion Ven. Ananda was staying near Vesali at Veluvagamaka. Now on that occasion Dasama the householder from Atthakanagara had arrived at Pataliputta on some business.", "entities": [["PERSON", "Ven. Ananda"], ["GPE", "Vesali"], ["GPE", "Veluvagamaka"], ["PERSON", "Dasama"], ["GPE", "Atthakanagara"], ["GPE", "Pataliputta"]]}
{"text": "So the monks went to Ven. Maha Kaccana and, on arrival exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, they sat to one side. As they were sitting there, they [told him what had happened, and added,] \"Analyze the meaning, Ven. Maha Kaccana!\" \"Yes, friend Kaccana: knowing, the Blessed One knows; seeing, he sees. He is the Eye, he is Knowledge, he is Dhamma, he is Brahma. He is the speaker, the proclaimer, the elucidator of meaning, the giver of the Deathless, the lord of the Dhamma, the Tathagata. That was the time when we should have questioned him about this matter. However he answered, that was how we should have remembered it. But you are praised by the Teacher and esteemed by your knowledgeable companions in the holy life. You are capable of analyzing the unanalyzed detailed meaning of this brief statement. Analyze the meaning, Ven. Maha Kaccana without making it difficult!\" Then the monks, delighting in & approving of Ven. Maha Kaccana's words, got up from their seats and went to the Blessed One. On arrival, having bowed down to him, they sat to one side. As they were sitting there, they [told him what had happened after he had gone into his dwelling, and ended by saying,] \"Then Ven. Maha Kaccana analyzed the meaning using these words, statements, & phrases.\" \"Maha Kaccana is wise, monks. He is a person of great discernment. If you had asked me about this matter, I too would have answered in the same way he did. That is its meaning, and that is how you should remember it.\"" , "entities": [ ["PERSON", "Ven. Maha Kaccana"], ["PERSON", "Ven. Maha Kaccana"], ["PERSON", "Kaccana"], ["PERSON", "Blessed One"], ["PERSON", "Brahma"], ["PERSON", "Tathagata"], ["PERSON", "Ven. Maha Kaccana"], ["PERSON", "Ven. Maha Kaccana"], ["PERSON", "Blessed One"], ["PERSON", "Ven. Maha Kaccana"], ["PERSON", "Maha Kaccana"] ] }
{"text": "On one occasion Ven. Sabhiya Kaccana was staying at Ñatika in the Brick Hall. Then Vacchagotta the wanderer went to him and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to Ven. Sabhiya Kaccana, \"Now then, Master Kaccana, does the Tathagata exist after death?\"", "entities": [["PERSON", "Ven. Sabhiya Kaccana"], ["GPE", "Ñatika"], ["LOC", "Brick Hall"], ["PERSON", "Vacchagotta"], ["PERSON", "Ven. Sabhiya Kaccana"], ["PERSON", "Master Kaccana"], ["PERSON", "Tathagata"]]}
{"text": "Then Ven. Malunkyaputta, who was ardent & resolute, went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there, he said to the Blessed One: \"It would be good, lord, if the Blessed One would teach me the Dhamma in brief so that, having heard the Dhamma from the Blessed One, I might dwell alone in seclusion: heedful, ardent, & resolute.\" \"Here now, Malunkyaputta: What will I say to the young monks when you — aged, old, elderly, along in years, come to the last stage of life — ask for an admonition in brief?\" \"What do you think, Malunkyaputta: the forms cognizable via the eye that are unseen by you — that you have never before seen, that you don't see, and that are not to be seen by you: Do you have any desire or passion or love there?\" \"Then, Malunkyaputta, with regard to phenomena to be seen, heard, sensed, or cognized: In reference to the seen, there will be only the seen. In reference to the heard, only the heard. In reference to the sensed, only the sensed. In reference to the cognized, only the cognized. That is how you should train yourself. When for you there will be only the seen in reference to the seen, only the heard in reference to the heard, only the sensed in reference to the sensed, only the cognized in reference to the cognized, then, Malunkyaputta, there is no you in connection with that. When there is no you in connection with that, there is no you there. When there is no you there, you are neither here nor yonder nor between the two. This, just this, is the end of stress.\" [2] \"Good, Malunkyaputta. Very good. It's good that you understand in detail this way the meaning of what I said in brief.\" \"It's in this way, Malunkyaputta, that the meaning of what I said in brief should be regarded in detail.\" Then Ven. Malunkyaputta, having been admonished by the admonishment from the Blessed One, got up from his seat and bowed down to the Blessed One, circled around him, keeping the Blessed One to his right side, and left. Then, dwelling alone, secluded, heedful, ardent, & resolute, he in no long time reached & remained in the supreme goal of the holy life for which clansmen rightly go forth from home into homelessness, knowing & realizing it for himself in the here & now. He knew: \"Birth is ended, the holy life fulfilled, the task done. There is nothing further for the sake of this world.\" And thus Ven. Malunkyaputta became another one of the arahants.", "entities": [["PERSON", "Ven. Malunkyaputta"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["PERSON", "Malunkyaputta"], ["PERSON", "Malunkyaputta"], ["PERSON", "Malunkyaputta"], ["PERSON", "Malunkyaputta"], ["PERSON", "Malunkyaputta"], ["PERSON", "Malunkyaputta"], ["PERSON", "Ven. Malunkyaputta"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["PERSON", "Blessed One"], ["PERSON", "Ven. Malunkyaputta"], ["NORP", "arahants"] ] }
{"text": "\"Just as though, Visakha, one might have power, dominion and kingship [11] over sixteen great countries abounding in the seven treasures [12] — that is to say, Anga, Magadha, Kasi, Kosala, Vajji, Malla, Ceti, Vansa, Kure, Pancala, Maccha, Surasena, Assaka, Avanti, Gandhara and Kamboja, yet it is not worth a sixteenth part of the Uposatha undertaken with its eight practices. For what reason? Miserable is kingship over men compared with heavenly bliss.", "entities": [["PERSON", "Visakha"], ["GPE", "Anga"], ["GPE", "Magadha"], ["GPE", "Kasi"], ["GPE", "Kosala"], ["GPE", "Vajji"], ["GPE", "Malla"], ["GPE", "Vansa"], ["GPE", "Kure"], ["GPE", "Pancala"], ["GPE", "Surasena"], ["GPE", "Assaka"], ["GPE", "Avanti"], ["GPE", "Gandhara"], ["GPE", "Kamboja"], ["EVENT", "Uposatha"]]}
{"text": "\"Suppose that one were to exercise kingship, rule, & sovereignty over these sixteen great lands replete with the seven treasures, i.e., over the Angas , Maghadans , Kasis , Kosalans , Vajjians , Mallas , Cetis , Vansans , Kurus , Pañcalas , Macchas , Surasenas , Assakas , Avantis , Gandharans , & Kambojans : It would not be worth one-sixteenth of this Uposatha endowed with eight factors. Why is that? Kingship over human beings is a meager thing when compared with heavenly bliss.", "entities": [["NORP", "Angas"], ["NORP", "Maghadans"], ["NORP", "Kasis"], ["NORP", "Kosalans"], ["NORP", "Vajjians"], ["NORP", "Mallas"], ["NORP", "Cetis"], ["NORP", "Vansans"], ["NORP", "Kurus"], ["NORP", "Pañcalas"], ["NORP", "Macchas"], ["NORP", "Surasenas"], ["NORP", "Assakas"], ["NORP", "Avantis"], ["NORP", "Gandharans"], ["NORP", "Kambojans"], ["EVENT", "Uposatha"]]}
{"text": "On one occasion the Blessed One was staying near Kusinara in Upavattana , the Sal Tree Grove of the Mallans , on the occasion of his total Unbinding. Then the Blessed One addressed the monks, \"I exhort you, monks: All fabrications are subject to decay. Bring about completion by being heedful.\" Those were the Tathagata's last words.", "entities": [["PERSON", "Blessed One"], ["GPE", "Kusinara"], ["GPE", "Upavattana"], ["LOC", "Sal Tree Grove"], ["NORP", "Mallans"], ["PERSON", "Blessed One"], ["PERSON", "Tathagata"]]}
