{"text": "13. And when the Blessed One had passed away, simultaneously with his Parinibbana, Brahma Sahampati [60] spoke this stanza:", "entities": [[75, 91, "PERSON"]], "meta": {"term": "Brahma Sahampati", "nikaya": "DN", "identifier": "dn.16.1-6.vaji.html", "title": "Maha-parinibbana Sutta", "para_seq": 393, "hits": 2, "first_offset": 75}}
{"text": "When the Blessed One was totally Unbound, simultaneously with the total Unbinding, Sahampati Brahma uttered this verse:", "entities": [[83, 99, "PERSON"]], "meta": {"term": "Brahma Sahampati", "nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": 88, "hits": 2, "first_offset": 83}}
{"text": "42. And the king of Magadha, Ajatasattu, son of the Videhi queen, erected a stupa over the relics of the Blessed One at Rajagaha, and in their honor held a festival. The Licchavis of Vesali erected a stupa over the relics of the Blessed One at Vesali, and in their honor held a festival. The Sakyas of Kapilavatthu erected a stupa over the relics of the Blessed One at Kapilavatthu, and in their honor held a festival. The Bulis of Allakappa erected a stupa over the relics of the Blessed One at Allakappa, and in their honor held a festival. The Kolis of Ramagama erected a stupa over the relics of the Blessed One at Ramagama, and in their honor held a festival. The Vethadipa brahman erected a stupa over the relics of the Blessed One at Vethadipa, and in their honor held a festival. The Mallas of Pava erected a stupa over the relics of the Blessed One at Pava, and in their honor held a festival. The Mallas of Kusinara erected a stupa over the relics of the Blessed One at Kusinara, and in their honor held a festival. The brahman Dona erected a stupa over the urn, and in its honor held a festival. And the Moriyas of Pipphalivana erected a stupa over the ashes at Pipphalivana, and in their honor held a festival.", "entities": [[290, 302, "GPE"], [357, 369, "GPE"]], "meta": {"term": "Kapilavatthu", "nikaya": "DN", "identifier": "dn.16.1-6.vaji.html", "title": "Maha-parinibbana Sutta", "para_seq": 450, "hits": 2, "first_offset": 290}}
{"text": "I have heard that on one occasion the Blessed One was dwelling among the Sakyans at Kapilavatthu in the Great Wood, together with a large Sangha of approximately five hundred bhikkhus, all of them arahants. And most of the devatas from ten world-systems had gathered in order to see the Blessed One and the Bhikkhu Sangha. Then the thought occurred to four devatas of the ranks from the Pure Abodes: \"The Blessed One is dwelling among the Sakyans at Kapilavatthu in the Great Wood, together with a large Sangha of about five hundred bhikkhus, all of them arahants. And most of the devatas from ten world-systems have gathered in order to see the Blessed One and the Bhikkhu Sangha. Let us also approach the Blessed One and, on arrival, let us each speak a verse in his presence.\"", "entities": [[82, 94, "GPE"], [448, 460, "GPE"]], "meta": {"term": "Kapilavatthu", "nikaya": "DN", "identifier": "dn.20.0.than.html", "title": "Maha-samaya Sutta", "para_seq": 1, "hits": 2, "first_offset": 82}}
{"text": "35. And the Sakyas of Kapilavatthu came to know that at Kusinara the Blessed One had passed away. And they sent a message to the Mallas of Kusinara, saying: \"The Blessed One was the greatest of our clan. We are worthy to receive a portion of the relics of the Blessed One. We will erect a stupa over the relics of the Blessed One and hold a festival in their honor.\"", "entities": [[10, 22, "GPE"]], "meta": {"term": "Kapilavatthu", "nikaya": "DN", "identifier": "dn.16.1-6.vaji.html", "title": "Maha-parinibbana Sutta", "para_seq": 440, "hits": 1, "first_offset": 10}}
{"text": "The Sakyans of Kapilavatthu heard, \"The Blessed One, they say, has been totally unbound in Kusinara.\" So they sent an envoy to the Kusinara Mallans: \"The Blessed One was the greatest of our relatives. We deserve a share of the Blessed One's bone-relics. We, too, will build a burial mound and hold a ceremony for them.\"", "entities": [[11, 23, "GPE"]], "meta": {"term": "Kapilavatthu", "nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": 128, "hits": 1, "first_offset": 11}}
{"text": "On one occasion the Blessed One was living in the Maha-vana (great wood) near the city of Kapilavatthu in the province of the Sakyans together with a great retinue of monks, all of them arahants, and five hundred in number. Devas (gods) from ten thousand world-systems frequently assembled for the purpose of seeing the Blessed One and the bhikkhu-sangha (ordained monks).", "entities": [[83, 95, "GPE"]], "meta": {"term": "Kapilavatthu", "nikaya": "DN", "identifier": "dn.20.0.piya.html", "title": "Maha-samaya Sutta", "para_seq": 2, "hits": 1, "first_offset": 83}}
{"text": "Then to four devas of the Suddhavasa (pure Abodes) brahma world, this thought occurred: \"The Blessed One is living in the Mahavana near the city of Kapilavatthu in the province of the Sakyans with a great retinue of monks, all of them arahants, and five hundred in number. Devas are frequently assembling there for the purpose of seeing the Blessed One and the bhikkhu-sangha. It is well if we were also to repair to the place where the Blessed One is, and each of us recite a stanza in his presence.\"", "entities": [[148, 160, "GPE"]], "meta": {"term": "Kapilavatthu", "nikaya": "DN", "identifier": "dn.20.0.piya.html", "title": "Maha-samaya Sutta", "para_seq": 3, "hits": 1, "first_offset": 148}}
{"text": ". Knowing that there were in the forest, near the city of Kapilavatthu, five hundred and more disciples, delighted in the word of the Buddha, the Master thereupon addressed them:", "entities": [[56, 68, "GPE"]], "meta": {"term": "Kapilavatthu", "nikaya": "DN", "identifier": "dn.20.0.piya.html", "title": "Maha-samaya Sutta", "para_seq": 14, "hits": 1, "first_offset": 56}}
{"text": ". \"Seven thousand terrestrial yakkhas [6] of Kapilavatthu possessed of iddhi (super normal) power, radiant, comely, and followed by a retinue of attendants, [7] have come rejoicing to the forest to see [8] the assembly of (arahant) monks.", "entities": [[42, 54, "GPE"]], "meta": {"term": "Kapilavatthu", "nikaya": "DN", "identifier": "dn.20.0.piya.html", "title": "Maha-samaya Sutta", "para_seq": 20, "hits": 1, "first_offset": 42}}
{"text": "28. \"Dhatarattha over the East, to the South Virulhaka, Westward Virupakkha, Kuvera over the North — these four great Kings stood illuminating the four quarters of the forest in the vicinity of Kapilavatthu.", "entities": [[189, 201, "GPE"]], "meta": {"term": "Kapilavatthu", "nikaya": "DN", "identifier": "dn.20.0.piya.html", "title": "Maha-samaya Sutta", "para_seq": 30, "hits": 1, "first_offset": 189}}
{"text": "I have heard that on one occasion the Blessed One was living among the Magadhans at Dakkhinagiri in the brahman village of Ekanala . Now at that time approximately 500 of the brahman Kasi Bharadvaja's plows were yoked at the sowing time. Then, in the early morning, putting on his lower robe and taking his bowl & robes, the Blessed One went to where Kasi Bharadvaja was working. Now at that time Kasi Bharadvaja's food-distribution was underway. So the Blessed One went to Kasi Bharadvaja's food-distribution and, on arrival, stood to one side. Kasi Bharadvaja saw the Blessed One standing for alms, and on seeing him, said to him, \"I, contemplative, plow & sow. Having plowed & sown, I eat. You, too, contemplative, should plow & sow. Having plowed & sown, you (will) eat.\"", "entities": [[181, 185, "GPE"], [349, 353, "GPE"], [395, 399, "GPE"], [472, 476, "GPE"], [544, 548, "GPE"]], "meta": {"term": "Kasi", "nikaya": "KN", "identifier": "snp.1.04.than.html", "title": "Kasi Bharadvaja Sutta", "para_seq": 1, "hits": 5, "first_offset": 181}}
{"text": "\"Now, suppose someone were to say, 'King Pasenadi Kosala reigns over Kasi & Kosala. He alone should consume the fruits & revenues of Kasi & Kosala, and not share them with others.' Would someone speaking in this way be a creator of obstacles for King Pasenadi's subjects — you & others — or would he not?\"", "entities": [[63, 67, "GPE"], [127, 131, "GPE"]], "meta": {"term": "Kasi", "nikaya": "DN", "identifier": "dn.12.0.than.html", "title": "Lohicca Sutta", "para_seq": 25, "hits": 2, "first_offset": 63}}
{"text": "\"And if anyone were to say, 'King Pasenadi Kosala reigns over Kasi & Kosala. He alone should consume the fruits & revenues of Kasi & Kosala, and not share them with others,' he, speaking in this way, would be a creator of obstacles for King Pasenadi's subjects — you & others. Being a creator of obstacles, he would not be sympathetic for their welfare. In one not sympathetic for their welfare, the mind would be established in animosity for them. When the mind is established in animosity, there is wrong view. For one of wrong view, I tell you, there is one of two destinations: either hell or the animal womb. In the same way, if anyone were to say, 'Suppose that a brahman or contemplative were to arrive at a skillful doctrine. Having arrived at a skillful doctrine, he should not declare it to anyone else, for what can one person do for another? It would be just the same as if, having cut through an old bond, one were to make another new bond. I say that such a thing is an evil, greedy deed, for what can one person do for another?' — he, speaking in this way, would be a creator of obstacles for those children of good family who, coming to the doctrine & discipline revealed by the Tathagata, attain the sort of grand distinction where they attain the fruit of stream-entry, the fruit of once-returning, the fruit of non-returning, the fruit of arahantship; and also for those who ripen deva wombs for the sake of bringing about the deva state. Being a creator of obstacles, he would not be sympathetic for their welfare. In one not sympathetic for their welfare, the mind would be established in animosity for them. When the mind is established in animosity, there is wrong view. For one of wrong view, I tell you, there is one of two destinations: either hell or the animal womb.", "entities": [[54, 58, "GPE"], [118, 122, "GPE"]], "meta": {"term": "Kasi", "nikaya": "DN", "identifier": "dn.12.0.than.html", "title": "Lohicca Sutta", "para_seq": 35, "hits": 2, "first_offset": 54}}
{"text": "\"What do you think, Lohicca. Doesn't King Pasenadi Kosala reign over Kasi & Kosala?\"", "entities": [[68, 72, "GPE"]], "meta": {"term": "Kasi", "nikaya": "DN", "identifier": "dn.12.0.than.html", "title": "Lohicca Sutta", "para_seq": 23, "hits": 1, "first_offset": 68}}
{"text": "Then the Kasi Bharadvaja addressed the Blessed One with a verse:", "entities": [[9, 13, "GPE"]], "meta": {"term": "Kasi", "nikaya": "KN", "identifier": "snp.1.04.than.html", "title": "Kasi Bharadvaja Sutta", "para_seq": 4, "hits": 1, "first_offset": 9}}
{"text": "Then Kasi Bharadvaja, having heaped up milk-rice in a large bronze serving bowl, offered it to the Blessed One, [saying,] \"May Master Gotama eat [this] milk-rice. The master is a plowman, for the Master Gotama plows the plowing that has as its fruit the deathless.\"", "entities": [[5, 9, "GPE"]], "meta": {"term": "Kasi", "nikaya": "KN", "identifier": "snp.1.04.than.html", "title": "Kasi Bharadvaja Sutta", "para_seq": 6, "hits": 1, "first_offset": 5}}
{"text": "So Kasi Bharadvaja dumped the milk-rice in water with no living beings. And the milk-rice, when dropped in the water, hissed & sizzled, seethed & steamed. Just as an iron ball heated all day, when tossed in the water, hisses & sizzles, seethes & steams, in the same way the milk-rice, when dropped in the water, hissed & sizzled, seethed & steamed.", "entities": [[0, 4, "GPE"]], "meta": {"term": "Kasi", "nikaya": "KN", "identifier": "snp.1.04.than.html", "title": "Kasi Bharadvaja Sutta", "para_seq": 9, "hits": 1, "first_offset": 0}}
{"text": "Then Kasi Bharadvaja — in awe, his hair standing on end — went to the Blessed One and, on arrival, throwing himself down with his head at the Blessed One's feet, said to him, \"Magnificent, Master Gotama! Magnificent! Just as if he were to place upright what was overturned, to reveal what was hidden, to show the way to one who was lost, or to carry a lamp into the dark so that those with eyes could see forms, in the same way has Master Gotama — through many lines of reasoning — made the Dhamma clear. I go to Master Gotama for refuge, to the Dhamma, and to the Community of monks. May Master Gotama remember me as a lay follower who has gone to him for refuge, from this day forward, for life. Let me obtain the going forth in Master Gotama's presence, let me obtain admission.\"", "entities": [[5, 9, "GPE"]], "meta": {"term": "Kasi", "nikaya": "KN", "identifier": "snp.1.04.than.html", "title": "Kasi Bharadvaja Sutta", "para_seq": 10, "hits": 1, "first_offset": 5}}
{"text": "Then the brahman Kasi Bharadvaja obtained the going forth in the Blessed One's presence, he obtained admission. And not long after his admission — dwelling alone, secluded, heedful, ardent, & resolute — he in no long time reached & remained in the supreme goal of the celibate life, for which clansmen rightly go forth from home into homelessness, knowing & realizing it for himself in the here & now. He knew: \"Birth is ended, the celibate life fulfilled, the task done. There is nothing further for the sake of this world.\" And so Ven. Bharadvaja became another one of the arahants.", "entities": [[17, 21, "GPE"]], "meta": {"term": "Kasi", "nikaya": "KN", "identifier": "snp.1.04.than.html", "title": "Kasi Bharadvaja Sutta", "para_seq": 11, "hits": 1, "first_offset": 17}}
{"text": "\"Thus, when asked about a fruit of the contemplative life, visible here and now, Purana Kassapa answered with non-action. Just as if a person, when asked about a mango, were to answer with a breadfruit; or, when asked about a breadfruit, were to answer with a mango: In the same way, when asked about a fruit of the contemplative life, visible here and now, Purana Kassapa answered with non-action. The thought occurred to me: 'How can anyone like me think of disparaging a brahman or contemplative living in his realm?' Yet I neither delighted in Purana Kassapa's words nor did I protest against them. Neither delighting nor protesting, I was dissatisfied. Without expressing dissatisfaction, without accepting his teaching, without adopting it, I got up from my seat and left.", "entities": [[87, 94, "PERSON"], [364, 371, "PERSON"], [554, 561, "PERSON"]], "meta": {"term": "Kassapa", "nikaya": "DN", "identifier": "dn.02.0.than.html", "title": "Samaññaphala Sutta", "para_seq": 27, "hits": 3, "first_offset": 87}}
{"text": "Now on that occasion 500 devatās were in a state of eagerness for the chance to give alms to Ven. Mahā Kassapa. But Ven. Mahā Kassapa, turning down those 500 devatās, early in the morning adjusted his under robe [1] and — carrying his bowl & robes — went into Rājagaha for alms along the streets of the poor, the streets of the indigent, the streets of the weavers. The Blessed One saw that Ven. Mahā Kassapa had gone into Rājagaha for alms along the streets of the poor, the streets of the indigent, the streets of the weavers.", "entities": [[96, 103, "PERSON"], [119, 126, "PERSON"], [394, 401, "PERSON"]], "meta": {"term": "Kassapa", "nikaya": "KN", "identifier": "ud.1.06.than.html", "title": "Kassapa Sutta", "para_seq": 2, "hits": 3, "first_offset": 96}}
{"text": "Now on that occasion Sakka, the deva-king, wanted to give alms to Ven. Mahā Kassapa. So, assuming the appearance of a weaver, he was working a loom, while Sujātā, an asura-maiden, filled the shuttle. Then, as Ven. Mahā Kassapa was going on an almsround that bypassed no donors [1] in Rājagaha, he arrived at Sakka's home. Sakka saw him coming from afar and, on seeing him, came out of house to meet him. Taking the bowl from his hand, entered the house, took cooked rice from the pot, filled the bowl, and gave it back to Ven. Mahā Kassapa. And that gift of alms included many kinds of curry, many kinds of sauces.", "entities": [[69, 76, "PERSON"], [212, 219, "PERSON"], [525, 532, "PERSON"]], "meta": {"term": "Kassapa", "nikaya": "KN", "identifier": "ud.3.07.than.html", "title": "Kassapa Sutta", "para_seq": 3, "hits": 3, "first_offset": 69}}
{"text": "\"Once, lord, I approached Purana Kassapa and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings and courtesies, I sat to one side. As I was sitting there I asked him: 'Venerable Kassapa, there are these common craftsmen... They live off the fruits of their crafts, visible in the here and now... Is it possible, venerable sir, to point out a similar fruit of the contemplative life, visible in the here and now?'", "entities": [[32, 39, "PERSON"], [219, 226, "PERSON"]], "meta": {"term": "Kassapa", "nikaya": "DN", "identifier": "dn.02.0.than.html", "title": "Samaññaphala Sutta", "para_seq": 25, "hits": 2, "first_offset": 32}}
{"text": "26. Now at that time the Venerable Maha Kassapa [63] was journeying from Pava to Kusinara together with a large company of five hundred bhikkhus. And on the way, the Venerable Maha Kassapa went aside from the highway and sat down at the foot of a tree.", "entities": [[29, 36, "PERSON"], [170, 177, "PERSON"]], "meta": {"term": "Kassapa", "nikaya": "DN", "identifier": "dn.16.1-6.vaji.html", "title": "Maha-parinibbana Sutta", "para_seq": 422, "hits": 2, "first_offset": 29}}
{"text": "\"The purpose of the deities, Vasetthas, is this: 'The Venerable Maha Kassapa is on his way from Pava to Kusinara together with a large company of five hundred bhikkhus. Let not the Blessed One's pyre be set alight until the Venerable Maha Kassapa has paid homage at the feet of the Blessed One.'\"", "entities": [[64, 71, "PERSON"], [234, 241, "PERSON"]], "meta": {"term": "Kassapa", "nikaya": "DN", "identifier": "dn.16.1-6.vaji.html", "title": "Maha-parinibbana Sutta", "para_seq": 431, "hits": 2, "first_offset": 64}}
{"text": "Now at that time Ven. Maha Kassapa was traveling on the highway from Pava to Kusinara with a large community of monks, approximately 500 monks in all. Leaving the road, he sat down at the foot of a tree. Meanwhile, a certain naked ascetic, carrying a coral-tree flower from Kusinara, was traveling on the highway to Pava. Ven. Maha Kassapa saw the naked ascetic coming from afar, and on seeing him said to him, \"Do you know our teacher, friend?\"", "entities": [[20, 27, "PERSON"], [325, 332, "PERSON"]], "meta": {"term": "Kassapa", "nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": 114, "hits": 2, "first_offset": 20}}
{"text": "\"The devas' intention, Vasitthas, is, 'This Ven. Maha Kassapa is traveling on the highway from Pava to Kusinara with a large community of monks, approximately 500 monks in all. The Blessed One's pyre will not catch fire until Ven. Maha Kassapa has worshipped the Blessed One's feet with his head.'\"", "entities": [[49, 56, "PERSON"], [231, 238, "PERSON"]], "meta": {"term": "Kassapa", "nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": 122, "hits": 2, "first_offset": 49}}
{"text": "So Ven . Maha Kassapa went to the Blessed One's pyre at Makuta-bandhana, the Mallans' memorial near Kusinara. On arrival, arranging his robe over one shoulder, he placed his hands palm-to-palm over his heart, circumambulated the pyre, uncovered the Blessed One's feet, [12] and worshipped them with his head. And the 500 monks, arranging their robes over one shoulder, placed their hands palm-to-palm over their hearts, circumambulated the pyre, and worshipped the Blessed One's feet with their heads. As soon as it had been worshipped by Ven. Maha Kassapa and the 500 monks, the Blessed One's pyre caught fire of its own accord. In the burning of the Blessed One's body, no cinder or ash of the outer skin, inner skin, flesh, tendons, or oil of the joints could be discerned. Only the bone-relics [13] remained. Just as in the burning of ghee or oil, no cinder or ash can be discerned; in the same way, in the burning of the Blessed One's body, no cinder or ash of the outer skin, inner skin, flesh, tendons, or oil of the joints could be discerned. Only the bone-relics remained. And of the 500 twin-wrappings only two were burnt: the innermost & the outermost.", "entities": [[5, 12, "PERSON"], [540, 547, "PERSON"]], "meta": {"term": "Kassapa", "nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": 124, "hits": 2, "first_offset": 5}}
{"text": "Now on that occasion 500 devatās were in a state of eagerness for the chance to give alms to Ven. Mahā Kassapa. But Ven. Mahā Kassapa, turning down those 500 devatās, early in the morning adjusted his under robe and — carrying his bowl & robes — went into Rājagaha for alms.", "entities": [[96, 103, "PERSON"], [119, 126, "PERSON"]], "meta": {"term": "Kassapa", "nikaya": "KN", "identifier": "ud.3.07.than.html", "title": "Kassapa Sutta", "para_seq": 2, "hits": 2, "first_offset": 96}}
{"text": "When this was said, one of the ministers said to the king: \"Your majesty, there is Purana Kassapa , the leader of a community, the leader of a group, the teacher of a group, honored and famous, esteemed as holy by the mass of people. He is aged, long gone forth, advanced in years, in the last phase of life. Your majesty should visit him. Perhaps, if you visited him, he would enlighten and bring peace to your mind.\"", "entities": [[90, 97, "PERSON"]], "meta": {"term": "Kassapa", "nikaya": "DN", "identifier": "dn.02.0.than.html", "title": "Samaññaphala Sutta", "para_seq": 2, "hits": 1, "first_offset": 90}}
{"text": "\"When this was said, Purana Kassapa said to me, 'Great king, in acting or getting others to act, in mutilating or getting others to mutilate, in torturing or getting others to torture, in inflicting sorrow or in getting others to inflict sorrow, in tormenting or getting others to torment, in intimidating or getting others to intimidate, in taking life, taking what is not given, breaking into houses, plundering wealth, committing burglary, ambushing highways, committing adultery, speaking falsehood — one does no evil. If with a razor-edged disk one were to turn all the living beings on this earth to a single heap of flesh, a single pile of flesh, there would be no evil from that cause, no coming of evil. Even if one were to go along the right bank of the Ganges, killing and getting others to kill, mutilating and getting others to mutilate, torturing and getting others to torture, there would be no evil from that cause, no coming of evil. Even if one were to go along the left bank of the Ganges, giving and getting others to give, making sacrifices and getting others to make sacrifices, there would be no merit from that cause, no coming of merit. Through generosity, self-control, restraint, and truthful speech there is no merit from that cause, no coming of merit.'", "entities": [[27, 34, "PERSON"]], "meta": {"term": "Kassapa", "nikaya": "DN", "identifier": "dn.02.0.than.html", "title": "Samaññaphala Sutta", "para_seq": 26, "hits": 1, "first_offset": 27}}
{"text": "Now on that occasion seven coiled-hair ascetics, seven Jain ascetics, seven cloth-less ascetics, seven one-cloth ascetics, & seven wanderers — their nails, armpit-hair, & body-hair grown long, carrying containers on poles [over their shoulders] — walked past, not far from the Blessed One. King Pasenadi Kosala saw the seven coiled-hair ascetics, seven Jain ascetics, seven cloth-less ascetics, seven one-cloth ascetics, & seven wanderers — their nails, armpit-hair, & body-hair grown long, carrying containers on poles [over their shoulders] — walking past, not far from the Blessed One. On seeing them, he got up from his seat, arranged his upper robe over one shoulder, knelt down with his right knee on the ground, paid homage to the seven coiled-hair ascetics, seven Jain ascetics, seven cloth-less ascetics, seven one-cloth ascetics, & seven wanderers with his hands palm-to-palm in front his heart, and announced his name three times: \"I am the king, venerable sirs, Pasenadi Kosala. I am the king, venerable sirs, Pasenadi Kosala. I am the king, venerable sirs, Pasenadi Kosala.\"", "entities": [[283, 287, "PERSON"], [288, 296, "PERSON"], [945, 949, "PERSON"], [967, 975, "PERSON"], [993, 997, "PERSON"], [1015, 1023, "PERSON"], [1041, 1045, "PERSON"], [1063, 1071, "PERSON"]], "meta": {"term": "King Pasenadi", "nikaya": "KN", "identifier": "ud.6.02.than.html", "title": "Paṭisalla Sutta", "para_seq": 2, "hits": 8, "first_offset": 283}}
{"text": "\"Now, suppose someone were to say, 'King Pasenadi Kosala reigns over Kasi & Kosala. He alone should consume the fruits & revenues of Kasi & Kosala, and not share them with others.' Would someone speaking in this way be a creator of obstacles for King Pasenadi's subjects — you & others — or would he not?\"", "entities": [[30, 43, "PERSON"], [240, 244, "PERSON"], [245, 253, "PERSON"]], "meta": {"term": "King Pasenadi", "nikaya": "DN", "identifier": "dn.12.0.than.html", "title": "Lohicca Sutta", "para_seq": 25, "hits": 4, "first_offset": 30}}
{"text": "\"And if anyone were to say, 'King Pasenadi Kosala reigns over Kasi & Kosala. He alone should consume the fruits & revenues of Kasi & Kosala, and not share them with others,' he, speaking in this way, would be a creator of obstacles for King Pasenadi's subjects — you & others. Being a creator of obstacles, he would not be sympathetic for their welfare. In one not sympathetic for their welfare, the mind would be established in animosity for them. When the mind is established in animosity, there is wrong view. For one of wrong view, I tell you, there is one of two destinations: either hell or the animal womb. In the same way, if anyone were to say, 'Suppose that a brahman or contemplative were to arrive at a skillful doctrine. Having arrived at a skillful doctrine, he should not declare it to anyone else, for what can one person do for another? It would be just the same as if, having cut through an old bond, one were to make another new bond. I say that such a thing is an evil, greedy deed, for what can one person do for another?' — he, speaking in this way, would be a creator of obstacles for those children of good family who, coming to the doctrine & discipline revealed by the Tathagata, attain the sort of grand distinction where they attain the fruit of stream-entry, the fruit of once-returning, the fruit of non-returning, the fruit of arahantship; and also for those who ripen deva wombs for the sake of bringing about the deva state. Being a creator of obstacles, he would not be sympathetic for their welfare. In one not sympathetic for their welfare, the mind would be established in animosity for them. When the mind is established in animosity, there is wrong view. For one of wrong view, I tell you, there is one of two destinations: either hell or the animal womb.", "entities": [[21, 25, "PERSON"], [26, 34, "PERSON"], [228, 232, "PERSON"], [233, 241, "PERSON"]], "meta": {"term": "King Pasenadi", "nikaya": "DN", "identifier": "dn.12.0.than.html", "title": "Lohicca Sutta", "para_seq": 35, "hits": 4, "first_offset": 21}}
{"text": "I have heard that on one occasion the Blessed One was staying near Sāvatthī at Jeta's Grove, Anāthapiṇḍika's monastery. And on that occasion a large number of monks, after the meal, on returning from their alms round, were sitting gathered together in the assembly hall when this discussion arose: \"Friends, which of these two kings has greater wealth, greater possessions, the greater treasury, the larger realm, the greater stock of riding animals, the greater army, greater power, greater might: King Seniya Bimbisāra of Magadha or King Pasenadi of Kosala?\" And this discussion came to no conclusion.", "entities": [[325, 330, "PERSON"], [497, 501, "PERSON"], [533, 537, "PERSON"], [538, 546, "PERSON"]], "meta": {"term": "King Pasenadi", "nikaya": "KN", "identifier": "ud.2.02.than.html", "title": "Rājā Sutta", "para_seq": 1, "hits": 4, "first_offset": 325}}
{"text": "\"Just now, lord, after the meal, on returning from our alms round, we were sitting gathered here at the assembly hall when this discussion arose: 'Friends, which of these two kings has greater wealth, greater possessions, the greater treasury, the larger realm, the greater stock of riding animals, the greater army, greater power, greater might: King Seniya Bimbisāra of Magadha or King Pasenadi of Kosala?' This was the discussion that had come to no conclusion when the Blessed One arrived.\"", "entities": [[174, 179, "PERSON"], [346, 350, "PERSON"], [382, 386, "PERSON"], [387, 395, "PERSON"]], "meta": {"term": "King Pasenadi", "nikaya": "KN", "identifier": "ud.2.02.than.html", "title": "Rājā Sutta", "para_seq": 3, "hits": 4, "first_offset": 174}}
{"text": "Now on that occasion at the storehouse of King Pasenadi Kosala contemplatives & brahmans were being given as much oil or ghee as they needed to drink, but not to take away. So the thought occurred to the wanderer, \"At present at the storehouse of King Pasenadi Kosala contemplatives & brahmans are being given as much oil or ghee as they need to drink, but not to take away. Suppose, having gone there, I were to drink as much oil as I need and, on returning home, vomiting it up, were to give it to use at this delivery?\"", "entities": [[35, 39, "PERSON"], [40, 48, "PERSON"], [240, 244, "PERSON"], [245, 253, "PERSON"]], "meta": {"term": "King Pasenadi", "nikaya": "KN", "identifier": "ud.2.06.than.html", "title": "Gabbhini Sutta", "para_seq": 6, "hits": 4, "first_offset": 35}}
{"text": "Responding, \"As you say, masters,\" to those wanderers of other sects, Sundarī the female wanderer went often to Jeta's Grove. When the wanderers of other sects knew that many people had seen Sundarī the female wanderer going often to Jeta's Grove, then — having murdered her and buried her right there in the moat-ditch surrounding Jeta's Grove — they went to King Pasenadi Kosala and, on arrival, said to him, \"Great king, we can't find Sundarī the female wanderer.\"", "entities": [[360, 373, "PERSON"], [418, 422, "PERSON"]], "meta": {"term": "King Pasenadi", "nikaya": "KN", "identifier": "ud.4.08.than.html", "title": "Sundarī Sutta", "para_seq": 5, "hits": 3, "first_offset": 360}}
{"text": "I have heard that on one occasion the Blessed One was on a wandering tour among the Kosalans with a large community of monks — approximately 500 monks in all — and arrived at Salavatika . Now at that time the brahman Lohicca was reigning with feudatory rights over Salavatika — together with its wealth, grass, timber, & grain — through a royal grant bestowed by King Pasenadi Kosala . And at that time an evil viewpoint to this effect had arisen to him: \"Suppose that a brahman or contemplative were to arrive at a skillful doctrine. Having arrived at a skillful doctrine, he should not declare it to anyone else, for what can one person do for another? It would be just the same as if, having cut through an old bond, one were to make another new bond. I say that such a thing is an evil, greedy deed, for what can one person do for another?\"", "entities": [[361, 365, "PERSON"], [366, 374, "PERSON"]], "meta": {"term": "King Pasenadi", "nikaya": "DN", "identifier": "dn.12.0.than.html", "title": "Lohicca Sutta", "para_seq": 1, "hits": 2, "first_offset": 361}}
{"text": "\"What do you think, Lohicca. Doesn't King Pasenadi Kosala reign over Kasi & Kosala?\"", "entities": [[36, 40, "PERSON"], [41, 49, "PERSON"]], "meta": {"term": "King Pasenadi", "nikaya": "DN", "identifier": "dn.12.0.than.html", "title": "Lohicca Sutta", "para_seq": 23, "hits": 2, "first_offset": 36}}
{"text": "So, having gone to the storehouse of King Pasenadi Kosala, he drank as much oil as he needed but, on returning home, was unable to bring it up or pass it down. So he rolled back & forth, suffering from fierce pains, sharp & severe. Then early in the morning the Blessed One adjusted his under robe and — carrying his bowl & robes — went into Sāvatthī for alms. He saw the wanderer rolling back & forth, suffering from fierce pains, sharp & severe.", "entities": [[33, 37, "PERSON"], [38, 46, "PERSON"]], "meta": {"term": "King Pasenadi", "nikaya": "KN", "identifier": "ud.2.06.than.html", "title": "Gabbhini Sutta", "para_seq": 7, "hits": 2, "first_offset": 33}}
{"text": "I have heard that on one occasion the Blessed One was staying near Sāvatthī at the Eastern Monastery, the palace of Migāra's mother. [1] And on that occasion, Visākhā, Migāra's mother, had some dealings with King Pasenadi Kosala that he did not settle as she had wished. So in the middle of the day she went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As she was sitting there the Blessed One said to her, \"Well now, Visākhā, where are you coming from in the middle of the day?\"", "entities": [[206, 210, "PERSON"], [211, 219, "PERSON"]], "meta": {"term": "King Pasenadi", "nikaya": "KN", "identifier": "ud.2.09.than.html", "title": "Visākhā Sutta", "para_seq": 1, "hits": 2, "first_offset": 206}}
{"text": "\"Just now, lord, I had some dealings with King Pasenadi Kosala that he did not settle as I had wished.\"", "entities": [[41, 45, "PERSON"], [46, 54, "PERSON"]], "meta": {"term": "King Pasenadi", "nikaya": "KN", "identifier": "ud.2.09.than.html", "title": "Visākhā Sutta", "para_seq": 2, "hits": 2, "first_offset": 41}}
{"text": "This was said by the Blessed One, said by the Arahant, so I have heard: \"Anyone whose passion is unabandoned, whose aversion is unabandoned, whose delusion is unabandoned is said to have gone over to Mara's camp, has come under Mara's power. The Evil One can do with that person as he likes. But anyone whose passion is abandoned, whose aversion is abandoned, whose delusion is abandoned is said not to have gone over to Mara's camp, has thrown off Mara's power. With that person, the Evil One cannot do as he likes.\"", "entities": [[200, 204, "PERSON"], [228, 232, "PERSON"], [421, 425, "PERSON"], [449, 453, "PERSON"]], "meta": {"term": "Mara", "nikaya": "KN", "identifier": "iti.3.050-099.than.html", "title": "Itivuttaka", "para_seq": 19, "hits": 4, "first_offset": 200}}
{"text": ". \"When all the Devas headed by Inda (Sakka), and all Brahmas headed by Haritta had come, there came the host of Mara. Lo! The folly of Mara, the Murky One, (Kanha). [15]", "entities": [[110, 114, "PERSON"], [133, 137, "PERSON"]], "meta": {"term": "Mara", "nikaya": "DN", "identifier": "dn.20.0.piya.html", "title": "Maha-samaya Sutta", "para_seq": 61, "hits": 2, "first_offset": 110}}
{"text": ". \"'Monks, the host of Mara have come (and gone). Know them (beware of them).' And they (non-arahants) hearing the word of the Buddha, strove (to gain Deliverance) from their defilements. (From the passion-free arahants) the army of Mara has departed; even so much as a hair in them (arahants) was not affected.", "entities": [[19, 23, "PERSON"], [229, 233, "PERSON"]], "meta": {"term": "Mara", "nikaya": "DN", "identifier": "dn.20.0.piya.html", "title": "Maha-samaya Sutta", "para_seq": 65, "hits": 2, "first_offset": 19}}
{"text": "This was said by the Blessed One, said by the Arahant, so I have heard: \"Endowed with three qualities a monk has passed beyond Mara's domain and shines like the sun. Which three? There is the case where a monk is endowed with the aggregate of virtue of one beyond training [i.e., an arahant], the aggregate of concentration of one beyond training, the aggregate of discernment of one beyond training. Endowed with these three qualities a monk has passed beyond Mara's domain and shines like the sun.\"", "entities": [[127, 131, "PERSON"], [461, 465, "PERSON"]], "meta": {"term": "Mara", "nikaya": "KN", "identifier": "iti.3.050-099.than.html", "title": "Itivuttaka", "para_seq": 10, "hits": 2, "first_offset": 127}}
{"text": "Mara spoke these words whilst standing in the presence of the Awakened One. To Mara speaking thus, the Lord replied:", "entities": [[0, 4, "PERSON"], [79, 83, "PERSON"]], "meta": {"term": "Mara", "nikaya": "KN", "identifier": "snp.3.02.irel.html", "title": "Padhana Sutta", "para_seq": 3, "hits": 2, "first_offset": 0}}
{"text": "\"Now, if there are any who ask, 'Would there be the right contemplation of dualities in yet another way?' they should be told, 'There would.' 'How would that be?' 'Whatever is considered as \"This is true\" by the world with its devas, Maras, & Brahmas, with its contemplatives & brahmans, its royalty & commonfolk, is rightly seen as it actually is with right discernment by the noble ones as \"This is false\"': this is one contemplation. 'Whatever is considered as \"This is false\" by the world with its devas, Maras, & Brahmas, with its contemplatives & brahmans, its royalty & commonfolk, is rightly seen as it actually is with right discernment by the noble ones as \"This is true\"': this is a second contemplation. For a monk rightly contemplating this duality in this way — heedful, ardent, & resolute — one of two fruits can be expected: either gnosis right here & now, or — if there be any remnant of clinging-sustenance — non-return.\"", "entities": [[225, 230, "PERSON"], [500, 505, "PERSON"]], "meta": {"term": "Mara", "nikaya": "KN", "identifier": "snp.3.12.than.html", "title": "Dvayatanupassana Sutta", "para_seq": 29, "hits": 2, "first_offset": 225}}
{"text": "\"Now, if there are any who ask, 'Would there be the right contemplation of dualities in yet another way?' they should be told, 'There would.' 'How would that be?' 'Whatever is considered as \"This is bliss\" by the world with its devas, Maras, & Brahmas, with its contemplatives & brahmans, its royalty & commonfolk, is rightly seen as it actually is with right discernment by the noble ones as \"This is stressful\"': this is one contemplation. 'Whatever is considered as \"This is stressful\" by the world with its devas, Maras, & Brahmas, with its contemplatives & brahmans, its royalty & commonfolk, is rightly seen as it actually is with right discernment by the noble ones as \"This is bliss\"': this is a second contemplation. For a monk rightly contemplating this duality in this way — heedful, ardent, & resolute — one of two fruits can be expected: either gnosis right here & now, or — if there be any remnant of clinging-sustenance — non-return.\"", "entities": [[226, 231, "PERSON"], [509, 514, "PERSON"]], "meta": {"term": "Mara", "nikaya": "KN", "identifier": "snp.3.12.than.html", "title": "Dvayatanupassana Sutta", "para_seq": 31, "hits": 2, "first_offset": 226}}
{"text": "Then Lohicca heard it said, \"Gotama the contemplative — the son of the Sakyans, having gone forth from the Sakyan clan — on a wandering tour among the Kosalans with a large community of monks — approximately 500 monks in all — has arrived at Salavatika. And of that Master Gotama this fine reputation has spread: 'He is indeed a Blessed One, worthy, & rightly self-awakened, consummate in knowledge & conduct, well-gone, a knower of the cosmos, an unexcelled trainer of those persons ready to be tamed, teacher of human & divine beings, awakened, blessed. He has made known — having realized it through direct knowledge — this world with its devas, maras, & brahmas, its generations with their contemplatives & brahmans, their rulers & common people; has explained the Dhamma admirable in the beginning, admirable in the middle, admirable in the end; has expounded the holy life both in its particulars & in its essence, entirely perfect, surpassingly pure. It is good to see such a worthy one.'\"", "entities": [[649, 654, "PERSON"]], "meta": {"term": "Mara", "nikaya": "DN", "identifier": "dn.12.0.than.html", "title": "Lohicca Sutta", "para_seq": 2, "hits": 1, "first_offset": 649}}
{"text": "4. But the Venerable Ananda was unable to grasp the plain suggestion, the significant prompting, given by the Blessed One. As though his mind was influenced by Mara, [22] he did not beseech the Blessed One: \"May the Blessed One remain, O Lord!. May the Happy One remain, O Lord, throughout the world-period, for the welfare and happiness of the multitude, out of compassion for the world, for the benefit, well being, and happiness of gods and men!\"", "entities": [[149, 153, "PERSON"]], "meta": {"term": "Mara", "nikaya": "DN", "identifier": "dn.16.1-6.vaji.html", "title": "Maha-parinibbana Sutta", "para_seq": 160, "hits": 1, "first_offset": 149}}
{"text": "7. And when the Venerable Ananda had gone away, Mara, the Evil One, approached the Blessed One. And standing at one side he spoke to the Blessed One, saying: \"Now, O Lord, let the Blessed One come to his final passing away; let the Happy One utterly pass away! The time has come for the Parinibbana of the Lord.", "entities": [[41, 45, "PERSON"]], "meta": {"term": "Mara", "nikaya": "DN", "identifier": "dn.16.1-6.vaji.html", "title": "Maha-parinibbana Sutta", "para_seq": 164, "hits": 1, "first_offset": 41}}
{"text": "9. When this was said, the Blessed One spoke to Mara, the Evil One, saying: \"Do not trouble yourself, Evil One. Before long the Parinibbana of the Tathagata will come about. Three months hence the Tathagata will utterly pass away.\"", "entities": [[45, 49, "PERSON"]], "meta": {"term": "Mara", "nikaya": "DN", "identifier": "dn.16.1-6.vaji.html", "title": "Maha-parinibbana Sutta", "para_seq": 168, "hits": 1, "first_offset": 45}}
{"text": "22. \"Now there are eight kinds of assemblies, Ananda, that is to say, assemblies of nobles, brahmans, householders, ascetics, of the Four Great Kings, of the Thirty-three gods, of Maras, and of Brahmas.", "entities": [[171, 176, "PERSON"]], "meta": {"term": "Mara", "nikaya": "DN", "identifier": "dn.16.1-6.vaji.html", "title": "Maha-parinibbana Sutta", "para_seq": 177, "hits": 1, "first_offset": 171}}
{"text": "\"It is strange, Moggallana, it is remarkable, Moggallana, how that stupid person should have waited until he was taken by the arm.\"", "entities": [[9, 19, "PERSON"], [39, 49, "PERSON"]], "meta": {"term": "Moggallana", "nikaya": "KN", "identifier": "ud.5.05.irel.html", "title": "Uposatha Sutta", "para_seq": 7, "hits": 2, "first_offset": 9}}
{"text": ". Moggallana, of great supernormal powers, encompasses (their minds) with his mind, seeking their minds, completely freed, without attachments. [33]", "entities": [[0, 10, "PERSON"]], "meta": {"term": "Moggallana", "nikaya": "KN", "identifier": "thag.21.00.irel.html", "title": "Vangisa", "para_seq": 44, "hits": 1, "first_offset": 0}}
{"text": ". \"The Brahmas Subrahma and Paramatta, came (with other Brahmas) who are possessed of iddhi power, and sons (disciples of the Buddha). The Brahmas Sanankumara and Tissa also came to the forest (to see the assembly of monks).", "entities": [[21, 30, "PERSON"]], "meta": {"term": "Paramatta", "nikaya": "DN", "identifier": "dn.20.0.piya.html", "title": "Maha-samaya Sutta", "para_seq": 59, "hits": 1, "first_offset": 21}}
{"text": "Now on that occasion Sakka, the deva-king, wanted to give alms to Ven. Mahā Kassapa. So, assuming the appearance of a weaver, he was working a loom, while Sujātā, an asura-maiden, filled the shuttle. Then, as Ven. Mahā Kassapa was going on an almsround that bypassed no donors [1] in Rājagaha, he arrived at Sakka's home. Sakka saw him coming from afar and, on seeing him, came out of house to meet him. Taking the bowl from his hand, entered the house, took cooked rice from the pot, filled the bowl, and gave it back to Ven. Mahā Kassapa. And that gift of alms included many kinds of curry, many kinds of sauces.", "entities": [[14, 19, "PERSON"], [301, 306, "PERSON"], [315, 320, "PERSON"]], "meta": {"term": "Sakka", "nikaya": "KN", "identifier": "ud.3.07.than.html", "title": "Kassapa Sutta", "para_seq": 3, "hits": 3, "first_offset": 14}}
{"text": ". \"The Asuras dwelling in the ocean were defeated by Vajirahattha (Sakka). They are brethren of Vasavassa (Sakka) [10] possessed of iddhi power, and are followed by a retinue of attendants.", "entities": [[60, 65, "PERSON"], [100, 105, "PERSON"]], "meta": {"term": "Sakka", "nikaya": "DN", "identifier": "dn.20.0.piya.html", "title": "Maha-samaya Sutta", "para_seq": 39, "hits": 2, "first_offset": 60}}
{"text": "Thus the Blessed One answered, having been asked by Sakka the deva-king. Gratified, Sakka was delighted in & expressed his approval of the Blessed One's words: \"So it is, O Blessed One. So it is, O One Well-gone. Hearing the Blessed One's answer to my question, my doubt is now cut off, my perplexity is overcome.\"", "entities": [[52, 57, "PERSON"], [84, 89, "PERSON"]], "meta": {"term": "Sakka", "nikaya": "DN", "identifier": "dn.21.2x.than.html", "title": "Sakka-pañha Sutta", "para_seq": 4, "hits": 2, "first_offset": 52}}
{"text": "Thus the Blessed One answered, having been asked by Sakka the deva-king. Gratified, Sakka was delighted in & expressed his approval of the Blessed One's words: \"So it is, O Blessed One. So it is, O One Well-gone. Hearing the Blessed One's answer to my question, my doubt is now cut off, my perplexity is overcome.\"", "entities": [[52, 57, "PERSON"], [84, 89, "PERSON"]], "meta": {"term": "Sakka", "nikaya": "DN", "identifier": "dn.21.2x.than.html", "title": "Sakka-pañha Sutta", "para_seq": 19, "hits": 2, "first_offset": 52}}
{"text": "Thus the Blessed One answered, having been asked by Sakka the deva-king. Gratified, Sakka was delighted in & expressed his approval of the Blessed One's words: \"So it is, O Blessed One. So it is, O One Well-gone. Hearing the Blessed One's answer to my question, my doubt is now cut off, my perplexity is overcome.\"", "entities": [[52, 57, "PERSON"], [84, 89, "PERSON"]], "meta": {"term": "Sakka", "nikaya": "DN", "identifier": "dn.21.2x.than.html", "title": "Sakka-pañha Sutta", "para_seq": 26, "hits": 2, "first_offset": 52}}
{"text": "Thus the Blessed One answered, having been asked by Sakka the deva-king. Gratified, Sakka was delighted in & expressed his approval of the Blessed One's words: \"So it is, O Blessed One. So it is, O One Well-gone. Hearing the Blessed One's answer to my question, my doubt is now cut off, my perplexity is overcome.\"", "entities": [[52, 57, "PERSON"], [84, 89, "PERSON"]], "meta": {"term": "Sakka", "nikaya": "DN", "identifier": "dn.21.2x.than.html", "title": "Sakka-pañha Sutta", "para_seq": 44, "hits": 2, "first_offset": 52}}
{"text": "Such were the questions that the Blessed One answered at Sakka's bidding. And so this discourse is called \"Sakka's Questions.\"", "entities": [[57, 62, "PERSON"], [107, 112, "PERSON"]], "meta": {"term": "Sakka", "nikaya": "DN", "identifier": "dn.21.2x.than.html", "title": "Sakka-pañha Sutta", "para_seq": 62, "hits": 2, "first_offset": 57}}
{"text": "The thought occurred to Ven. Mahā Kassapa, \"Now, who is this being with such power & might as this?\" Then the thought occurred to him, \"This is Sakka, the deva-king, isn't it?\" On realizing this, he said to Sakka, \"Is this your doing, Kosiya? [2] Don't ever do anything like this again.\"", "entities": [[140, 145, "PERSON"], [203, 208, "PERSON"]], "meta": {"term": "Sakka", "nikaya": "KN", "identifier": "ud.3.07.than.html", "title": "Kassapa Sutta", "para_seq": 4, "hits": 2, "first_offset": 140}}
{"text": "\"When this was said, the gods of the Thirty-three said to the monk, 'We also don't know where the four great elements... cease without remainder. But there is Sakka, the ruler of the gods, who is higher and more sublime than we. He should know... '", "entities": [[158, 163, "PERSON"]], "meta": {"term": "Sakka", "nikaya": "DN", "identifier": "dn.11.0.than.html", "title": "Kevatta (Kevaddha) Sutta", "para_seq": 103, "hits": 1, "first_offset": 158}}
{"text": "\"So the monk approached Sakka, the ruler of the gods, and, on arrival, asked him, 'Friend, where do these four great elements... cease without remainder?'", "entities": [[16, 21, "PERSON"]], "meta": {"term": "Sakka", "nikaya": "DN", "identifier": "dn.11.0.than.html", "title": "Kevatta (Kevaddha) Sutta", "para_seq": 104, "hits": 1, "first_offset": 16}}
{"text": "\"When this was said, Sakka, the ruler of the gods, said to the monk, 'I also don't know where the four great elements... cease without remainder. But there are the Yama gods who are higher and more sublime than I. They should know...'...", "entities": [[20, 25, "PERSON"]], "meta": {"term": "Sakka", "nikaya": "DN", "identifier": "dn.11.0.than.html", "title": "Kevatta (Kevaddha) Sutta", "para_seq": 105, "hits": 1, "first_offset": 20}}
{"text": "14. And when the Blessed One had passed away, simultaneously with his Parinibbana, Sakka , king of the gods, [61] spoke this stanza:", "entities": [[75, 80, "PERSON"]], "meta": {"term": "Sakka", "nikaya": "DN", "identifier": "dn.16.1-6.vaji.html", "title": "Maha-parinibbana Sutta", "para_seq": 394, "hits": 1, "first_offset": 75}}
{"text": "I have heard that on one occasion the Blessed One was staying near Vesālī at the Gabled Hall in the Great Forest. Then, early in the morning, he adjusted his under robe and — carrying his bowl & robes — went into Vesālī for alms. Then, having gone for alms in Vesālī, after the meal, returning from his alms round, he addressed Ven. Ānanda, \"Get a sitting cloth, Ānanda. We will go to the Pāvāla shrine for the day's abiding.\"", "entities": [[65, 71, "GPE"], [211, 217, "GPE"], [258, 264, "GPE"]], "meta": {"term": "Vesālī", "nikaya": "KN", "identifier": "ud.6.01.than.html", "title": "Āyusama-osajjana Sutta", "para_seq": 1, "hits": 3, "first_offset": 65}}
{"text": "Then the Blessed One, having stayed as long as he liked in Sāvatthī, went wandering in the direction of Vesālī. After wandering by stages, he arrived in Vesālī and stayed there in the Peaked Roof Pavilion in the Great Wood. Then, encompassing with his awareness the awareness of the monks staying on the bank of the River Vaggamudā, he said to Ven. Ānanda, \"This direction seems bright to me, Ānanda. This direction seems dazzling to me. It's not at all repugnant for me to go & pay attention to where the monks on the bank of the River Vaggamudā are staying. Send a messenger into their presence to say, 'The Teacher calls you, friends. The Teacher wants to see you.'\"", "entities": [[104, 110, "GPE"], [153, 159, "GPE"]], "meta": {"term": "Vesālī", "nikaya": "KN", "identifier": "ud.3.03.than.html", "title": "Yasoja Sutta", "para_seq": 11, "hits": 2, "first_offset": 104}}
{"text": "Seated, the Blessed One addressed Ven. Ānanda, \"Vesālī is refreshing, Ānanda. Refreshing, too, are the Udena shrine, the Gotamaka shrine, the Sattamba shrine, the ManySon shrine, the Sāranda shrine, the Pāvāla shrine. [1]", "entities": [[48, 54, "GPE"]], "meta": {"term": "Vesālī", "nikaya": "KN", "identifier": "ud.6.01.than.html", "title": "Āyusama-osajjana Sutta", "para_seq": 3, "hits": 1, "first_offset": 48}}
{"text": "A second time... A third time, the Blessed One addressed Ven. Ānanda, \"Vesālī is refreshing, Ānanda. Refreshing, too, are the Udena shrine, the Gotamaka shrine, the Sattamba shrine, the ManySon shrine, the Sāranda shrine, the Pāvāla shrine.", "entities": [[69, 75, "GPE"]], "meta": {"term": "Vesālī", "nikaya": "KN", "identifier": "ud.6.01.than.html", "title": "Āyusama-osajjana Sutta", "para_seq": 6, "hits": 1, "first_offset": 69}}
