{"text": "57. \"So also at Vesali, Ananda, at different times the Tathagata has spoken to you, saying: 'Pleasant, Ananda, is Vesali; pleasant are the shrines of Udena, Gotamaka, Sattambaka, Bahuputta, Sarandada, and Capala. Whosoever, Ananda, has developed... Therefore the Tathagata could, if he so desired, remain throughout a world-period or until the end of it.'", "entities": [[8, 14, "GPE"], [106, 112, "GPE"]], "meta": {"term": "Vesali", "nikaya": "DN", "identifier": "dn.16.1-6.vaji.html", "title": "Maha-parinibbana Sutta", "para_seq": 220, "hits": 2, "first_offset": 8}}
{"text": "42. And the king of Magadha, Ajatasattu, son of the Videhi queen, erected a stupa over the relics of the Blessed One at Rajagaha, and in their honor held a festival. The Licchavis of Vesali erected a stupa over the relics of the Blessed One at Vesali, and in their honor held a festival. The Sakyas of Kapilavatthu erected a stupa over the relics of the Blessed One at Kapilavatthu, and in their honor held a festival. The Bulis of Allakappa erected a stupa over the relics of the Blessed One at Allakappa, and in their honor held a festival. The Kolis of Ramagama erected a stupa over the relics of the Blessed One at Ramagama, and in their honor held a festival. The Vethadipa brahman erected a stupa over the relics of the Blessed One at Vethadipa, and in their honor held a festival. The Mallas of Pava erected a stupa over the relics of the Blessed One at Pava, and in their honor held a festival. The Mallas of Kusinara erected a stupa over the relics of the Blessed One at Kusinara, and in their honor held a festival. The brahman Dona erected a stupa over the urn, and in its honor held a festival. And the Moriyas of Pipphalivana erected a stupa over the ashes at Pipphalivana, and in their honor held a festival.", "entities": [[171, 177, "GPE"], [232, 238, "GPE"]], "meta": {"term": "Vesali", "nikaya": "DN", "identifier": "dn.16.1-6.vaji.html", "title": "Maha-parinibbana Sutta", "para_seq": 450, "hits": 2, "first_offset": 171}}
{"text": "The Licchavis of Vesali built a burial mound and held a ceremony for the Blessed One's relics in Vesali.", "entities": [[13, 19, "GPE"], [93, 99, "GPE"]], "meta": {"term": "Vesali", "nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": 139, "hits": 2, "first_offset": 13}}
{"text": "I have heard that on one occasion the Blessed One was staying in Vesali , at the Gabled Hall in the Great Forest. And on that occasion he had finished dressing in the morning and was carrying his bowl and outer robe, planning to enter Vesali for alms.", "entities": [[63, 69, "GPE"], [233, 239, "GPE"]], "meta": {"term": "Vesali", "nikaya": "MN", "identifier": "mn.036.than.html", "title": "Maha-Saccaka Sutta", "para_seq": 1, "hits": 2, "first_offset": 63}}
{"text": "On one occasion the Blessed One was staying near Vesali at the Gabled Hall in the Great Forest. Then in the early morning, Ven. Ananda , having put on his robe and carrying his bowl and outer robe, went into Vesali for alms. He saw a large number of Licchavi boys practicing archery in the stadium building. From a distance they were shooting arrows through a tiny keyhole without missing, one right after the other. On seeing this, the thought occurred to him, \"How trained these Licchavi boys are, how well-trained these Licchavi boys are, in that from a distance they can shoot arrows through a tiny keyhole without missing, one right after the other!\"", "entities": [[42, 48, "GPE"], [201, 207, "GPE"]], "meta": {"term": "Vesali", "nikaya": "SN", "identifier": "sn56.045.than.html", "title": "Vala Sutta", "para_seq": 1, "hits": 2, "first_offset": 42}}
{"text": "Then, having gone for alms in Vesali, after his meal, returning from his alms round, Ven. Ananda went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there, he said to the Blessed One: \"Just now, lord, in the early morning, having put on my robe and carrying my bowl and outer robe, I went into Vesali for alms. I saw a large number of Licchavi boys practicing archery in the stadium building. From a distance they were shooting arrows through a tiny keyhole without missing, one right after the other. On seeing this, the thought occurred to me 'How trained these Licchavi boys are, how well-trained these Licchavi boys are, in that from a distance they can shoot arrows through a tiny keyhole without missing, one right after the other!'\"", "entities": [[30, 36, "GPE"], [344, 350, "GPE"]], "meta": {"term": "Vesali", "nikaya": "SN", "identifier": "sn56.045.than.html", "title": "Vala Sutta", "para_seq": 2, "hits": 2, "first_offset": 30}}
{"text": "On one occasion the Blessed One was staying near Vesali at Gotamaka Shrine. There he addressed the monks, \"Monks!\"", "entities": [[42, 48, "GPE"]], "meta": {"term": "Vesali", "nikaya": "AN", "identifier": "an03.123.than.html", "title": "Gotamaka-cetiya Sutta", "para_seq": 1, "hits": 1, "first_offset": 42}}
{"text": "I have heard that on one occasion the Blessed One was staying near Vesālī , at the Gabled Hall in the Great Forest. And on that occasion Saccaka the Nigaṇṭha-son was dwelling in Vesālī — a debater, a sophist, [1] well-regarded by people at large. He made this statement before the assembly in Vesālī: \"I see no contemplative or brahman, the head of an order, the head of a group, or even one who claims to be an arahant, rightly self-awakened, who — engaged in debate with me — would not shiver, quiver, shake, & break out in sweat under the armpits. Even if I were to engage a senseless stump in debate, it — engaged with me in debate — would shiver, quiver, & shake, to say nothing of a human being.\"", "entities": [[65, 71, "GPE"], [176, 182, "GPE"], [291, 297, "GPE"]], "meta": {"term": "Vesālī", "nikaya": "MN", "identifier": "mn.035.than.html", "title": "Cula-Saccaka Sutta", "para_seq": 1, "hits": 3, "first_offset": 65}}
{"text": "Then early in the morning Ven. Assaji [2] adjusted his under robe and — carrying his bowl & robes — went into Vesālī for alms. Saccaka the Nigaṇṭha-son, walking & wandering around Vesālī to exercise his legs, saw Ven. Assaji coming from afar. On seeing him, he went up to him and exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he stood to one side. As he was standing there, he said to him, \"Master Assaji, how does Gotama the contemplative discipline his disciples? Or what part of his instruction is generally presented to his disciples?\"", "entities": [[110, 116, "GPE"], [180, 186, "GPE"]], "meta": {"term": "Vesālī", "nikaya": "MN", "identifier": "mn.035.than.html", "title": "Cula-Saccaka Sutta", "para_seq": 2, "hits": 2, "first_offset": 110}}
{"text": "On one occasion the Blessed One was living in Vesālī , in the Great Wood. Then a certain Vajjian monk approached him and, on arrival, having bowed down to him, sat to one side. As he was sitting there, he said to the Blessed One, \"Lord, this recitation of more than 150 training rules comes every fortnight. [1] I cannot train in reference to them.\"", "entities": [[39, 45, "GPE"]], "meta": {"term": "Vesālī", "nikaya": "AN", "identifier": "an03.083.than.html", "title": "Vajjiputta Sutta", "para_seq": 1, "hits": 1, "first_offset": 39}}
{"text": "\"Suppose a man — in need of heartwood, seeking heartwood, wandering in search of heartwood — were to enter a forest taking a sharp ax. There he would see a large plantain trunk: straight, young, immature. He would cut it at the root and, having cut it at the root, cut off the crown. Having cut off the crown, he would unfurl the leaf sheaths. Unfurling the leaf sheaths, he wouldn't even find sapwood there, to say nothing of heartwood. In the same way, Aggivessana, when you are interrogated, rebuked, & pressed by me with regard to your own statement, you are empty, void, mistaken. But it was you who made this statement before the assembly in Vesālī: 'I see no contemplative or brahman, the head of an order, the head of a group, or even one who claims to be an arahant, rightly self-awakened, who — engaged in debate with me — would not shiver, quiver, shake, & break out in sweat under the armpits. Even if I were to engage a senseless stump in debate, it — engaged with me in debate — would shiver, quiver, & shake, to say nothing of a human being.' But now some drops of sweat coming out of your forehead, drenching your upper robe, are landing on the ground, whereas now I have no sweat on my body.\" And the Blessed One uncovered his golden-colored body to the assembly. When this was said, Saccaka the Nigaṇṭha-son fell silent, abashed, sitting with his shoulders drooping, his head down, brooding, at a loss for words.", "entities": [[647, 653, "GPE"]], "meta": {"term": "Vesālī", "nikaya": "MN", "identifier": "mn.035.than.html", "title": "Cula-Saccaka Sutta", "para_seq": 59, "hits": 1, "first_offset": 647}}
{"text": "Then, not long after Potaliputta the wanderer had left, Ven. Samiddhi went to Ven. Ānanda and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he reported to Ven. Ānanda the Elder [2] the entirety of his discussion with Potaliputta the wanderer. When this was said, Ven. Ānanda said to him, \"Friend Samiddhi, there is warrant here for seeing the Blessed One. Let's go to the Blessed One and, on arrival, report this matter to him. However he explains it to us, that's how we should bear it in mind.\"", "entities": [[83, 89, "PERSON"], [266, 272, "PERSON"], [374, 380, "PERSON"]], "meta": {"term": "Ānanda", "nikaya": "MN", "identifier": "mn.136.than.html", "title": "Maha Kammavibhanga Sutta", "para_seq": 8, "hits": 3, "first_offset": 83}}
{"text": "When this was said, the Blessed One said to Ven. Ānanda, \"Look, Ānanda, at how this worthless Udāyin interrupts. I knew just now that he would interrupt in an inappropriate way. From the very beginning, Potaliputta the wanderer was asking about the three kinds of feeling. When this worthless Samiddhi was asked by him in this way, he should have answered, 'Having intentionally done — with body, with speech, or with mind — an action that is to be felt as pleasure, one experiences pleasure. Having intentionally done — with body, with speech, or with mind — an action that is to be felt as pain, one experiences pain. Having intentionally done — with body, with speech, or with mind — an action that is to be felt as neither-pleasure-nor-pain, one experiences neither-pleasure-nor-pain. Answering this way, this worthless Samiddhi would have rightly answered Potaliputta the wanderer. But then who [3] are these wanderers of other sects, foolish & inexperienced? And who would understand the Tathāgata's greater analysis of action — if you were to listen, Ānanda, to the Tathāgata analyzing the greater analysis of action?\"", "entities": [[49, 55, "PERSON"], [64, 70, "PERSON"], [1058, 1064, "PERSON"]], "meta": {"term": "Ānanda", "nikaya": "MN", "identifier": "mn.136.than.html", "title": "Maha Kammavibhanga Sutta", "para_seq": 13, "hits": 3, "first_offset": 49}}
{"text": "So Ven. Samiddhi and Ven. Ānanda went to the Blessed One and, on arrival, bowed down to him and sat to one side. As they were sitting there, Ven. Ānanda reported to the Blessed One the entirety of the discussion between Ven. Samiddhi and Potaliputta the wanderer.", "entities": [[18, 24, "PERSON"], [138, 144, "PERSON"]], "meta": {"term": "Ānanda", "nikaya": "MN", "identifier": "mn.136.than.html", "title": "Maha Kammavibhanga Sutta", "para_seq": 10, "hits": 2, "first_offset": 18}}
{"text": "\"As you say, friend, Ven. Samiddhi responded to Ven. Ānanda.", "entities": [[40, 46, "PERSON"]], "meta": {"term": "Ānanda", "nikaya": "MN", "identifier": "mn.136.than.html", "title": "Maha Kammavibhanga Sutta", "para_seq": 9, "hits": 1, "first_offset": 40}}
{"text": "\"In that case, Ānanda, listen and pay close attention. I will speak.\"", "entities": [[11, 17, "PERSON"]], "meta": {"term": "Ānanda", "nikaya": "MN", "identifier": "mn.136.than.html", "title": "Maha Kammavibhanga Sutta", "para_seq": 15, "hits": 1, "first_offset": 11}}
{"text": "\"As you say, lord,\" Ven. Ānanda responded to the Blessed One.", "entities": [[12, 18, "PERSON"]], "meta": {"term": "Ānanda", "nikaya": "MN", "identifier": "mn.136.than.html", "title": "Maha Kammavibhanga Sutta", "para_seq": 16, "hits": 1, "first_offset": 12}}
{"text": "The Blessed One said, \"Ānanda, there are four kinds of person to be found in the world. Which four? There is the case where a certain person is one who takes life, takes what is not given (steals), engages in illicit sex, lies, speaks divisively, speaks abusively, engages in idle chatter; is covetous, malevolent, & holds wrong view. With the breakup of the body, after death, he reappears in a plane of deprivation, a bad destination, a lower realm, hell.", "entities": [[19, 25, "PERSON"]], "meta": {"term": "Ānanda", "nikaya": "MN", "identifier": "mn.136.than.html", "title": "Maha Kammavibhanga Sutta", "para_seq": 17, "hits": 1, "first_offset": 19}}
{"text": "\"There is the case, Ānanda, where a certain contemplative or brahman — through ardency, exertion, commitment, heedfulness, & right attention — touches the sort of concentration of awareness that, when his mind is thus concentrated, he sees with the divine eye, pure and surpassing the human, that person — the case where one who takes life, takes what is not given (steals), engages in illicit sex, lies, speaks divisively, speaks abusively, engages in idle chatter, is covetous, malevolent, & holds wrong view, with the breakup of the body, after death, has reappeared in a plane of deprivation, a bad destination, a lower realm, hell.", "entities": [[19, 25, "PERSON"]], "meta": {"term": "Ānanda", "nikaya": "MN", "identifier": "mn.136.than.html", "title": "Maha Kammavibhanga Sutta", "para_seq": 21, "hits": 1, "first_offset": 19}}
{"text": "\"Then there is the case, Ānanda, where a certain contemplative or brahman — through ardency, exertion, commitment, heedfulness, & right attention — touches the sort of concentration of awareness that, when his mind is thus concentrated, he sees with the divine eye, pure and surpassing the human, that person — the case where one who takes life, takes what is not given (steals), engages in illicit sex, lies, speaks divisively, speaks abusively, engages in idle chatter, is covetous, malevolent, & holds wrong view, with the breakup of the body, after death, has reappeared in a good destination, a heavenly world.", "entities": [[24, 30, "PERSON"]], "meta": {"term": "Ānanda", "nikaya": "MN", "identifier": "mn.136.than.html", "title": "Maha Kammavibhanga Sutta", "para_seq": 23, "hits": 1, "first_offset": 24}}
{"text": "\"Then there is the case, Ānanda, where a certain contemplative or brahman — through ardency, exertion, commitment, heedfulness, & right attention — touches the sort of concentration of awareness that, when his mind is thus concentrated, he sees with the divine eye, pure and surpassing the human, that person — the case where one who abstains from taking life, abstains from taking what is not given, abstains from illicit sex, abstains from lying, abstains from speaking divisively, abstains from speaking abusively, abstains from idle chatter, is not covetous, not malevolent, & holds right view, with the breakup of the body, after death, reappears in a good destination, a heavenly world.", "entities": [[24, 30, "PERSON"]], "meta": {"term": "Ānanda", "nikaya": "MN", "identifier": "mn.136.than.html", "title": "Maha Kammavibhanga Sutta", "para_seq": 25, "hits": 1, "first_offset": 24}}
{"text": "\"Then there is the case, Ānanda, where a certain contemplative or brahman — through ardency, exertion, commitment, heedfulness, & right attention — touches the sort of concentration of awareness that, when his mind is thus concentrated, he sees with the divine eye, pure and surpassing the human, that person — the case where one who abstains from taking life, abstains from taking what is not given, abstains from illicit sex, abstains from lying, abstains from speaking divisively, abstains from speaking abusively, abstains from idle chatter, is not covetous, not malevolent, & holds right view, with the breakup of the body, after death, reappears in a plane of deprivation, a bad destination, a lower realm, hell.", "entities": [[24, 30, "PERSON"]], "meta": {"term": "Ānanda", "nikaya": "MN", "identifier": "mn.136.than.html", "title": "Maha Kammavibhanga Sutta", "para_seq": 27, "hits": 1, "first_offset": 24}}
{"text": "\"Now, Ānanda, in the case where the contemplative or brahman says, 'So there really are evil actions, there really is the result of misconduct,' I allow him that. When he says, 'For I saw the case where a person who took life... & held wrong view, with the breakup of the body, after death, has reappeared in a plane of deprivation, a bad destination, a lower realm, hell,' I allow him that, too. But when he says, 'Anyone who takes life... & hold wrong view: They all, on the breakup of the body, after death, reappear in a plane of deprivation, a bad destination, a lower realm, hell,' I don't allow him that. And when he says, 'Whoever knows this, knows rightly; whoever knows otherwise, their knowledge is wrong,' I don't allow him that. When, insisting through obstinacy & grasping right there on what was seen by himself, known by himself, understood by himself, he states: 'Only this is true. Everything otherwise is worthless,' I don't allow him that, either. Why is that? Because the Tathāgata's knowledge with regard to the greater analysis of action is otherwise.", "entities": [[0, 6, "PERSON"]], "meta": {"term": "Ānanda", "nikaya": "MN", "identifier": "mn.136.than.html", "title": "Maha Kammavibhanga Sutta", "para_seq": 29, "hits": 1, "first_offset": 0}}
