{"text": "\"It's amazing, my friend. It's astounding, my friend, how well-said that was by friend Ananda. And we will remember friend Ananda as endowed with these six qualities: Friend Ananda has mastered the Dhamma: dialogues, narratives of mixed prose and verse, explanations, verses, spontaneous exclamations, quotations, birth stories, amazing events, question & answer sessions. Friend Ananda teaches the Dhamma in detail — as he has heard it, as he has remembered it — to others. Friend Ananda gets others to recite the Dhamma in detail — as they have heard it, as they have remembered it. Friend Ananda holds a group chanting of the Dhamma in detail — as he has heard it, as he has remembered it. Friend Ananda thinks about & evaluates the Dhamma as he has heard it, as he has remembered it; he contemplates it with his intellect. Friend Ananda enters the Rains in monasteries in which there are senior monks who are learned, who know the tradition, who are holders of the Dhamma, the Vinaya, & the Matika. Having approached them periodically, he questions them & quizzes them: 'How it this, venerable sirs? What is the meaning of this?' They make open for friend Ananda what wasn't open, make plain what wasn't plain, dispel doubt on various doubtful points.\"", "entities": [[80, 86, "PERSON"], [116, 122, "PERSON"], [167, 173, "PERSON"], [373, 379, "PERSON"], [475, 481, "PERSON"], [585, 591, "PERSON"], [693, 699, "PERSON"], [827, 833, "PERSON"], [1153, 1159, "PERSON"]], "meta": {"term": "Ananda", "nikaya": "AN", "identifier": "an06.051.than.html", "title": "Ananda Sutta", "para_seq": 7, "hits": 9, "first_offset": 81}}
{"text": "\" There are these four marvelous & amazing qualities in Ananda. If a group of monks approaches to see Ananda, they are gratified at the sight of him. If he speaks Dhamma to them, they are gratified with what he says. Before they are sated, he falls silent. If a group of nuns approaches to see Ananda... If a group of male lay followers approaches to see Ananda... If a group of female lay followers approaches to see Ananda, they are gratified at the sight of him. If he speaks Dhamma to them, they are gratified with what he says. Before they are sated, he falls silent. These are the four marvelous & amazing qualities in Ananda. There are these four marvelous & amazing qualities in a wheel-turning monarch. If a group of noble warriors approaches to see him... If a group of brahmans approaches to see him... If a group of householders approaches to see him... If a group of contemplatives approaches to see him, they are gratified at the sight of him. If he speaks to them, they are gratified with what he says. Before they are sated, he falls silent. In the same way, monks, there are these four marvelous & amazing qualities in Ananda. If a group of monks... a group of nuns... a group of male lay followers... a group of female lay followers approaches to see Ananda, they are gratified at the sight of him. If he speaks Dhamma to them, they are gratified with what he says. Before they are sated, he falls silent. These are the four marvelous & amazing qualities in Ananda.\"", "entities": [[53, 62, "PERSON"], [98, 108, "PERSON"], [290, 300, "PERSON"], [351, 361, "PERSON"], [414, 424, "PERSON"], [622, 631, "PERSON"], [1133, 1142, "PERSON"], [1265, 1275, "PERSON"], [1473, 1482, "PERSON"]], "meta": {"term": "Ananda", "nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": 41, "hits": 9, "first_offset": 54}}
{"text": ". Then the Blessed One addressed the venerable Ananda: \"See, Ananda, how this misguided man Udayin interferes. I knew, Ananda, that this misguided man Udayin would unreasonably interfere now. To begin with it was the three kinds of feeling that were asked about by the wanderer Potaliputta. If, when this misguided man Samiddhi was asked, he had answered the wanderer Potaliputta thus: 'After doing an intentional kamma by way of body, speech and mind (whose result is) to be felt as pleasure, he feels pleasure; after doing an intentional kamma by way of body, speech and mind (whose result is) to be felt as pain, he feels pain; after doing an intentional kamma by way of body, speech and mind (whose result is) to be felt as neither-pain-nor-pleasure, he feels neither-pain-nor-pleasure' — by answering him thus, Ananda, the misguided man Samiddhi would have given the wanderer Potaliputta the right answer. Besides, Ananda, who are the foolish thoughtless wanderers of other sects that they will understand the Tathagata's Great Exposition of Kamma? (But) if you, Ananda, would listen to the Tathagata expounding the Great Exposition of Kamma (you might understand it). [3]", "entities": [[37, 53, "PERSON"], [61, 67, "PERSON"], [119, 125, "PERSON"], [816, 822, "PERSON"], [920, 926, "PERSON"], [1068, 1074, "PERSON"]], "meta": {"term": "Ananda", "nikaya": "MN", "identifier": "mn.136.nymo.html", "title": "Maha Kammavibhanga Sutta", "para_seq": 17, "hits": 6, "first_offset": 45}}
{"text": "So, setting his lodgings in order and carrying his robes & bowl, Ven. Channa went to Kosambi to where Ven. Ananda was staying in Ghosita's Park. On arrival, he exchanged courteous greetings with the Ven. Ananda. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he [told Ven. Ananda what had happened and added], \"May Ven. Ananda exhort me, may Ven. Ananda teach me, may Ven. Ananda give me a Dhamma talk so that I might see the Dhamma.\"", "entities": [[102, 113, "PERSON"], [199, 210, "PERSON"], [320, 331, "PERSON"], [367, 378, "PERSON"], [394, 405, "PERSON"], [420, 431, "PERSON"]], "meta": {"term": "Ananda", "nikaya": "SN", "identifier": "sn22.090.than.html", "title": "Channa Sutta", "para_seq": 5, "hits": 6, "first_offset": 103}}
{"text": "Then in the early morning, Ven. Ananda, having put on his robes and carrying his bowl and outer robe, went into Rajagaha for alms. The thought occurred to him, \"It's too early to go for alms in Rajagaha. What if I were to go to the brahman Moggallana the Guardsman at his construction site?\" So he went to Moggallana the Guardsman at his construction site. Moggallana the Guardsman saw him coming from afar, and on seeing him said to him, \"Come, Master Ananda. Welcome, Master Ananda. It has been a long time since Master Ananda has found the time to come here. Sit down, Master Ananda. Here is a seat made ready for you.\"", "entities": [[32, 38, "PERSON"], [453, 459, "PERSON"], [477, 483, "PERSON"], [522, 528, "PERSON"], [579, 585, "PERSON"]], "meta": {"term": "Ananda", "nikaya": "MN", "identifier": "mn.108.than.html", "title": "Gopaka Moggallana Sutta", "para_seq": 3, "hits": 5, "first_offset": 32}}
{"text": "I have heard that on one occasion Ven. Ananda was staying in Kosambi , at Ghosita 's Park. Then a certain nun said to a certain man, \"Go, my good man, to my lord Ananda and, on arrival, bowing your head to his feet in my name, tell him, 'The nun named such-and-such, venerable sir, is sick, in pain, severely ill. She bows her head to the feet of her lord Ananda and says, \"It would be good if my lord Ananda were to go to the nuns' quarters, to visit this nun out of sympathy for her.\"'\"", "entities": [[39, 45, "PERSON"], [157, 168, "PERSON"], [351, 362, "PERSON"], [397, 408, "PERSON"]], "meta": {"term": "Ananda", "nikaya": "AN", "identifier": "an04.159.than.html", "title": "Bhikkhuni Sutta", "para_seq": 1, "hits": 4, "first_offset": 37}}
{"text": "Responding, \"Yes, my lady,\" the man then approached Ven. Ananda and, on arrival, having bowed down, sat to one side. As he was sitting there he said to Ven. Ananda, \"The nun named such-and-such, venerable sir, is sick, in pain, severely ill. She bows her head to the feet of her lord Ananda and says, 'It would be good if my lord Ananda were to go to the nuns' quarters, to visit this nun out of sympathy for her.'\"", "entities": [[57, 63, "PERSON"], [157, 163, "PERSON"], [284, 290, "PERSON"], [330, 336, "PERSON"]], "meta": {"term": "Ananda", "nikaya": "AN", "identifier": "an04.159.than.html", "title": "Bhikkhuni Sutta", "para_seq": 2, "hits": 4, "first_offset": 57}}
{"text": "28. \"It is, Ananda, as if Sunidha and Vassakara had taken counsel with the gods of the Thirty-three. For I beheld, Ananda, with the heavenly eye, pure and transcending the faculty of men, a large number of deities, counted in thousands, that have taken possession of sites at Pataligama. In the region where deities of great power prevail, officials of great power are bent on constructing edifices; and where deities of medium and lesser power prevail, officials of medium and lesser power are bent on constructing edifices. Truly, Ananda, as far as the Aryan race extends and trade routes spread, this will be the foremost city Pataliputta , a trade-center. [16] But Pataliputta, Ananda, will be assailed by three perils — fire, water, and dissension.\"", "entities": [[0, 7, "PERSON"], [101, 113, "PERSON"], [516, 531, "PERSON"], [669, 680, "PERSON"]], "meta": {"term": "Ananda", "nikaya": "DN", "identifier": "dn.16.1-6.vaji.html", "title": "Maha-parinibbana Sutta", "para_seq": 87, "hits": 4, "first_offset": 0}}
{"text": ". Thus spoke the Venerable Ananda, but the Blessed One answered him, saying: \"What more does the community of bhikkhus expect from me, Ananda? I have set forth the Dhamma without making any distinction of esoteric and exoteric doctrine; there is nothing, Ananda, with regard to the teachings that the Tathagata holds to the last with the closed fist of a teacher who keeps some things back. Whosoever may think that it is he who should lead the community of bhikkhus, or that the community depends upon him, it is such a one that would have to give last instructions respecting them. But, Ananda, the Tathagata has no such idea as that it is he who should lead the community of bhikkhus, or that the community depends upon him. So what instructions should he have to give respecting the community of bhikkhus?", "entities": [[17, 33, "PERSON"], [135, 141, "PERSON"], [255, 261, "PERSON"], [589, 595, "PERSON"]], "meta": {"term": "Ananda", "nikaya": "DN", "identifier": "dn.16.1-6.vaji.html", "title": "Maha-parinibbana Sutta", "para_seq": 150, "hits": 4, "first_offset": 25}}
{"text": "49. \"It is so, Ananda. There are two occasions, Ananda, when the skin of the Tathagata appears exceedingly clear and radiant. Which are these two? The night, Ananda, when the Tathagata becomes fully enlightened in unsurpassed, supreme Enlightenment, and the night when the Tathagata comes to his final passing away into the state of Nibbana in which no element of clinging remains. These, Ananda, are the two occasions on which the skin of the Tathagata appears exceedingly clear and radiant.", "entities": [[0, 7, "PERSON"], [33, 46, "PERSON"], [142, 150, "PERSON"], [373, 380, "PERSON"]], "meta": {"term": "Ananda", "nikaya": "DN", "identifier": "dn.16.1-6.vaji.html", "title": "Maha-parinibbana Sutta", "para_seq": 288, "hits": 4, "first_offset": 0}}
{"text": "56. Then the Blessed One spoke to the Venerable Ananda, saying: \"It may come to pass, Ananda, that someone will cause remorse to Cunda the metalworker, saying: 'It is no gain to you, friend Cunda, but a loss, that it was from you the Tathagata took his last alms meal, and then came to his end.' Then, Ananda, the remorse of Cunda should be dispelled after this manner: 'It is a gain to you, friend Cunda, a blessing that the Tathagata took his last alms meal from you, and then came to his end. For, friend, face to face with the Blessed One I have heard and learned: \"There are two offerings of food which are of equal fruition, of equal outcome, exceeding in grandeur the fruition and result of any other offerings of food. Which two? The one partaken of by the Tathagata before becoming fully enlightened in unsurpassed, supreme Enlightenment; and the one partaken of by the Tathagata before passing into the state of Nibbana in which no element of clinging remains. By his deed the worthy Cunda has accumulated merit which makes for long life, beauty, well being, glory, heavenly rebirth, and sovereignty.\"' Thus, Ananda, the remorse of Cunda the metalworker should be dispelled.\"", "entities": [[38, 54, "PERSON"], [80, 92, "PERSON"], [296, 308, "PERSON"], [1113, 1125, "PERSON"]], "meta": {"term": "Ananda", "nikaya": "DN", "identifier": "dn.16.1-6.vaji.html", "title": "Maha-parinibbana Sutta", "para_seq": 294, "hits": 4, "first_offset": 44}}
{"text": "9-10. And the Venerable Ananda told his thought to the Blessed One. The Blessed One said: \"Throughout the tenfold world-system, Ananda, there are hardly any of the deities that have not gathered together to look upon the Tathagata. For a distance of twelve yojanas around the Sala Grove of the Mallas in the vicinity of Kusinara there is not a spot that could be pricked with the tip of a hair that is not filled with powerful deities. And these deities, Ananda, are complaining: 'From afar have we come to look upon the Tathagata. For rare in the world is the arising of Tathagatas, Arahants, Fully Enlightened Ones. And this day, in the last watch of the night, the Tathagata's Parinibbana will come about. But this bhikkhu of great powers has placed himself right in front of the Blessed One, concealing him, so that now, at the very end, we are prevented from looking upon him.' Thus, Ananda, the deities complain.\"", "entities": [[10, 23, "PERSON"], [114, 119, "PERSON"], [440, 453, "PERSON"], [872, 880, "PERSON"]], "meta": {"term": "Ananda", "nikaya": "DN", "identifier": "dn.16.1-6.vaji.html", "title": "Maha-parinibbana Sutta", "para_seq": 307, "hits": 4, "first_offset": 10}}
{"text": "Then the Blessed One, having stayed at Rajagaha as long as he liked, set out wandering to Savatthi . Wandering by stages, he arrived there and stayed in Jeta's Grove, Anathapindika's monastery . Ven. Punna Mantaniputta heard, \"The Blessed One has arrived at Savatthi and is staying near Savatthi in Jeta's Grove, Anathapindika's monastery.\" Setting his lodgings in order and taking his robes & bowl, he set out wandering to Savatthi. Wandering by stages, he went to where the Blessed One was staying in Jeta's Grove, Anathapindika's monastery. On arrival, having bowed down to the Blessed One, he sat to one side. As he was sitting there, the Blessed One instructed, urged, roused, & encouraged him with a Dhamma talk. Then Ven. Punna — instructed, urged, roused, & encouraged with the Blessed One's Dhamma talk; delighting & approving of the Blessed One's words — got up from his seat, bowed down to the Blessed One, circumambulated him, and went to the Grove of the Blind for the day's abiding.", "entities": [[153, 165, "LOC"], [181, 182, "LOC"], [299, 311, "LOC"], [327, 328, "LOC"], [503, 515, "LOC"], [531, 532, "LOC"], [798, 799, "LOC"], [855, 856, "LOC"], [955, 960, "LOC"], [986, 987, "LOC"]], "meta": {"term": "Jeta's Grove", "nikaya": "MN", "identifier": "mn.024.than.html", "title": "Ratha-vinita Sutta", "para_seq": 5, "hits": 16, "first_offset": 153}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery . Then a certain devata, in the far extreme of the night, her extreme radiance lighting up the entirety of Jeta's Grove, went to the Blessed One and, on arrival, having bowed down to him, stood to one side. As she was standing there, she recited these verses in the Blessed One's presence:", "entities": [[79, 91, "LOC"], [93, 106, "LOC"], [226, 238, "LOC"], [393, 396, "LOC"]], "meta": {"term": "Jeta's Grove", "nikaya": "SN", "identifier": "sn01.041.than.html", "title": "Aditta Sutta", "para_seq": 1, "hits": 8, "first_offset": 77}}
{"text": "On one occasion the Blessed One was staying near Savatthi , in Jeta's Grove, Anathapindika 's monastery. Then Rohitassa , the son of a deva, in the far extreme of the night, his extreme radiance lighting up the entirety of Jeta's Grove, went to the Blessed One. On arrival, having bowed down to the Blessed One, he stood to one side. As he was standing there he said to the Blessed One: \"Is it possible, lord, by traveling, to know or see or reach a far end of the cosmos where one does not take birth, age, die, pass away or reappear?\"", "entities": [[49, 57, "LOC"], [60, 69, "LOC"], [77, 90, "LOC"], [211, 219, "LOC"], [220, 229, "LOC"]], "meta": {"term": "Jeta's Grove", "nikaya": "AN", "identifier": "an04.045.than.html", "title": "Rohitassa Sutta", "para_seq": 1, "hits": 7, "first_offset": 56}}
{"text": "On one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery. And on that occasion the lay woman Velukandaki, Nanda's mother, had established a donation endowed with six factors for the community of monks headed by Sariputta & Moggallana. The Blessed One saw with his divine eye, surpassing the human, that the laywoman Velukandaki, Nanda's mother, had established a donation endowed with six factors for the community of monks headed by Sariputta & Moggallana. On seeing this, he addressed the monks: \"Monks, the lay woman Velukandaki, Nanda's mother, has established a donation endowed with six factors for the community of monks headed by Sariputta & Moggallana.", "entities": [[49, 57, "LOC"], [58, 67, "LOC"], [75, 88, "LOC"]], "meta": {"term": "Jeta's Grove", "nikaya": "AN", "identifier": "an06.037.than.html", "title": "Dana Sutta", "para_seq": 1, "hits": 7, "first_offset": 54}}
{"text": "I have heard that on one occasion the Blessed One was staying in Sāvatthī , at Jeta's Grove, Anāthapiṇḍika's park. Now on that occasion this pernicious viewpoint (diṭṭhigata) had arisen in the monk Sāti the Fisherman's Son: \"As I understand the Dhamma taught by the Blessed One, it is just this consciousness that runs and wanders on [from birth to birth], not another.\" A large number of monks heard, \"They say that this pernicious viewpoint has arisen in the monk Sāti the Fisherman's Son: 'As I understand the Dhamma taught by the Blessed One, it is just this consciousness that runs and wanders on [from birth to birth], not another.'\" So they went to the monk Sāti the Fisherman's Son and on arrival said to him, \"Is it true, friend Sāti, that this pernicious viewpoint has arisen in you — 'As I understand the Dhamma taught by the Blessed One, it is just this consciousness that runs and wanders on, not another'?\"", "entities": [[79, 91, "LOC"], [93, 106, "LOC"], [207, 216, "LOC"], [475, 484, "LOC"], [674, 683, "LOC"]], "meta": {"term": "Jeta's Grove", "nikaya": "MN", "identifier": "mn.038.than.html", "title": "Mahatanhasankhaya Sutta", "para_seq": 1, "hits": 7, "first_offset": 77}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika 's monastery. Then a certain devata, in the far extreme of the night, her extreme radiance lighting up the entirety of Jeta's Grove, went to the Blessed One. On arrival, having bowed down to him, she stood to one side. As she was standing there, she said to him, \"Tell me, dear sir, how you crossed over the flood.\"", "entities": [[79, 91, "LOC"], [226, 238, "LOC"]], "meta": {"term": "Jeta's Grove", "nikaya": "SN", "identifier": "sn01.001.than.html", "title": "Ogha-tarana Sutta", "para_seq": 1, "hits": 7, "first_offset": 77}}
{"text": "On one occasion the Blessed One was staying near Savatthi , in Jeta's Grove, Anathapindika 's monastery. Then Rohitassa , the son of a deva, in the far extreme of the night, his extreme radiance lighting up the entirety of Jeta's Grove, went to the Blessed One. On arrival, having bowed down to the Blessed One, he stood to one side. As he was standing there he said to the Blessed One: \"Is it possible, lord, by traveling, to know or see or reach a far end of the cosmos where one does not take birth, age, die, pass away or reappear?\"", "entities": [[49, 57, "LOC"], [60, 69, "LOC"], [77, 90, "LOC"], [211, 219, "LOC"], [220, 229, "LOC"]], "meta": {"term": "Jeta's Grove", "nikaya": "SN", "identifier": "sn02.026.than.html", "title": "Rohitassa Sutta", "para_seq": 1, "hits": 7, "first_offset": 56}}
{"text": "On one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery. And at that time Ven. Khema and Ven. Sumana were staying near Savatthi in the Blind Man's Grove. Then Ven. Khema and Ven. Sumana went to the Blessed One and on arrival, have bowed down to him, sat to one side. As he was sitting there, Ven. Khema said to the Blessed One, \"When a monk is an arahant, with his fermentations ended — one who has reached fulfillment, done the task, laid down the burden, attained the true goal, totally destroyed the fetter of becoming, and is released through right gnosis — the thought doesn't occur to him that 'There is someone better than me,' or 'There is someone equal to me,' or 'There is someone worse than me.'\" That is what Ven. Khema said, and the Teacher approved. Sensing that \"The Teacher approves of me,\" Ven. Khema got up from his seat, bowed down to the Blessed One, circled him — keeping him on his right — and left.", "entities": [[49, 57, "LOC"], [58, 67, "LOC"], [75, 88, "LOC"], [180, 185, "LOC"], [186, 191, "LOC"]], "meta": {"term": "Jeta's Grove", "nikaya": "AN", "identifier": "an06.049.than.html", "title": "Khema Sutta", "para_seq": 1, "hits": 6, "first_offset": 54}}
{"text": "I have heard that on one occasion the Blessed One was staying at Savatthi , in Jeta's Grove, Anathapindika's monastery . Then early in the morning, having put on his robes and carrying his bowl & outer robe, he went into Savatthi for alms. Then a large number of monks went to Ven. Ananda and said, \"It has been a long time, friend Ananda, since we have heard a Dhamma talk in the Blessed One's presence. It would be good if we could get to hear a Dhamma talk in the Blessed One's presence.\"", "entities": [[79, 91, "LOC"], [93, 106, "LOC"], [389, 392, "LOC"], [475, 478, "LOC"]], "meta": {"term": "Jeta's Grove", "nikaya": "MN", "identifier": "mn.026.than.html", "title": "Ariyapariyesana Sutta", "para_seq": 1, "hits": 6, "first_offset": 77}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi, in Jeta's Grove, Anathapindika's monastery. And on that occasion Anathapindika the householder was diseased, in pain, severely ill. Then Anathapindika the householder said to one of his men, \"Come, my good man. Go to the Blessed One and, on arrival, pay homage to his feet with your head in my name and say 'Lord, Anathapindika the householder is diseased, in pain, severely ill. He pays homage with his head to the Blessed One's feet.' Then go to Ven. Sariputta and, on arrival, pay homage to his feet with your head in my name and say 'Venerable sir, Anathapindika the householder is diseased, in pain, severely ill. He pays homage with his head to your feet.' Then say: 'It would be good if Ven. Sariputta would visit Anathapindika's home, out of sympathy for him.'\"", "entities": [[80, 92, "LOC"], [94, 107, "LOC"], [501, 504, "LOC"], [798, 811, "LOC"]], "meta": {"term": "Jeta's Grove", "nikaya": "MN", "identifier": "mn.143.than.html", "title": "Anathapindikovada Sutta", "para_seq": 1, "hits": 6, "first_offset": 78}}
{"text": "\"Last night, monks, a certain devata in the far extreme of the night, her extreme radiance lighting up the entirety of Jeta's Grove, came to me and, on arrival, bowed down to me and stood to one side. As she was standing there, she said to me, 'These seven qualities, lord, lead to a monk's non-decline. Which seven? Respect for the teacher, respect for the Dhamma, respect for the Sangha, respect for training, respect for concentration, respect for shame, respect for compunction. These seven qualities, lord, lead to a monk's non-decline.'", "entities": [[119, 123, "LOC"], [124, 125, "LOC"], [126, 131, "LOC"], [289, 290, "LOC"], [527, 528, "LOC"]], "meta": {"term": "Jeta's Grove", "nikaya": "AN", "identifier": "an07.032.than.html", "title": "Hirima Sutta", "para_seq": 1, "hits": 5, "first_offset": 118}}
{"text": "\"Last night, monks, a certain devata in the far extreme of the night, her extreme radiance lighting up the entirety of Jeta's Grove, came to me and, on arrival, bowed down to me and stood to one side. As she was standing there, she said to me, 'These seven qualities, lord, lead to a monk's non-decline. Which seven? Respect for the teacher, respect for the Dhamma, respect for the Sangha, respect for training, respect for concentration, compliance, [1] having admirable friends. These seven qualities, lord, lead to a monk's non-decline.'", "entities": [[119, 123, "LOC"], [124, 125, "LOC"], [126, 131, "LOC"], [289, 290, "LOC"], [525, 526, "LOC"]], "meta": {"term": "Jeta's Grove", "nikaya": "AN", "identifier": "an07.033.than.html", "title": "Sovacassata Sutta", "para_seq": 1, "hits": 5, "first_offset": 118}}
{"text": "I have heard that on one occasion the Blessed One was staying among the Udaññans , in the Deer Park at Kannakatthala. And at that time King Pasenadi Kosala had arrived at Udañña on some business or other. So King Pasenadi Kosala said to one of his men, \"Come, my good man. Go to the Blessed One and, on arrival, showing reverence with your head to his feet in my name, ask whether he is free from illness & affliction, is carefree, strong, & living in comfort, saying: 'King Pasenadi Kosala, lord, shows reverence with his head to your feet and asks whether you are free from illness & affliction, are carefree, strong, & living in comfort.' And then say: 'Lord, today King Pasenadi Kosala will come to see the Blessed One after his morning meal.'\"", "entities": [[140, 155, "GPE"], [213, 228, "GPE"], [475, 490, "GPE"], [674, 689, "GPE"]], "meta": {"term": "Kosala", "nikaya": "MN", "identifier": "mn.090.than.html", "title": "Kannakatthala Sutta", "para_seq": 1, "hits": 4, "first_offset": 147}}
{"text": "\"Now, suppose someone were to say, 'King Pasenadi Kosala reigns over Kasi & Kosala. He alone should consume the fruits & revenues of Kasi & Kosala, and not share them with others.' Would someone speaking in this way be a creator of obstacles for King Pasenadi's subjects — you & others — or would he not?\"", "entities": [[41, 49, "GPE"], [69, 75, "GPE"], [133, 139, "GPE"]], "meta": {"term": "Kosala", "nikaya": "DN", "identifier": "dn.12.0.than.html", "title": "Lohicca Sutta", "para_seq": 25, "hits": 3, "first_offset": 44}}
{"text": "\"And if anyone were to say, 'King Pasenadi Kosala reigns over Kasi & Kosala. He alone should consume the fruits & revenues of Kasi & Kosala, and not share them with others,' he, speaking in this way, would be a creator of obstacles for King Pasenadi's subjects — you & others. Being a creator of obstacles, he would not be sympathetic for their welfare. In one not sympathetic for their welfare, the mind would be established in animosity for them. When the mind is established in animosity, there is wrong view. For one of wrong view, I tell you, there is one of two destinations: either hell or the animal womb. In the same way, if anyone were to say, 'Suppose that a brahman or contemplative were to arrive at a skillful doctrine. Having arrived at a skillful doctrine, he should not declare it to anyone else, for what can one person do for another? It would be just the same as if, having cut through an old bond, one were to make another new bond. I say that such a thing is an evil, greedy deed, for what can one person do for another?' — he, speaking in this way, would be a creator of obstacles for those children of good family who, coming to the doctrine & discipline revealed by the Tathagata, attain the sort of grand distinction where they attain the fruit of stream-entry, the fruit of once-returning, the fruit of non-returning, the fruit of arahantship; and also for those who ripen deva wombs for the sake of bringing about the deva state. Being a creator of obstacles, he would not be sympathetic for their welfare. In one not sympathetic for their welfare, the mind would be established in animosity for them. When the mind is established in animosity, there is wrong view. For one of wrong view, I tell you, there is one of two destinations: either hell or the animal womb.", "entities": [[34, 42, "GPE"], [62, 66, "GPE"], [126, 130, "GPE"]], "meta": {"term": "Kosala", "nikaya": "DN", "identifier": "dn.12.0.than.html", "title": "Lohicca Sutta", "para_seq": 35, "hits": 3, "first_offset": 35}}
{"text": ". I heard thus. Once the Blessed One, while wandering in the Kosala country with a large community of bhikkhus, entered a town of the Kalama people called Kesaputta . The Kalamas who were inhabitants of Kesaputta: \"Reverend Gotama, the monk, the son of the Sakyans, has, while wandering in the Kosala country, entered Kesaputta. The good repute of the Reverend Gotama has been spread in this way: Indeed, the Blessed One is thus consummate, fully enlightened, endowed with knowledge and practice, sublime, knower of the worlds, peerless, guide of tamable men, teacher of divine and human beings, which he by himself has through direct knowledge understood clearly. He set forth the Dhamma, good in the beginning, good in the middle, good in the end, possessed of meaning and the letter, and complete in everything; and he proclaims the holy life that is perfectly pure. Seeing such consummate ones is good indeed.\"", "entities": [[57, 67, "GPE"], [290, 300, "GPE"]], "meta": {"term": "Kosala", "nikaya": "AN", "identifier": "an03.065.soma.html", "title": "Kalama Sutta", "para_seq": 1, "hits": 2, "first_offset": 57}}
{"text": "\"What do you think, Lohicca. Doesn't King Pasenadi Kosala reign over Kasi & Kosala?\"", "entities": [[51, 57, "GPE"], [76, 82, "GPE"]], "meta": {"term": "Kosala", "nikaya": "DN", "identifier": "dn.12.0.than.html", "title": "Lohicca Sutta", "para_seq": 23, "hits": 2, "first_offset": 50}}
{"text": "\"So, my friend, I will give you an analogy, for there are cases where it's through analogies that knowledgeable people can understand the meaning of what is being said. Suppose that while King Pasenadi Kosala was staying at Savatthi, some urgent business were to arise at Saketa ; and that between Savatthi and Saketa seven relay chariots were made ready for him. Coming out the door of the inner palace in Savatthi, he would get in the first relay chariot. By means of the first relay chariot he would reach the second relay chariot. Getting out of the first relay chariot he would get in the second relay chariot. By means of the second relay chariot he would reach the third... by means of the third he would reach the fourth... by means of the fourth, the fifth... by means of the fifth, the sixth... by means of the sixth he would reach the seventh relay chariot. Getting out of the sixth relay chariot he would get in the seventh relay chariot. By means of the seventh relay chariot he would finally arrive at the door of the inner palace at Saketa. As he arrived there, his friends & companions, relatives & kin would ask him, 'Great king, did you come from Savatthi to the door of the inner palace in Saketa by means of this chariot?' Answering in what way, my friend, would King Pasenadi Kosala answer them correctly?\"", "entities": [[193, 201, "GPE"], [1288, 1296, "GPE"]], "meta": {"term": "Kosala", "nikaya": "MN", "identifier": "mn.024.than.html", "title": "Ratha-vinita Sutta", "para_seq": 33, "hits": 2, "first_offset": 194}}
{"text": "Now at that time Ven. Angulimala was sitting not far from the Blessed One. So the Blessed One, pointing with his right arm, said to King Pasenadi Kosala, \"That, great king, is Angulimala.\" Then King Pasenadi Kosala was frightened, terrified, his hair standing on end. So the Blessed One, sensing the king's fear & hair-raising awe, said to him, \"Don't be afraid, great king. Don't be afraid. He poses no danger to you.\"", "entities": [[137, 145, "GPE"], [199, 207, "GPE"]], "meta": {"term": "Kosala", "nikaya": "MN", "identifier": "mn.086.than.html", "title": "Angulimala Sutta", "para_seq": 17, "hits": 2, "first_offset": 139}}
{"text": "Having responded, \"As you say, sire,\" the man went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there, he said to him, \"King Pasenadi Kosala, lord, shows reverence with his head to your feet and asks whether you are free from illness & affliction, are carefree, strong, & living in comfort.\" And then he said, \"Lord, today King Pasenadi Kosala will come to see the Blessed One after his morning meal.\"", "entities": [[186, 192, "GPE"], [389, 395, "GPE"]], "meta": {"term": "Kosala", "nikaya": "MN", "identifier": "mn.090.than.html", "title": "Kannakatthala Sutta", "para_seq": 2, "hits": 2, "first_offset": 186}}
{"text": "Then the thought occurred to Ven. Ananda , \"This General Vidudabha is the son of King Pasenadi Kosala, and I am the son of the Blessed One. Now is the time for the son to counsel the son.\" So Ven. Ananda turned to General Vidudabha and said, \"In that case, general, I will ask you a counter question. Answer as you see fit. Through the extent of land conquered by King Pasenadi Kosala — where he exercises sovereign & independent kingship — is he able to oust or expel a brahman or contemplative from that place, regardless of whether that person has merit or not, or follows the holy life or not?\"", "entities": [[95, 101, "GPE"], [378, 384, "GPE"]], "meta": {"term": "Kosala", "nikaya": "MN", "identifier": "mn.090.than.html", "title": "Kannakatthala Sutta", "para_seq": 43, "hits": 2, "first_offset": 95}}
{"text": "At one time the Lord was staying near Savatthi at Jeta Grove, Anathapindika's Monastery. Then King Pasenadi of Kosala approached the Lord and having done so, paid his respects and sat down nearby. Now at that time Queen Mallika died. A certain man then approached the King and whispered in his ear: \"Your Majesty, Queen Mallika has died.\" At those words king Pasenadi was filled with grief and depression, and with shoulders drooping, head down, he sat glum, and with nothing to say. The Lord saw the king sitting there like that and spoke to him in this way:", "entities": [[99, 110, "GPE"]], "meta": {"term": "Kosala", "nikaya": "AN", "identifier": "an05.049.hekh.html", "title": "Kosala Sutta", "para_seq": 1, "hits": 1, "first_offset": 104}}
{"text": "Thus have I heard. Once the Blessed One was wandering among the Kosala people together with a large company of monks. Entering a major path, the Blessed One saw in a certain spot a great mass of fire, burning, blazing, glowing. After seeing it and stepping down from the path he sat on the appointed seat at the root of a tree. After sitting down the Blessed One said to the monks: \"Do you see, monks, that great mass of fire, burning, blazing, glowing?\" — \" Yes, venerable Sir.\"", "entities": [[64, 70, "GPE"]], "meta": {"term": "Kosala", "nikaya": "AN", "identifier": "an07.068.yaho.html", "title": "Aggikkhandopama Sutta", "para_seq": 1, "hits": 1, "first_offset": 64}}
{"text": "\"Just as though, Visakha, one might have power, dominion and kingship [11] over sixteen great countries abounding in the seven treasures [12] — that is to say, Anga, Magadha, Kasi, Kosala, Vajji, Malla, Ceti, Vansa, Kure, Pancala, Maccha, Surasena, Assaka, Avanti, Gandhara and Kamboja, yet it is not worth a sixteenth part of the Uposatha undertaken with its eight practices. For what reason? Miserable is kingship over men compared with heavenly bliss.", "entities": [[181, 187, "GPE"]], "meta": {"term": "Kosala", "nikaya": "AN", "identifier": "an08.043.khan.html", "title": "Visakhuposatha Sutta", "para_seq": 21, "hits": 1, "first_offset": 180}}
{"text": "I have heard that on one occasion the Blessed One was staying near Kosambi , at Ghosita 's monastery. Then in the early morning, having put on his robes and carrying his bowl and outer robe, he went into Kosambi for alms. Having gone for alms in Kosambi, after the meal, returning from his alms round, he set his own lodging in order and — without calling his attendant or informing the community of monks — set out wandering, alone & without a companion.", "entities": [[62, 74, "GPE"], [199, 211, "GPE"], [243, 253, "GPE"]], "meta": {"term": "Kosambi", "nikaya": "SN", "identifier": "sn22.081.than.html", "title": "Parileyyaka Sutta", "para_seq": 1, "hits": 3, "first_offset": 65}}
{"text": "I have heard that on one occasion Ven. Ananda was staying in Kosambi at Ghosita 's monastery. Then a certain householder, a disciple of the Fatalists (Ajivakas), went to him and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to Ven. Ananda, \"Among us, sir, whose Dhamma is well-taught? Who has practiced well in this world? Who in the world is well-gone?\"", "entities": [[58, 68, "GPE"]], "meta": {"term": "Kosambi", "nikaya": "AN", "identifier": "an03.072.than.html", "title": "Ajivaka Sutta", "para_seq": 1, "hits": 1, "first_offset": 59}}
{"text": "I have heard that on one occasion Ven. Ananda was staying in Kosambi , at Ghosita 's Park. Then a certain nun said to a certain man, \"Go, my good man, to my lord Ananda and, on arrival, bowing your head to his feet in my name, tell him, 'The nun named such-and-such, venerable sir, is sick, in pain, severely ill. She bows her head to the feet of her lord Ananda and says, \"It would be good if my lord Ananda were to go to the nuns' quarters, to visit this nun out of sympathy for her.\"'\"", "entities": [[58, 68, "GPE"]], "meta": {"term": "Kosambi", "nikaya": "AN", "identifier": "an04.159.than.html", "title": "Bhikkhuni Sutta", "para_seq": 1, "hits": 1, "first_offset": 59}}
{"text": "On one occasion Ven. Ananda was staying in Kosambi , at Ghosita's monastery . There he addressed the monks, \"Friends!\"", "entities": [[32, 42, "GPE"]], "meta": {"term": "Kosambi", "nikaya": "AN", "identifier": "an04.170.than.html", "title": "Yuganaddha Sutta", "para_seq": 1, "hits": 1, "first_offset": 36}}
{"text": "I have heard that on one occasion the Blessed One was staying at Kosambi , in Ghosita's Park. Now at that time Ven. Udayin was sitting surrounded by a large assembly of householders, teaching the Dhamma. Ven. Ananda saw Ven. Udayin sitting surrounded by a large assembly of householders, teaching the Dhamma, and on seeing him went to the Blessed One. On arrival, he bowed down to the Blessed One and sat to one side. As he was sitting there he said to the Blessed One: \"Ven. Udayin, lord, is sitting surrounded by a large assembly of householders, teaching the Dhamma.\"", "entities": [[62, 72, "GPE"]], "meta": {"term": "Kosambi", "nikaya": "AN", "identifier": "an05.159.than.html", "title": "Udayi Sutta", "para_seq": 1, "hits": 1, "first_offset": 63}}
{"text": "On one occasion Ven. Ananda was staying in Kosambi at Ghosita's monastery . There he addressed the monks, \"Friend monks!\"", "entities": [[32, 42, "GPE"]], "meta": {"term": "Kosambi", "nikaya": "AN", "identifier": "an09.037.than.html", "title": "Ananda Sutta", "para_seq": 1, "hits": 1, "first_offset": 36}}
{"text": "On one occasion Ven. Ananda was staying in Kosambi at Ghosita's Park. Then Ven. Udayin went to him and, on arrival, exchanged courteous greetings. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to Ven. Ananda, \"This has been said by Pañcalacanda the deva's son:", "entities": [[32, 42, "GPE"]], "meta": {"term": "Kosambi", "nikaya": "AN", "identifier": "an09.042.than.html", "title": "Pañcala Sutta", "para_seq": 1, "hits": 1, "first_offset": 36}}
{"text": "41. When this had been said, the Venerable Ananda spoke to the Blessed One, saying: \"Let it not be, Lord, that the Blessed One should pass away in this mean place, this uncivilized township in the midst of the jungle, a mere outpost of the province. There are great cities, Lord, such as Campa , Rajagaha, Savatthi , Saketa , Kosambi , and Benares — let the Blessed One have his final passing away in one of those. For in those cities dwell many wealthy nobles and brahmans and householders who are devotees of the Tathagata, and they will render due honor to the remains of the Tathagata.\"", "entities": [[317, 333, "GPE"]], "meta": {"term": "Kosambi", "nikaya": "DN", "identifier": "dn.16.1-6.vaji.html", "title": "Maha-parinibbana Sutta", "para_seq": 344, "hits": 1, "first_offset": 322}}
{"text": "When this was said, Ven. Ananda said to the Blessed One, \"Lord, may the Blessed One not be totally unbound in this little town, this dusty town, this branch township. There are other great cities: Campa , Rajagaha , Savatthi , Saketa , Kosambi , Vanarasi . May the Blessed One be totally unbound there. In those cities there are many wealthy noble warriors, brahmans, & householders who have high confidence in the Tathagata. They will conduct the Tathagata's funeral.\"", "entities": [[236, 243, "GPE"]], "meta": {"term": "Kosambi", "nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": 42, "hits": 1, "first_offset": 236}}
{"text": "On one occasion Ven. Musila , Ven. Pavittha , Ven. Narada , and Ven. Ananda were staying in Kosambi at Ghosita's monastery .", "entities": [[81, 91, "GPE"]], "meta": {"term": "Kosambi", "nikaya": "SN", "identifier": "sn12.068.than.html", "title": "Kosambi Sutta", "para_seq": 1, "hits": 1, "first_offset": 85}}
{"text": "On one occasion many elder monks were staying at Kosambi in Ghosita's Park. And at that time Ven. Khemaka was staying at the Jujube Tree Park, diseased, in pain, severely ill. Then in the late afternoon the elder monks left their seclusion and addressed Ven. Dasaka , [saying,] \"Come, friend Dasaka. Go to the monk Khemaka and on arrival say to him, 'The elders, friend Khemaka, say to you, \"We hope you are getting better, friend. We hope you are comfortable. We hope that your pains are lessening and not increasing. We hope that there are signs of their lessening, and not of their increasing.\"'\"", "entities": [[38, 48, "GPE"]], "meta": {"term": "Kosambi", "nikaya": "SN", "identifier": "sn22.089.than.html", "title": "Khemaka Sutta", "para_seq": 1, "hits": 1, "first_offset": 42}}
{"text": "Then the thought occurred to Ven. Channa, \"This Ven. Ananda is staying at Kosambi in Ghosita's Park. He has been praised by the Teacher and is esteemed by his knowledgeable fellows in the holy life. He is capable of teaching me the Dhamma so that I might see the Dhamma, and I have sudden trust in him. Why don't I go to Ven. Ananda?\"", "entities": [[74, 81, "GPE"]], "meta": {"term": "Kosambi", "nikaya": "SN", "identifier": "sn22.090.than.html", "title": "Channa Sutta", "para_seq": 4, "hits": 1, "first_offset": 74}}
{"text": "Once [1] the Blessed One was living among the Bhaggas in the Deer Park at Bhesakala Grove, near Crocodile Haunt . At that time Ven. Maha Moggallana [2] sat nodding near the village of Kallavalaputta , in Magadha . The Blessed One, with his purified divine eye, surpassing the human, saw Ven. Maha Moggallana as he sat nodding near the village of Kallavalaputta, in Magadha. As soon as he saw this — just as a strong man might extend his flexed arm or flex his extended arm — he disappeared from among the Bhaggas in the Deer Park at Bhesakala Grove, near Crocodile Haunt, and re-appeared near the village of Kallavalaputta, in Magadha, right in front of Ven. Maha Moggallana. There he sat down on a prepared seat. As he was sitting there, the Blessed One said to Ven. Maha Moggallana, \"Are you nodding, Moggallana? Are you nodding?\"", "entities": [[204, 211, "GPE"], [365, 372, "GPE"], [627, 634, "GPE"]], "meta": {"term": "Magadha", "nikaya": "AN", "identifier": "an07.058.than.html", "title": "Capala (Pacala) Sutta", "para_seq": 1, "hits": 3, "first_offset": 204}}
{"text": "\"Happy One, there are non-humans who are fierce, violent, given to retaliation; those non-humans heed neither the (four) great kings, nor their ministers nor their attendants. They are called rebels against the (four) great kings. Even as in the kingdom of Magadha, the thieves heed neither the king of Magadha, nor the ministers, nor their attendants, and are called rebels against the king of Magadha, so there are non-humans who are fierce... (as before). They are called rebels against the (four) great kings.", "entities": [[257, 264, "GPE"], [303, 310, "GPE"], [395, 402, "GPE"]], "meta": {"term": "Magadha", "nikaya": "DN", "identifier": "dn.32.0.piya.html", "title": "Atanatiya Sutta", "para_seq": 49, "hits": 3, "first_offset": 256}}
{"text": "2. And Ajatasattu, the king of Magadha, addressed his chief minister, the brahman Vassakara , saying: \"Come, brahman, go to the Blessed One, pay homage in my name at his feet, wish him good health, strength, ease, vigour, and comfort, and speak thus: 'O Lord, Ajatasattu, the king of Magadha, desires to wage war against the Vajjis. He has spoken in this fashion: \"These Vajjis, powerful and glorious as they are, I shall annihilate them, I shall make them perish, I shall utterly destroy them.\"' And whatever the Blessed One should answer you, keep it well in mind and inform me; for Tathagatas [3] do not speak falsely.\"", "entities": [[23, 30, "GPE"], [276, 283, "GPE"]], "meta": {"term": "Magadha", "nikaya": "DN", "identifier": "dn.16.1-6.vaji.html", "title": "Maha-parinibbana Sutta", "para_seq": 2, "hits": 2, "first_offset": 24}}
{"text": "3. \"Very well, sire,\" said the brahman Vassakara in assent to Ajatasattu, king of Magadha. And he ordered a large number of magnificent carriages to be made ready, mounted one himself, and accompanied by the rest, drove out to Rajagaha towards Vultures' Peak. He went by carriage as far as the carriage could go, then dismounting, he approached the Blessed One on foot. After exchanging courteous greetings with the Blessed One, together with many pleasant words, he sat down at one side and addressed the Blessed One thus: \"Venerable Gotama, Ajatasattu, the king of Magadha, pays homage at the feet of the Venerable Gotama and wishes him good health, strength, ease, vigour, and comfort. He desires to wage war against the Vajjis, and he has spoken in this fashion: 'These Vajjis, powerful and glorious as they are, I shall annihilate them, I shall make them perish, I shall utterly destroy them.'\"", "entities": [[79, 89, "GPE"], [564, 574, "GPE"]], "meta": {"term": "Magadha", "nikaya": "DN", "identifier": "dn.16.1-6.vaji.html", "title": "Maha-parinibbana Sutta", "para_seq": 3, "hits": 2, "first_offset": 78}}
{"text": "Staying at Savatthi. Then King Ajatasattu of Magadha, the son of Queen Videha, raising a fourfold army, marched toward Kasi against King Pasenadi Kosala . King Pasenadi heard, \"King Ajatasattu of Magadha, the son of Queen Videha, they say, has raised a fourfold army and is marching toward Kasi against me.\" So King Pasenadi, raising a fourfold army, launched a counter-attack toward Kasi against King Ajatasattu. Then King Ajatasattu & King Pasenadi fought a battle, and in that battle King Ajatasattu defeated King Pasenadi. King Pasenadi, defeated, marched back to his capital at Savatthi.", "entities": [[45, 52, "GPE"], [196, 203, "GPE"]], "meta": {"term": "Magadha", "nikaya": "SN", "identifier": "sn03.014.than.html", "title": "Sangama Sutta", "para_seq": 1, "hits": 2, "first_offset": 45}}
{"text": "Then in the early morning, a large number of monks, having put on their robes and carrying their bowls & outer robes, went into Savatthi for alms. Having gone for alms in Savatthi, after the meal, returning from their alms round, they went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As they were sitting there, they said to the Blessed One: \"Just now, lord, King Ajatasattu of Magadha, the son of Queen Videha, raising a fourfold army, marched toward Kasi against King Pasenadi Kosala. King Pasenadi heard, 'King Ajatasattu of Magadha, the son of Queen Videha, they say, has raised a fourfold army and is marching toward Kasi against me.' So King Pasenadi, raising a fourfold army, launched a counter-attack toward Kasi against King Ajatasattu. Then King Ajatasattu & King Pasenadi fought a battle, and in that battle King Ajatasattu defeated King Pasenadi. King Pasenadi, defeated, marched back to his capital at Savatthi.\"", "entities": [[413, 420, "GPE"], [563, 570, "GPE"]], "meta": {"term": "Magadha", "nikaya": "SN", "identifier": "sn03.014.than.html", "title": "Sangama Sutta", "para_seq": 2, "hits": 2, "first_offset": 413}}
{"text": "Staying at Savatthi. Then King Ajatasattu of Magadha, the son of Queen Videha, raising a fourfold army, marched toward Kasi against King Pasenadi Kosala . King Pasenadi heard, \"King Ajatasattu of Magadha, the son of Queen Videha, they say, has raised a fourfold army and is marching toward Kasi against me.\" So King Pasenadi, raising a fourfold army, launched a counter-attack toward Kasi against King Ajatasattu. Then King Ajatasattu & King Pasenadi fought a battle, and in that battle King Pasenadi defeated King Ajatasattu and captured him alive.", "entities": [[45, 52, "GPE"], [196, 203, "GPE"]], "meta": {"term": "Magadha", "nikaya": "SN", "identifier": "sn03.015.than.html", "title": "Sangama Sutta", "para_seq": 1, "hits": 2, "first_offset": 45}}
{"text": "On one occasion the Blessed One was staying near Rajagaha at the Bamboo Grove in the Squirrels' Sanctuary. Then Vassakara the brahman, the chief minister of Magadha, went to the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to the Blessed One, \"Master Gotama, we declare a person endowed with four qualities to be one of great discernment, a great man. Which four?", "entities": [[145, 156, "GPE"]], "meta": {"term": "Magadha", "nikaya": "AN", "identifier": "an04.035.than.html", "title": "Vassakara Sutta", "para_seq": 1, "hits": 1, "first_offset": 150}}
{"text": "I have heard that on one occasion the Blessed One was staying at Rajagaha in the Bamboo Grove, the Squirrels' Sanctuary. Then Vassakara the brahman, the minister to the king of Magadha , approached the Blessed One and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there he said to the Blessed One: \"I am of the view, of the opinion, that when anyone speaks of what he has seen, [saying,] 'Thus have I seen,' there is no fault in that. When anyone speaks of what he has heard, [saying,] 'Thus have I heard,' there is no fault in that. When anyone speaks of what he has sensed, [saying,] 'Thus have I sensed,' there is no fault in that. When anyone speaks of what he has cognized, [saying,] 'Thus have I cognized,' there is no fault in that.\"", "entities": [[174, 184, "GPE"]], "meta": {"term": "Magadha", "nikaya": "AN", "identifier": "an04.183.than.html", "title": "Suta Sutta", "para_seq": 1, "hits": 1, "first_offset": 175}}
{"text": "\"Just as though, Visakha, one might have power, dominion and kingship [11] over sixteen great countries abounding in the seven treasures [12] — that is to say, Anga, Magadha, Kasi, Kosala, Vajji, Malla, Ceti, Vansa, Kure, Pancala, Maccha, Surasena, Assaka, Avanti, Gandhara and Kamboja, yet it is not worth a sixteenth part of the Uposatha undertaken with its eight practices. For what reason? Miserable is kingship over men compared with heavenly bliss.", "entities": [[166, 173, "GPE"]], "meta": {"term": "Magadha", "nikaya": "AN", "identifier": "an08.043.khan.html", "title": "Visakhuposatha Sutta", "para_seq": 21, "hits": 1, "first_offset": 165}}
{"text": "At one time, the Venerable Sāriputta was dwelling near the small village of Nālaka in Magadha . And then, there where Venerable Sāriputta was, there Sāmaṇḍakāni , the wanderer, approached. Having approached, he exchanged greetings with the Venerable Sāriputta. Having exchanged greetings, and courteous talk having passed between them, he sat to one side. Having sat to one side, Sāmaṇḍakāni, the wanderer, said this to Venerable Sāriputta:", "entities": [[76, 85, "GPE"]], "meta": {"term": "Magadha", "nikaya": "AN", "identifier": "an10.065.niza.html", "title": "Pathama Sukha Sutta", "para_seq": 1, "hits": 1, "first_offset": 79}}
{"text": "At one time, the Venerable Sāriputta was dwelling near the small village of Nālaka in Magadha . And then, there where Venerable Sāriputta was, there Sāmaṇḍakāni , the wanderer, approached. Having approached, he exchanged greetings with the Venerable Sāriputta. Having exchanged greetings, and courteous talk having passed between them, he sat to one side. Having sat to one side, Sāmaṇḍakāni, the wanderer, said this to Venerable Sāriputta:", "entities": [[76, 85, "GPE"]], "meta": {"term": "Magadha", "nikaya": "AN", "identifier": "an10.066.niza.html", "title": "Dutiya Sukha Sutta", "para_seq": 1, "hits": 1, "first_offset": 79}}
{"text": "\"Monks, follow Sariputta and Moggallana; associate with Sariputta and Moggallana. Wise monks do help (materially and spiritually) those who live the holy life. Monks, Sariputta is like unto a mother, Moggallana is like unto a foster-mother to a child. Sariputta, monks, trains (beings) in the path [2] of stream-attainment. Moggallana in the highest goal (arahantship). [3] Sariputta, monks, is able to proclaim, teach, lay down, establish, open up, analyze, and elucidate the Four Noble Truths.\"", "entities": [[15, 24, "PERSON"], [56, 65, "PERSON"], [167, 176, "PERSON"], [252, 261, "PERSON"], [374, 383, "PERSON"]], "meta": {"term": "Sariputta", "nikaya": "MN", "identifier": "mn.141.piya.html", "title": "Saccavibhanga Sutta", "para_seq": 5, "hits": 5, "first_offset": 14}}
{"text": "\"Monks, associate with Sariputta & Moggallana. Consort with Sariputta & Moggallana. They are wise monks, sympathetic toward their fellows in the holy life. Like the mother giving birth: That's Sariputta. Like the nurse raising a child after it's born: That's Moggallana. Sariputta trains [others] to the fruit of stream-entry; Moggallana, to the highest goal. [1] Sariputta is capable of declaring, teaching, describing, setting forth, revealing, explaining, and making plain the four noble truths in detail.\"", "entities": [[23, 32, "PERSON"], [60, 69, "PERSON"], [193, 202, "PERSON"], [271, 280, "PERSON"], [364, 373, "PERSON"]], "meta": {"term": "Sariputta", "nikaya": "MN", "identifier": "mn.141.than.html", "title": "Saccavibhanga Sutta", "para_seq": 4, "hits": 5, "first_offset": 22}}
{"text": "Then a certain monk went to Ven. Sariputta and, on arrival, said to him: \"Friend Sariputta, the monk named Punna Mantaniputta whom you have so often praised — instructed, urged, roused, & encouraged with the Blessed One's Dhamma talk; delighting & approving of the Blessed One's words — has gotten up from his seat, bowed down to the Blessed One, circumambulated him, and has gone to the Grove of the Blind for the day's abiding.\" So Ven. Sariputta quickly picked up a sitting cloth and followed right behind Ven. Punna, keeping his head in sight. Ven. Punna plunged into the Grove of the Blind and sat down in the shade of a tree for the day's abiding. Ven. Sariputta also plunged into the Grove of the Blind and sat down in the shade of a tree for the day's abiding.", "entities": [[33, 42, "PERSON"], [81, 90, "PERSON"], [439, 448, "PERSON"], [659, 668, "PERSON"]], "meta": {"term": "Sariputta", "nikaya": "MN", "identifier": "mn.024.than.html", "title": "Ratha-vinita Sutta", "para_seq": 6, "hits": 4, "first_offset": 33}}
{"text": "I have heard that on one occasion the Blessed One was staying near Rajagaha in the Bamboo Grove, the Squirrels' Sanctuary. Now, on that occasion Ven. Sariputta was wandering in the Southern Mountains with a large community of monks. Then a certain monk who had spent the Rains in Rajagaha went to the Southern Mountains, to Ven. Sariputta. On arrival, he exchanged courteous greetings with Ven. Sariputta and — after an exchange of friendly greetings & courtesies — sat to one side. As he was sitting there, Ven. Sariputta said to him, \"I trust, friend, that the Blessed One is strong & free from illness?\"", "entities": [[150, 159, "PERSON"], [329, 338, "PERSON"], [395, 404, "PERSON"], [513, 522, "PERSON"]], "meta": {"term": "Sariputta", "nikaya": "MN", "identifier": "mn.097.than.html", "title": "Dhanañjani Sutta", "para_seq": 1, "hits": 4, "first_offset": 148}}
{"text": "Then early in the morning, Ven. Sariputta put on his robes and, carrying his bowl & outer robe, went into Rajagaha for alms. And on that occasion Dhanañjanin the brahman was milking cows in a cow pen outside the city. Then Ven. Sariputta, having gone for alms in Rajagaha, after his meal, on his way back from his almsround, went to Dhanañjanin the brahman. Dhanañjanin the brahman saw Ven. Sariputta coming from afar. On seeing him, he went to him and said, \"Drink some of this fresh milk, master Sariputta. It must be time for your meal.\"", "entities": [[32, 41, "PERSON"], [228, 237, "PERSON"], [391, 400, "PERSON"], [498, 507, "PERSON"]], "meta": {"term": "Sariputta", "nikaya": "MN", "identifier": "mn.097.than.html", "title": "Dhanañjani Sutta", "para_seq": 11, "hits": 4, "first_offset": 32}}
{"text": "\"As you say, master,\" Dhanañjanin responded to Ven. Sariputta. Then after he had finished his morning meal, he went to Ven. Sariputta. On arrival, he exchanged courteous greetings with Ven. Sariputta and — after an exchange of friendly greetings & courtesies — sat to one side. As he was sitting there, Ven. Sariputta said to him, \"I trust, Dhanañjanin, that you are heedful?\"", "entities": [[34, 50, "PERSON"], [111, 122, "PERSON"], [170, 188, "PERSON"], [296, 306, "PERSON"]], "meta": {"term": "Sariputta", "nikaya": "MN", "identifier": "mn.097.than.html", "title": "Dhanañjani Sutta", "para_seq": 13, "hits": 4, "first_offset": 39}}
{"text": "Responding, \"As you say, lord,\" to Dhanañjanin the brahman, the man went to the Blessed One and, on arrival, bowed down to him and sat to one side. As he was sitting there he said, \"Lord, Dhanañjanin the brahman is diseased, in pain, severely ill. He pays homage with his head to the Blessed One's feet.\" Then he went to Ven. Sariputta and, on arrival, bowed down to him and sat to one side. As he was sitting there he said, 'Venerable sir, Dhanañjanin the brahman is diseased, in pain, severely ill. He pays homage with his head to Ven. Sariputta's feet.\" Then he said, \"It would be good if Ven. Sariputta would visit Dhanañjanin's home, out of sympathy for him.\" Ven. Sariputta acquiesced through silence.", "entities": [[326, 335, "PERSON"], [538, 547, "PERSON"], [597, 606, "PERSON"], [670, 679, "PERSON"]], "meta": {"term": "Sariputta", "nikaya": "MN", "identifier": "mn.097.than.html", "title": "Dhanañjani Sutta", "para_seq": 29, "hits": 4, "first_offset": 326}}
{"text": "Responding, \"As you say, lord,\" to Anathapindika the householder, the man went to the Blessed One and, on arrival, bowed down to him and sat to one side. As he was sitting there he said, \"Lord, Anathapindika the householder is diseased, in pain, severely ill. He pays homage with his head to the Blessed One's feet.\" Then he went to Ven. Sariputta and, on arrival, bowed down to him and sat to one side. As he was sitting there he said, 'Venerable sir, Anathapindika the householder is diseased, in pain, severely ill. He pays homage with his head to Ven. Sariputta's feet.\" Then he said, \"It would be good if Ven. Sariputta would visit Anathapindika's home, out of sympathy for him.\" Ven. Sariputta acquiesced through silence.", "entities": [[338, 347, "PERSON"], [556, 565, "PERSON"], [615, 624, "PERSON"], [690, 699, "PERSON"]], "meta": {"term": "Sariputta", "nikaya": "MN", "identifier": "mn.143.than.html", "title": "Anathapindikovada Sutta", "para_seq": 2, "hits": 4, "first_offset": 338}}
{"text": "Staying at Savatthi. Then Ven. Bhumija, arising from his seclusion in the late afternoon, went to Ven. Sariputta . On arrival, he exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he said to Ven. Sariputta, \"Friend Sariputta, there are some brahmans & contemplatives, teachers of kamma, who declare that pleasure & pain are self-made. There are other brahmans & contemplatives, teachers of kamma, who declare that pleasure & pain are other-made. Then there are other brahmans & contemplatives, teachers of kamma, who declare that pleasure & pain are self-made & other-made. And then there are still other brahmans & contemplatives, teachers of kamma, who declare that pleasure & pain are neither self-made nor other-made, but arise spontaneously. In this case, friend Sariputta, what is the Blessed One's doctrine? What does he teach? Answering in what way will I speak in line with what the Blessed One has said, not misrepresent the Blessed One with what is unfactual, and answer in line with the Dhamma so that no one whose thinking is in line with the Dhamma will have grounds for criticism?\"", "entities": [[103, 112, "PERSON"], [285, 294, "PERSON"], [304, 313, "PERSON"], [857, 866, "PERSON"]], "meta": {"term": "Sariputta", "nikaya": "SN", "identifier": "sn12.025.than.html", "title": "Bhumija Sutta", "para_seq": 1, "hits": 4, "first_offset": 103}}
{"text": "On one occasion Ven. Sariputta and Ven. MahaKotthita were staying near Varanasi in the Deer Park at Isipatana . Then in the evening, arising from his seclusion, Ven. MahaKotthita went to Ven. Sariputta and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there he said to Ven. Sariputta: \"Now tell me, Sariputta my friend: Are aging & death self-made or other-made or both self-made & other-made, or — without self-making or other-making — do they arise spontaneously?\"", "entities": [[7, 30, "PERSON"], [184, 201, "PERSON"], [365, 382, "PERSON"], [389, 407, "PERSON"]], "meta": {"term": "Sariputta", "nikaya": "SN", "identifier": "sn12.067.than.html", "title": "Nalakalapiyo Sutta", "para_seq": 1, "hits": 4, "first_offset": 14}}
{"text": "\"It's amazing, friend Sariputta. It's astounding, friend Sariputta, how well that was said by Ven. Sariputta. And I rejoice in Ven. Sariputta's good statements with regard to these 36 topics. [1] If a monk teaches the Dhamma for the sake of disenchantment, dispassion, & cessation with regard to aging & death, he deserves to be called a monk who is a speaker of Dhamma. If he practices for the sake of disenchantment, dispassion, & cessation with regard to aging & death, he deserves to be called a monk who practices the Dhamma in accordance with the Dhamma. [2] If — through disenchantment, dispassion, cessation, and lack of clinging/sustenance with regard to aging & death — he is released, then he deserves to be called a monk who has attained Unbinding in the here-&-now.", "entities": [[15, 31, "PERSON"], [50, 66, "PERSON"], [94, 108, "PERSON"], [127, 141, "PERSON"]], "meta": {"term": "Sariputta", "nikaya": "SN", "identifier": "sn12.067.than.html", "title": "Nalakalapiyo Sutta", "para_seq": 12, "hits": 4, "first_offset": 16}}
{"text": "At that time Ven. Sariputta was sitting under a certain cassia tree not far from the Blessed One. Then the monks, delighting in & approving of the Blessed One's words, rose from their seats and — bowing down to the Blessed One and circumambulating him, keeping him to their right — went to Ven. Sariputta. On arrival, they exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, they sat to one side. As they were sitting there, they said to Ven. Sariputta, \"Friend Sariputta, we want to go to the countryside of the outlying districts and to take up residence there. We have already informed the Teacher.\"", "entities": [[13, 27, "PERSON"], [290, 304, "PERSON"], [480, 494, "PERSON"], [497, 513, "PERSON"]], "meta": {"term": "Sariputta", "nikaya": "SN", "identifier": "sn22.002.than.html", "title": "Devadaha Sutta", "para_seq": 6, "hits": 4, "first_offset": 15}}
{"text": "Then the Blessed One, having stayed at Rajagaha as long as he liked, set out wandering to Savatthi . Wandering by stages, he arrived there and stayed in Jeta's Grove, Anathapindika's monastery . Ven. Punna Mantaniputta heard, \"The Blessed One has arrived at Savatthi and is staying near Savatthi in Jeta's Grove, Anathapindika's monastery.\" Setting his lodgings in order and taking his robes & bowl, he set out wandering to Savatthi. Wandering by stages, he went to where the Blessed One was staying in Jeta's Grove, Anathapindika's monastery. On arrival, having bowed down to the Blessed One, he sat to one side. As he was sitting there, the Blessed One instructed, urged, roused, & encouraged him with a Dhamma talk. Then Ven. Punna — instructed, urged, roused, & encouraged with the Blessed One's Dhamma talk; delighting & approving of the Blessed One's words — got up from his seat, bowed down to the Blessed One, circumambulated him, and went to the Grove of the Blind for the day's abiding.", "entities": [[90, 98, "GPE"], [258, 266, "GPE"], [287, 295, "GPE"], [424, 432, "GPE"]], "meta": {"term": "Savatthi", "nikaya": "MN", "identifier": "mn.024.than.html", "title": "Ratha-vinita Sutta", "para_seq": 5, "hits": 4, "first_offset": 90}}
{"text": "\"So, my friend, I will give you an analogy, for there are cases where it's through analogies that knowledgeable people can understand the meaning of what is being said. Suppose that while King Pasenadi Kosala was staying at Savatthi, some urgent business were to arise at Saketa ; and that between Savatthi and Saketa seven relay chariots were made ready for him. Coming out the door of the inner palace in Savatthi, he would get in the first relay chariot. By means of the first relay chariot he would reach the second relay chariot. Getting out of the first relay chariot he would get in the second relay chariot. By means of the second relay chariot he would reach the third... by means of the third he would reach the fourth... by means of the fourth, the fifth... by means of the fifth, the sixth... by means of the sixth he would reach the seventh relay chariot. Getting out of the sixth relay chariot he would get in the seventh relay chariot. By means of the seventh relay chariot he would finally arrive at the door of the inner palace at Saketa. As he arrived there, his friends & companions, relatives & kin would ask him, 'Great king, did you come from Savatthi to the door of the inner palace in Saketa by means of this chariot?' Answering in what way, my friend, would King Pasenadi Kosala answer them correctly?\"", "entities": [[213, 223, "GPE"], [290, 297, "GPE"], [397, 406, "GPE"], [1155, 1164, "GPE"]], "meta": {"term": "Savatthi", "nikaya": "MN", "identifier": "mn.024.than.html", "title": "Ratha-vinita Sutta", "para_seq": 33, "hits": 4, "first_offset": 216}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monstery. And on that occasion five hundred brahmans from various provinces were staying at Savatthi on some business or other. The thought occurred to them, \"This Gotama the contemplative prescribes purity for the four castes. Now who is capable of disputing with him on this statement?\" And on that occasion the brahman student Assalayana was staying at Savatthi. Young, shaven-headed, sixteen years old, he was a master of the Three Vedas with their vocabularies, liturgy, phonology, etymology, & histories as a fifth; skilled in philology & grammar, he was fully versed in cosmology and in the marks of a Great Man. The thought occurred to the brahmans, \"This brahman student Assalayana is staying in Savatthi... He is capable of disputing with Gotama the contemplative on this statement.\"", "entities": [[62, 75, "GPE"], [198, 209, "GPE"], [462, 473, "GPE"], [811, 822, "GPE"]], "meta": {"term": "Savatthi", "nikaya": "MN", "identifier": "mn.093.than.html", "title": "Assalayana Sutta", "para_seq": 1, "hits": 4, "first_offset": 65}}
{"text": "On one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika 's monastery. Now, at that time in Savatthi a certain monk had died after having been bitten by a snake. Then a large number of monks went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As they were sitting there they said to him, \"Lord, just now in Savatthi a certain monk died after having been bitten by a snake.\"", "entities": [[36, 57, "GPE"], [116, 132, "GPE"], [364, 379, "GPE"]], "meta": {"term": "Savatthi", "nikaya": "AN", "identifier": "an04.067.than.html", "title": "Ahina Sutta", "para_seq": 1, "hits": 3, "first_offset": 42}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery . Now on that occasion Potthapada the wanderer , together with a large following of about 300 wanderers, had taken up residence in the debating hall near the Tinduka tree in the single-pavilion park of Queen Mallika . Then the Blessed One, early in the morning, taking his robes & bowl, entered Savatthi for alms. Then the thought occurred to him, \"While it's still too early to go into Savatthi for alms, why don't I go to the debating hall near the Tinduka tree in the single-pavilion park of Queen Mallika to see Potthapada the wanderer?\" So he went to the debating hall near the Tinduka tree in the single-pavilion park of Queen Mallika.", "entities": [[62, 75, "GPE"], [406, 422, "GPE"], [501, 514, "GPE"]], "meta": {"term": "Savatthi", "nikaya": "DN", "identifier": "dn.09.0.than.html", "title": "Potthapada Sutta", "para_seq": 1, "hits": 3, "first_offset": 65}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi at Jeta's Grove, Anathapindika's monastery. Then, early in the morning, several monks put on their robes and, carrying their bowls and outer robes, went into Savatthi for alms. The thought occurred to them, \"It's still too early to go into Savatthi for alms. What if we were to visit the park of the wanderers of other persuasions?\"", "entities": [[62, 75, "GPE"], [229, 242, "GPE"], [311, 324, "GPE"]], "meta": {"term": "Savatthi", "nikaya": "MN", "identifier": "mn.013.than.html", "title": "Maha-dukkhakkhandha Sutta", "para_seq": 1, "hits": 3, "first_offset": 65}}
{"text": "\"Answering in this way, my friend, he would answer them correctly: 'Just now, as I was staying at Savatthi, some urgent business arose at Saketa; and between Savatthi and Saketa seven relay chariots were made ready for me. Coming out the door of the inner palace in Savatthi, I got in the first relay chariot. By means of the first relay chariot I reached the second relay chariot. Getting out of the first relay chariot I got in the second relay chariot. By means of the second relay chariot I reached the third... by means of the third I reached the fourth... by means of the fourth, the fifth... by means of the fifth, the sixth... by means of the sixth I reached the seventh relay chariot. Getting out of the sixth relay chariot I got in the seventh relay chariot. By means of the seventh relay chariot I finally arrived at the door of the inner palace at Saketa.' Answering in this way, he would answer them correctly.\"", "entities": [[98, 106, "GPE"], [158, 166, "GPE"], [266, 274, "GPE"]], "meta": {"term": "Savatthi", "nikaya": "MN", "identifier": "mn.024.than.html", "title": "Ratha-vinita Sutta", "para_seq": 34, "hits": 3, "first_offset": 97}}
{"text": "I have heard that on one occasion the Blessed One was staying at Savatthi , in Jeta's Grove, Anathapindika's Monastery . Then the Blessed One, early in the morning, put on his robes and, carrying his bowl and outer robe, went into Savatthi for alms. And Ven. Rahula, early in the morning, put on his robes and, carrying his bowl and outer robe, went into Savatthi for alms following right behind the Blessed One. [1] Then the Blessed One, looking back at Rahula, addressed him: \"Rahula, any form whatsoever that is past, future, or present; internal or external; blatant or subtle; common or sublime; far or near: every form is to be seen as it actually is with right discernment as: 'This is not mine. This is not my self. This is not what I am.'\"", "entities": [[62, 73, "GPE"], [226, 239, "GPE"], [350, 363, "GPE"]], "meta": {"term": "Savatthi", "nikaya": "MN", "identifier": "mn.062.than.html", "title": "Maha-Rahulovada Sutta", "para_seq": 1, "hits": 3, "first_offset": 63}}
{"text": "Then Ratthapala the clansman obtained the going-forth in the Blessed One's presence, he obtained admission. And not long after his admission, one half month after his admission, the Blessed One–having stayed at Thullakotthita as long as he liked — set out wandering to Savatthi. Wandering by stages, he eventually arrived at Savatthi. There he lived at Savatthi in Jeta's Grove, Anathapindika's monastery.", "entities": [[269, 277, "GPE"], [325, 333, "GPE"], [353, 361, "GPE"]], "meta": {"term": "Savatthi", "nikaya": "MN", "identifier": "mn.082.than.html", "title": "Ratthapala Sutta", "para_seq": 28, "hits": 3, "first_offset": 269}}
{"text": "Then the Blessed One set out wandering toward Savatthi with Ven. Angulimala as his attendant monk. After wandering by stages he reached Savatthi, and there he lived, near Savatthi, in Jeta's Grove, Anathapindika's monastery.", "entities": [[46, 54, "GPE"], [136, 144, "GPE"], [171, 179, "GPE"]], "meta": {"term": "Savatthi", "nikaya": "MN", "identifier": "mn.086.than.html", "title": "Angulimala Sutta", "para_seq": 11, "hits": 3, "first_offset": 46}}
{"text": "Then Ven. Angulimala, early in the morning, having put on his robes and carrying his outer robe & bowl, went into Savatthi for alms. As he was going from house to house for alms, he saw a woman suffering a breech birth. On seeing her, the thought occurred to him: \"How tormented are living beings! How tormented are living beings!\" Then, having wandered for alms in Savatthi and returning from his alms round after his meal, he went to the Blessed One. On arrival, having bowed down to him, he sat to one side. As he was sitting there he said to the Blessed One, \"Just now, lord, early in the morning, having put on my robes and carrying my outer robe & bowl, I went into Savatthi for alms. As I was going from house to house for alms, I saw a woman suffering a breech birth. On seeing her, the thought occurred to me: 'How tormented are living beings! How tormented are living beings!'\"", "entities": [[114, 122, "GPE"], [366, 374, "GPE"], [672, 680, "GPE"]], "meta": {"term": "Savatthi", "nikaya": "MN", "identifier": "mn.086.than.html", "title": "Angulimala Sutta", "para_seq": 27, "hits": 3, "first_offset": 114}}
{"text": "Then in the early morning, a large number of monks, having put on their robes and carrying their bowls & outer robes, went into Savatthi for alms. Having gone for alms in Savatthi, after the meal, returning from their alms round, they went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As they were sitting there, they said to the Blessed One: \"Just now, lord, King Ajatasattu of Magadha, the son of Queen Videha, raising a fourfold army, marched toward Kasi against King Pasenadi Kosala. King Pasenadi heard, 'King Ajatasattu of Magadha, the son of Queen Videha, they say, has raised a fourfold army and is marching toward Kasi against me.' So King Pasenadi, raising a fourfold army, launched a counter-attack toward Kasi against King Ajatasattu. Then King Ajatasattu & King Pasenadi fought a battle, and in that battle King Ajatasattu defeated King Pasenadi. King Pasenadi, defeated, marched back to his capital at Savatthi.\"", "entities": [[128, 136, "GPE"], [171, 179, "GPE"], [950, 958, "GPE"]], "meta": {"term": "Savatthi", "nikaya": "SN", "identifier": "sn03.014.than.html", "title": "Sangama Sutta", "para_seq": 2, "hits": 3, "first_offset": 128}}
{"text": "At one time, the Venerable Sāriputta was dwelling near the small village of Nālaka in Magadha . And then, there where Venerable Sāriputta was, there Sāmaṇḍakāni , the wanderer, approached. Having approached, he exchanged greetings with the Venerable Sāriputta. Having exchanged greetings, and courteous talk having passed between them, he sat to one side. Having sat to one side, Sāmaṇḍakāni, the wanderer, said this to Venerable Sāriputta:", "entities": [[17, 36, "PERSON"], [118, 137, "PERSON"], [240, 259, "PERSON"], [420, 439, "PERSON"]], "meta": {"term": "Sāriputta", "nikaya": "AN", "identifier": "an10.065.niza.html", "title": "Pathama Sukha Sutta", "para_seq": 1, "hits": 4, "first_offset": 20}}
{"text": "At one time, the Venerable Sāriputta was dwelling near the small village of Nālaka in Magadha . And then, there where Venerable Sāriputta was, there Sāmaṇḍakāni , the wanderer, approached. Having approached, he exchanged greetings with the Venerable Sāriputta. Having exchanged greetings, and courteous talk having passed between them, he sat to one side. Having sat to one side, Sāmaṇḍakāni, the wanderer, said this to Venerable Sāriputta:", "entities": [[17, 36, "PERSON"], [118, 137, "PERSON"], [240, 259, "PERSON"], [420, 439, "PERSON"]], "meta": {"term": "Sāriputta", "nikaya": "AN", "identifier": "an10.066.niza.html", "title": "Dutiya Sukha Sutta", "para_seq": 1, "hits": 4, "first_offset": 20}}
{"text": "\"Now, what, friend Sāriputta, is the pleasant, and what is the painful?\"", "entities": [[12, 28, "PERSON"]], "meta": {"term": "Sāriputta", "nikaya": "AN", "identifier": "an10.065.niza.html", "title": "Pathama Sukha Sutta", "para_seq": 2, "hits": 1, "first_offset": 13}}
{"text": "\"Now, what, friend Sāriputta, is the pleasant in this Teaching and Discipline, and what is the painful?\"", "entities": [[12, 28, "PERSON"]], "meta": {"term": "Sāriputta", "nikaya": "AN", "identifier": "an10.066.niza.html", "title": "Dutiya Sukha Sutta", "para_seq": 2, "hits": 1, "first_offset": 13}}
{"text": "On one occasion the Blessed One was staying near Sāvatthī in Jeta's Grove, Anāthapiṇḍika's monastery. Then Anāthapiṇḍika the householder went to the Blessed One and, on arrival, bowed down to him and sat to one side. As he was sitting there, the Blessed One said to him, \"Householder, are gifts still given in your family?\"", "entities": [[36, 57, "GPE"]], "meta": {"term": "Sāvatthī", "nikaya": "AN", "identifier": "an09.020.than.html", "title": "Velāma Sutta", "para_seq": 1, "hits": 1, "first_offset": 42}}
{"text": "I have heard that on one occasion the Blessed One was staying near Sāvatthī in Jeta's Grove, Anāthapiṇḍika's monastery. Then Piṅgalakoccha the brahman went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there, he said to the Blessed One, \"Master Gotama, these contemplatives & brahmans, each with his group, each with his community, each the teacher of his group, an honored leader, well-regarded by people at large — i.e., Pūraṇa Kassapa , Makkhali Gosāla , Ajita Kesakambalin , Pakudha Kaccāyana , Sañjaya Velaṭṭhaputta , & the Nigaṇṭha Nāṭaputta : Do they all have direct knowledge as they themselves claim, or do they all not have direct knowledge, or do some of them have direct knowledge and some of them not?\"", "entities": [[62, 75, "GPE"]], "meta": {"term": "Sāvatthī", "nikaya": "MN", "identifier": "mn.030.than.html", "title": "Cula Saropama Sutta", "para_seq": 1, "hits": 1, "first_offset": 65}}
{"text": "I have heard that on one occasion the Blessed One was staying in Sāvatthī , at Jeta's Grove, Anāthapiṇḍika's park. Now on that occasion this pernicious viewpoint (diṭṭhigata) had arisen in the monk Sāti the Fisherman's Son: \"As I understand the Dhamma taught by the Blessed One, it is just this consciousness that runs and wanders on [from birth to birth], not another.\" A large number of monks heard, \"They say that this pernicious viewpoint has arisen in the monk Sāti the Fisherman's Son: 'As I understand the Dhamma taught by the Blessed One, it is just this consciousness that runs and wanders on [from birth to birth], not another.'\" So they went to the monk Sāti the Fisherman's Son and on arrival said to him, \"Is it true, friend Sāti, that this pernicious viewpoint has arisen in you — 'As I understand the Dhamma taught by the Blessed One, it is just this consciousness that runs and wanders on, not another'?\"", "entities": [[62, 73, "GPE"]], "meta": {"term": "Sāvatthī", "nikaya": "MN", "identifier": "mn.038.than.html", "title": "Mahatanhasankhaya Sutta", "para_seq": 1, "hits": 1, "first_offset": 63}}
{"text": "I have heard that on one occasion the Blessed One was staying near Sāvatthī in Jeta's Grove, Anāthapiṇḍika's monastery. There the Blessed One addressed the monks, \"Monks.\"", "entities": [[62, 75, "GPE"]], "meta": {"term": "Sāvatthī", "nikaya": "MN", "identifier": "mn.130.than.html", "title": "Devaduta Sutta", "para_seq": 1, "hits": 1, "first_offset": 65}}
{"text": "I have heard that on one occasion the Blessed One was staying near Sāvatthī at Jeta's Grove, Anāthapiṇḍika's monastery. There Ven. Mahā Moggallāna addressed the monks, \"Friend monks!\"", "entities": [[62, 75, "GPE"]], "meta": {"term": "Sāvatthī", "nikaya": "SN", "identifier": "sn21.001.than.html", "title": "Kolita Sutta", "para_seq": 1, "hits": 1, "first_offset": 65}}
{"text": "At Sāvatthī... There the Blessed One said this:", "entities": [[0, 11, "GPE"]], "meta": {"term": "Sāvatthī", "nikaya": "SN", "identifier": "sn22.022.niza.html", "title": "Bhāra Sutta", "para_seq": 1, "hits": 1, "first_offset": 0}}
{"text": "[ At Veluvana the wanderer Acela-Kassapa ( Naked Kassapa ) questioned the Buddha :]", "entities": [[0, 13, "LOC"]], "meta": {"term": "Veluvana", "nikaya": "SN", "identifier": "sn12.017x.wlsh.html", "title": "Acela Sutta", "para_seq": 1, "hits": 1, "first_offset": 0}}
{"text": "[ At Veluvana So.na the householder's son approached the Blessed One. The Buddha said: ] \"Whatever recluses and Brahmans, So.na, hold views about the body, which is impermanent, unsatisfactory and subject to change, such as 'I am better [than you],' 'I am equal [to you],' or 'I am worse [than you]' [ likewise 'feeling,' 'perception,' 'mental formations,' 'consciousness'], what else are they but folk who do not see things as they really are?", "entities": [[0, 13, "LOC"]], "meta": {"term": "Veluvana", "nikaya": "SN", "identifier": "sn22.049.wlsh.html", "title": "So.no Sutta", "para_seq": 1, "hits": 1, "first_offset": 0}}
{"text": "18. Then the Licchavi of Vesali came to know: \"The Blessed One, they say, has arrived at Vesali and is now staying in Ambapali's grove.\" And they ordered a large number of magnificent carriages to be made ready, each mounted one, and accompanied by the rest, drove out from Vesali. Now, of these Licchavis, some were in blue, with clothing and ornaments all of blue, while others were in yellow, red, and white.", "entities": [[22, 31, "GPE"], [86, 95, "GPE"], [269, 280, "GPE"]], "meta": {"term": "Vesali", "nikaya": "DN", "identifier": "dn.16.1-6.vaji.html", "title": "Maha-parinibbana Sutta", "para_seq": 128, "hits": 3, "first_offset": 21}}
{"text": "1. Then the Blessed One, getting ready in the forenoon, took bowl and robe and went into Vesali for alms. After the alms round and meal, on his return, he looked upon Vesali with the elephant's look, [36] and said to the Venerable Ananda: \"This, Ananda, is the last time that the Tathagata will look upon Vesali. Come, Ananda, let us go to Bhandagama .\"", "entities": [[84, 95, "GPE"], [162, 173, "GPE"], [300, 311, "GPE"]], "meta": {"term": "Vesali", "nikaya": "DN", "identifier": "dn.16.1-6.vaji.html", "title": "Maha-parinibbana Sutta", "para_seq": 230, "hits": 3, "first_offset": 86}}
{"text": ". Then, when it was morning, the Venerable Sariputta dressed, and taking his bowl and outer robe, went into Vesali for alms. Then he heard Sunakkhatta, son of the Licchavis, making this statement before the Vesali assembly. When he had wandered for alms in Vesali and had returned from his almsround, after his meal he went to the Blessed One, and after paying homage to him, he sat down at one side and told the Blessed One what Sunakkhatta was saying.", "entities": [[103, 114, "GPE"], [203, 213, "GPE"], [254, 263, "GPE"]], "meta": {"term": "Vesali", "nikaya": "MN", "identifier": "mn.012.ntbb.html", "title": "Maha-sihanada Sutta", "para_seq": 3, "hits": 3, "first_offset": 106}}
{"text": "On one occasion a certain monk, a Vajjian princeling, was dwelling near Vesali in a forest thicket. And on that occasion an all-night festival was being held in Vesali. The monk — lamenting as he heard the resounding din of wind music, string music, & gongs coming from Vesali, on that occasion recited this verse:", "entities": [[58, 71, "GPE"], [153, 160, "GPE"], [258, 269, "GPE"]], "meta": {"term": "Vesali", "nikaya": "SN", "identifier": "sn09.009.than.html", "title": "Vajjiputta Sutta", "para_seq": 1, "hits": 3, "first_offset": 65}}
{"text": "16 . Then Ambapali the courtesan came to know: \"The Blessed One, they say, has arrived at Vesali and is now staying in my Mango Grove.\" And she ordered a large number of magnificent carriages to be made ready, mounted one of them herself, and accompanied by the rest, drove out from Vesali towards her park. She went by carriage as far as the carriage could go, then alighted; and approaching the Blessed One on foot, she respectfully greeted him and sat down at one side. And the Blessed One instructed Ambapali the courtesan in the Dhamma and roused, edified, and gladdened her.", "entities": [[79, 96, "GPE"], [278, 289, "GPE"]], "meta": {"term": "Vesali", "nikaya": "DN", "identifier": "dn.16.1-6.vaji.html", "title": "Maha-parinibbana Sutta", "para_seq": 125, "hits": 2, "first_offset": 85}}
{"text": "57. \"So also at Vesali, Ananda, at different times the Tathagata has spoken to you, saying: 'Pleasant, Ananda, is Vesali; pleasant are the shrines of Udena, Gotamaka, Sattambaka, Bahuputta, Sarandada, and Capala. Whosoever, Ananda, has developed... Therefore the Tathagata could, if he so desired, remain throughout a world-period or until the end of it.'", "entities": [[8, 15, "GPE"], [103, 113, "GPE"]], "meta": {"term": "Vesali", "nikaya": "DN", "identifier": "dn.16.1-6.vaji.html", "title": "Maha-parinibbana Sutta", "para_seq": 220, "hits": 2, "first_offset": 8}}
{"text": "42. And the king of Magadha, Ajatasattu, son of the Videhi queen, erected a stupa over the relics of the Blessed One at Rajagaha, and in their honor held a festival. The Licchavis of Vesali erected a stupa over the relics of the Blessed One at Vesali, and in their honor held a festival. The Sakyas of Kapilavatthu erected a stupa over the relics of the Blessed One at Kapilavatthu, and in their honor held a festival. The Bulis of Allakappa erected a stupa over the relics of the Blessed One at Allakappa, and in their honor held a festival. The Kolis of Ramagama erected a stupa over the relics of the Blessed One at Ramagama, and in their honor held a festival. The Vethadipa brahman erected a stupa over the relics of the Blessed One at Vethadipa, and in their honor held a festival. The Mallas of Pava erected a stupa over the relics of the Blessed One at Pava, and in their honor held a festival. The Mallas of Kusinara erected a stupa over the relics of the Blessed One at Kusinara, and in their honor held a festival. The brahman Dona erected a stupa over the urn, and in its honor held a festival. And the Moriyas of Pipphalivana erected a stupa over the ashes at Pipphalivana, and in their honor held a festival.", "entities": [[170, 179, "GPE"], [229, 240, "GPE"]], "meta": {"term": "Vesali", "nikaya": "DN", "identifier": "dn.16.1-6.vaji.html", "title": "Maha-parinibbana Sutta", "para_seq": 450, "hits": 2, "first_offset": 171}}
{"text": "The Licchavis of Vesali built a burial mound and held a ceremony for the Blessed One's relics in Vesali.", "entities": [[14, 23, "GPE"], [94, 103, "GPE"]], "meta": {"term": "Vesali", "nikaya": "DN", "identifier": "dn.16.5-6.than.html", "title": "Maha-parinibbana Sutta", "para_seq": 139, "hits": 2, "first_offset": 13}}
{"text": "I have heard that on one occasion the Blessed One was staying in Vesali , at the Gabled Hall in the Great Forest. And on that occasion he had finished dressing in the morning and was carrying his bowl and outer robe, planning to enter Vesali for alms.", "entities": [[62, 71, "GPE"], [229, 241, "GPE"]], "meta": {"term": "Vesali", "nikaya": "MN", "identifier": "mn.036.than.html", "title": "Maha-Saccaka Sutta", "para_seq": 1, "hits": 2, "first_offset": 63}}
{"text": "On one occasion the Blessed One was staying near Vesali at the Gabled Hall in the Great Forest. Then in the early morning, Ven. Ananda , having put on his robe and carrying his bowl and outer robe, went into Vesali for alms. He saw a large number of Licchavi boys practicing archery in the stadium building. From a distance they were shooting arrows through a tiny keyhole without missing, one right after the other. On seeing this, the thought occurred to him, \"How trained these Licchavi boys are, how well-trained these Licchavi boys are, in that from a distance they can shoot arrows through a tiny keyhole without missing, one right after the other!\"", "entities": [[36, 48, "GPE"], [198, 207, "GPE"]], "meta": {"term": "Vesali", "nikaya": "SN", "identifier": "sn56.045.than.html", "title": "Vala Sutta", "para_seq": 1, "hits": 2, "first_offset": 42}}
{"text": "Then, having gone for alms in Vesali, after his meal, returning from his alms round, Ven. Ananda went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there, he said to the Blessed One: \"Just now, lord, in the early morning, having put on my robe and carrying my bowl and outer robe, I went into Vesali for alms. I saw a large number of Licchavi boys practicing archery in the stadium building. From a distance they were shooting arrows through a tiny keyhole without missing, one right after the other. On seeing this, the thought occurred to me 'How trained these Licchavi boys are, how well-trained these Licchavi boys are, in that from a distance they can shoot arrows through a tiny keyhole without missing, one right after the other!'\"", "entities": [[30, 36, "GPE"], [344, 350, "GPE"]], "meta": {"term": "Vesali", "nikaya": "SN", "identifier": "sn56.045.than.html", "title": "Vala Sutta", "para_seq": 2, "hits": 2, "first_offset": 30}}
{"text": "On one occasion the Blessed One was staying near Vesali at Gotamaka Shrine. There he addressed the monks, \"Monks!\"", "entities": [[36, 48, "GPE"]], "meta": {"term": "Vesali", "nikaya": "AN", "identifier": "an03.123.than.html", "title": "Gotamaka-cetiya Sutta", "para_seq": 1, "hits": 1, "first_offset": 42}}
{"text": "I have heard that on one occasion the Blessed One was staying near Vesālī , at the Gabled Hall in the Great Forest. And on that occasion Saccaka the Nigaṇṭha-son was dwelling in Vesālī — a debater, a sophist, [1] well-regarded by people at large. He made this statement before the assembly in Vesālī: \"I see no contemplative or brahman, the head of an order, the head of a group, or even one who claims to be an arahant, rightly self-awakened, who — engaged in debate with me — would not shiver, quiver, shake, & break out in sweat under the armpits. Even if I were to engage a senseless stump in debate, it — engaged with me in debate — would shiver, quiver, & shake, to say nothing of a human being.\"", "entities": [[62, 73, "GPE"], [175, 184, "GPE"], [290, 299, "GPE"]], "meta": {"term": "Vesālī", "nikaya": "MN", "identifier": "mn.035.than.html", "title": "Cula-Saccaka Sutta", "para_seq": 1, "hits": 3, "first_offset": 65}}
{"text": "Then early in the morning Ven. Assaji [2] adjusted his under robe and — carrying his bowl & robes — went into Vesālī for alms. Saccaka the Nigaṇṭha-son, walking & wandering around Vesālī to exercise his legs, saw Ven. Assaji coming from afar. On seeing him, he went up to him and exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he stood to one side. As he was standing there, he said to him, \"Master Assaji, how does Gotama the contemplative discipline his disciples? Or what part of his instruction is generally presented to his disciples?\"", "entities": [[110, 116, "GPE"], [180, 186, "GPE"]], "meta": {"term": "Vesālī", "nikaya": "MN", "identifier": "mn.035.than.html", "title": "Cula-Saccaka Sutta", "para_seq": 2, "hits": 2, "first_offset": 110}}
{"text": "On one occasion the Blessed One was living in Vesālī , in the Great Wood. Then a certain Vajjian monk approached him and, on arrival, having bowed down to him, sat to one side. As he was sitting there, he said to the Blessed One, \"Lord, this recitation of more than 150 training rules comes every fortnight. [1] I cannot train in reference to them.\"", "entities": [[36, 45, "GPE"]], "meta": {"term": "Vesālī", "nikaya": "AN", "identifier": "an03.083.than.html", "title": "Vajjiputta Sutta", "para_seq": 1, "hits": 1, "first_offset": 39}}
{"text": "\"Suppose a man — in need of heartwood, seeking heartwood, wandering in search of heartwood — were to enter a forest taking a sharp ax. There he would see a large plantain trunk: straight, young, immature. He would cut it at the root and, having cut it at the root, cut off the crown. Having cut off the crown, he would unfurl the leaf sheaths. Unfurling the leaf sheaths, he wouldn't even find sapwood there, to say nothing of heartwood. In the same way, Aggivessana, when you are interrogated, rebuked, & pressed by me with regard to your own statement, you are empty, void, mistaken. But it was you who made this statement before the assembly in Vesālī: 'I see no contemplative or brahman, the head of an order, the head of a group, or even one who claims to be an arahant, rightly self-awakened, who — engaged in debate with me — would not shiver, quiver, shake, & break out in sweat under the armpits. Even if I were to engage a senseless stump in debate, it — engaged with me in debate — would shiver, quiver, & shake, to say nothing of a human being.' But now some drops of sweat coming out of your forehead, drenching your upper robe, are landing on the ground, whereas now I have no sweat on my body.\" And the Blessed One uncovered his golden-colored body to the assembly. When this was said, Saccaka the Nigaṇṭha-son fell silent, abashed, sitting with his shoulders drooping, his head down, brooding, at a loss for words.", "entities": [[648, 654, "GPE"]], "meta": {"term": "Vesālī", "nikaya": "MN", "identifier": "mn.035.than.html", "title": "Cula-Saccaka Sutta", "para_seq": 59, "hits": 1, "first_offset": 647}}
{"text": "Then, not long after Potaliputta the wanderer had left, Ven. Samiddhi went to Ven. Ānanda and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there, he reported to Ven. Ānanda the Elder [2] the entirety of his discussion with Potaliputta the wanderer. When this was said, Ven. Ānanda said to him, \"Friend Samiddhi, there is warrant here for seeing the Blessed One. Let's go to the Blessed One and, on arrival, report this matter to him. However he explains it to us, that's how we should bear it in mind.\"", "entities": [[83, 89, "PERSON"], [266, 272, "PERSON"], [374, 380, "PERSON"]], "meta": {"term": "Ānanda", "nikaya": "MN", "identifier": "mn.136.than.html", "title": "Maha Kammavibhanga Sutta", "para_seq": 8, "hits": 3, "first_offset": 83}}
{"text": "When this was said, the Blessed One said to Ven. Ānanda, \"Look, Ānanda, at how this worthless Udāyin interrupts. I knew just now that he would interrupt in an inappropriate way. From the very beginning, Potaliputta the wanderer was asking about the three kinds of feeling. When this worthless Samiddhi was asked by him in this way, he should have answered, 'Having intentionally done — with body, with speech, or with mind — an action that is to be felt as pleasure, one experiences pleasure. Having intentionally done — with body, with speech, or with mind — an action that is to be felt as pain, one experiences pain. Having intentionally done — with body, with speech, or with mind — an action that is to be felt as neither-pleasure-nor-pain, one experiences neither-pleasure-nor-pain. Answering this way, this worthless Samiddhi would have rightly answered Potaliputta the wanderer. But then who [3] are these wanderers of other sects, foolish & inexperienced? And who would understand the Tathāgata's greater analysis of action — if you were to listen, Ānanda, to the Tathāgata analyzing the greater analysis of action?\"", "entities": [[49, 55, "PERSON"], [64, 70, "PERSON"], [1058, 1064, "PERSON"]], "meta": {"term": "Ānanda", "nikaya": "MN", "identifier": "mn.136.than.html", "title": "Maha Kammavibhanga Sutta", "para_seq": 13, "hits": 3, "first_offset": 49}}
{"text": "So Ven. Samiddhi and Ven. Ānanda went to the Blessed One and, on arrival, bowed down to him and sat to one side. As they were sitting there, Ven. Ānanda reported to the Blessed One the entirety of the discussion between Ven. Samiddhi and Potaliputta the wanderer.", "entities": [[17, 24, "PERSON"], [134, 144, "PERSON"]], "meta": {"term": "Ānanda", "nikaya": "MN", "identifier": "mn.136.than.html", "title": "Maha Kammavibhanga Sutta", "para_seq": 10, "hits": 2, "first_offset": 18}}
{"text": "\"As you say, friend, Ven. Samiddhi responded to Ven. Ānanda.", "entities": [[35, 47, "PERSON"]], "meta": {"term": "Ānanda", "nikaya": "MN", "identifier": "mn.136.than.html", "title": "Maha Kammavibhanga Sutta", "para_seq": 9, "hits": 1, "first_offset": 40}}
{"text": "\"In that case, Ānanda, listen and pay close attention. I will speak.\"", "entities": [[9, 21, "PERSON"]], "meta": {"term": "Ānanda", "nikaya": "MN", "identifier": "mn.136.than.html", "title": "Maha Kammavibhanga Sutta", "para_seq": 15, "hits": 1, "first_offset": 11}}
{"text": "\"As you say, lord,\" Ven. Ānanda responded to the Blessed One.", "entities": [[13, 17, "PERSON"]], "meta": {"term": "Ānanda", "nikaya": "MN", "identifier": "mn.136.than.html", "title": "Maha Kammavibhanga Sutta", "para_seq": 16, "hits": 1, "first_offset": 12}}
{"text": "The Blessed One said, \"Ānanda, there are four kinds of person to be found in the world. Which four? There is the case where a certain person is one who takes life, takes what is not given (steals), engages in illicit sex, lies, speaks divisively, speaks abusively, engages in idle chatter; is covetous, malevolent, & holds wrong view. With the breakup of the body, after death, he reappears in a plane of deprivation, a bad destination, a lower realm, hell.", "entities": [[16, 29, "PERSON"]], "meta": {"term": "Ānanda", "nikaya": "MN", "identifier": "mn.136.than.html", "title": "Maha Kammavibhanga Sutta", "para_seq": 17, "hits": 1, "first_offset": 19}}
{"text": "\"There is the case, Ānanda, where a certain contemplative or brahman — through ardency, exertion, commitment, heedfulness, & right attention — touches the sort of concentration of awareness that, when his mind is thus concentrated, he sees with the divine eye, pure and surpassing the human, that person — the case where one who takes life, takes what is not given (steals), engages in illicit sex, lies, speaks divisively, speaks abusively, engages in idle chatter, is covetous, malevolent, & holds wrong view, with the breakup of the body, after death, has reappeared in a plane of deprivation, a bad destination, a lower realm, hell.", "entities": [[20, 26, "PERSON"]], "meta": {"term": "Ānanda", "nikaya": "MN", "identifier": "mn.136.than.html", "title": "Maha Kammavibhanga Sutta", "para_seq": 21, "hits": 1, "first_offset": 19}}
{"text": "\"Then there is the case, Ānanda, where a certain contemplative or brahman — through ardency, exertion, commitment, heedfulness, & right attention — touches the sort of concentration of awareness that, when his mind is thus concentrated, he sees with the divine eye, pure and surpassing the human, that person — the case where one who takes life, takes what is not given (steals), engages in illicit sex, lies, speaks divisively, speaks abusively, engages in idle chatter, is covetous, malevolent, & holds wrong view, with the breakup of the body, after death, has reappeared in a good destination, a heavenly world.", "entities": [[25, 31, "PERSON"]], "meta": {"term": "Ānanda", "nikaya": "MN", "identifier": "mn.136.than.html", "title": "Maha Kammavibhanga Sutta", "para_seq": 23, "hits": 1, "first_offset": 24}}
{"text": "\"Then there is the case, Ānanda, where a certain contemplative or brahman — through ardency, exertion, commitment, heedfulness, & right attention — touches the sort of concentration of awareness that, when his mind is thus concentrated, he sees with the divine eye, pure and surpassing the human, that person — the case where one who abstains from taking life, abstains from taking what is not given, abstains from illicit sex, abstains from lying, abstains from speaking divisively, abstains from speaking abusively, abstains from idle chatter, is not covetous, not malevolent, & holds right view, with the breakup of the body, after death, reappears in a good destination, a heavenly world.", "entities": [[25, 31, "PERSON"]], "meta": {"term": "Ānanda", "nikaya": "MN", "identifier": "mn.136.than.html", "title": "Maha Kammavibhanga Sutta", "para_seq": 25, "hits": 1, "first_offset": 24}}
{"text": "\"Then there is the case, Ānanda, where a certain contemplative or brahman — through ardency, exertion, commitment, heedfulness, & right attention — touches the sort of concentration of awareness that, when his mind is thus concentrated, he sees with the divine eye, pure and surpassing the human, that person — the case where one who abstains from taking life, abstains from taking what is not given, abstains from illicit sex, abstains from lying, abstains from speaking divisively, abstains from speaking abusively, abstains from idle chatter, is not covetous, not malevolent, & holds right view, with the breakup of the body, after death, reappears in a plane of deprivation, a bad destination, a lower realm, hell.", "entities": [[25, 31, "PERSON"]], "meta": {"term": "Ānanda", "nikaya": "MN", "identifier": "mn.136.than.html", "title": "Maha Kammavibhanga Sutta", "para_seq": 27, "hits": 1, "first_offset": 24}}
{"text": "\"Now, Ānanda, in the case where the contemplative or brahman says, 'So there really are evil actions, there really is the result of misconduct,' I allow him that. When he says, 'For I saw the case where a person who took life... & held wrong view, with the breakup of the body, after death, has reappeared in a plane of deprivation, a bad destination, a lower realm, hell,' I allow him that, too. But when he says, 'Anyone who takes life... & hold wrong view: They all, on the breakup of the body, after death, reappear in a plane of deprivation, a bad destination, a lower realm, hell,' I don't allow him that. And when he says, 'Whoever knows this, knows rightly; whoever knows otherwise, their knowledge is wrong,' I don't allow him that. When, insisting through obstinacy & grasping right there on what was seen by himself, known by himself, understood by himself, he states: 'Only this is true. Everything otherwise is worthless,' I don't allow him that, either. Why is that? Because the Tathāgata's knowledge with regard to the greater analysis of action is otherwise.", "entities": [[1, 4, "PERSON"]], "meta": {"term": "Ānanda", "nikaya": "MN", "identifier": "mn.136.than.html", "title": "Maha Kammavibhanga Sutta", "para_seq": 29, "hits": 1, "first_offset": 0}}
