{"text": "\"Then there is the case where a certain person, having gone to a brahman or contemplative, makes him an offer: 'Tell me, sir, what you need in terms of the [four] requisites.' But he gives him something other than what he intended by the offer. If he passes away from there and comes here, then whatever trade he engages in, it turns out not as intended.", "spans": [], "meta": {"identifier": "an04.079.than.html", "title": "Vanijja Sutta", "source": "neg"}}
{"text": "\"Then, with the stilling of directed thoughts & evaluations, he enters and remains in the second jhana: rapture and pleasure born of composure, one-pointedness of awareness free from directed thought and evaluation — internal assurance.", "spans": [], "meta": {"identifier": "mn.027.than.html", "title": "Cula-hatthipadopama Sutta", "source": "neg"}}
{"text": "\" Suppose that corn had ripened and the watchman was heedless. A corn-eating ox, invading the corn to eat it, would intoxicate itself as much as it liked. In the same way, an uninstructed run-of-the-mill person, not exercising restraint with regard to the six media of sensual contact, intoxicates himself with the five strings of sensuality as much as he likes.", "spans": [], "meta": {"identifier": "sn35.205.than.html", "title": "Vina Sutta", "source": "neg"}}
{"text": "\"Eye-consciousness is inconstant, changeable, of a nature to become otherwise. Whatever is the cause, the requisite condition, for the arising of eye-consciousness, that is inconstant, changeable, of a nature to become otherwise. Having arisen in dependence on an inconstant factor, how could eye-consciousness be constant?", "spans": [], "meta": {"identifier": "sn35.093.than.html", "title": "Dvaya Sutta", "source": "neg"}}
{"text": "\"A monk who has attained once-returning should attend in an appropriate way to these five clinging-aggregates as inconstant, stressful, a disease, a cancer, an arrow, painful, an affliction, alien, a dissolution, an emptiness, not-self. For it is possible that a monk who has attained once-returning, attending in an appropriate way to these five clinging-aggregates as inconstant... not-self, would realize the fruit of non-returning.\"", "spans": [], "meta": {"identifier": "sn22.122.than.html", "title": "Silavant Sutta", "source": "neg"}}
{"text": ". \"Householders, it is by reason of conduct not in accordance with the Dhamma, by reason of unrighteous conduct, that beings here on the dissolution of the body, after death, reappear in states of deprivation, in an unhappy destination, in perdition, even in hell. It is by reason of conduct in accordance with the Dhamma, by reason of righteous conduct, that some beings here on the dissolution of the body, after death, reappear in a happy destination, even in the heavenly world.\"", "spans": [], "meta": {"identifier": "mn.041.nymo.html", "title": "Saleyyaka Sutta", "source": "neg"}}
{"text": "\"'The origin of suffering, as a noble truth, is this.' Such was the vision... 'This origin of suffering, as a noble truth, can be abandoned.' Such was the vision... 'This origin of suffering, as a noble truth, has been abandoned.' Such was the vision... in regard to ideas not heard by me before.", "spans": [], "meta": {"identifier": "sn56.011.nymo.html", "title": "Dhammacakkappavattana Sutta", "source": "neg"}}
{"text": "\" Suppose there were a chariot on level ground at four crossroads, harnessed to thoroughbreds, waiting with whips lying ready, so that a skilled driver, a trainer of tamable horses, might mount and — taking the reins with his left hand and the whip with his right — drive out and back, to whatever place and by whichever road he liked; in the same way, when a monk has developed and pursued the five-factored noble right concentration in this way, then whichever of the six higher knowledges he turns his mind to know and realize, he can witness them for himself whenever there is an opening.", "spans": [], "meta": {"identifier": "an05.028.than.html", "title": "Samadhanga Sutta", "source": "neg"}}
{"text": "\"'One doesn't discern, one doesn't discern': Thus, friend, one is said to be 'one of poor discernment.' And what doesn't one discern? One doesn't discern, 'This is stress.' One doesn't discern, 'This is the origination of stress.' One doesn't discern, 'This is the cessation of stress.' One doesn't discern, 'This is the practice leading to the cessation of stress.' 'One doesn't discern, one doesn't discern': Thus one is said to be 'one of poor discernment.'\"", "spans": [], "meta": {"identifier": "mn.043.than.html", "title": "Mahavedalla Sutta", "source": "neg"}}
{"text": "\"His mind does not remain consumed with the gain. His mind does not remain consumed with the loss... with the status... the disgrace... the censure... the praise... the pleasure. His mind does not remain consumed with the pain.", "spans": [], "meta": {"identifier": "an08.006.than.html", "title": "Lokavipatti Sutta", "source": "neg"}}
{"text": "\"Then, with the abandoning of pleasure and pain — as with the earlier disappearance of elation and distress — he enters and remains in the fourth jhana: purity of equanimity and mindfulness, neither-pleasure-nor-pain. This, too, is how striving is fruitful, how exertion is fruitful.", "spans": [], "meta": {"identifier": "mn.101.than.html", "title": "Devadaha Sutta", "source": "neg"}}
{"text": "\"By detachment from joy he dwells in equanimity, mindful, and with clear comprehension and enjoys bliss in body, and attains to and abides in the third jhana which the noble ones (ariyas) call: 'Dwelling in equanimity, mindfulness, and bliss.'", "spans": [], "meta": {"identifier": "mn.141.piya.html", "title": "Saccavibhanga Sutta", "source": "neg"}}
{"text": "\"And how is a monk consummate in beauty? There is the case where a monk is virtuous. He dwells restrained in accordance with the Patimokkha, consummate in his behavior & sphere of activity. He trains himself, having undertaken the training rules, seeing danger in the slightest fault. This is how a monk is consummate in beauty.", "spans": [], "meta": {"identifier": "an03.094.than.html", "title": "Ajaniya Sutta", "source": "neg"}}
{"text": "\"In the same way, monks, few are the beings who, on passing away from the human realm, are reborn among human beings. Far more are the beings who, on passing away from the human realm, are reborn in hell.", "spans": [], "meta": {"identifier": "sn56.102-113.than.html", "title": "Pansu Suttas", "source": "neg"}}
{"text": "\"Furthermore, with the complete transcending of the dimension of neither perception nor non-perception, he enters & remains in the cessation of perception & feeling. And, having seen [that] with discernment, his fermentations are completely ended. This too is a quality higher & more sublime than knowledge & vision.", "spans": [], "meta": {"identifier": "mn.030.than.html", "title": "Cula Saropama Sutta", "source": "neg"}}
{"text": "\" Furthermore , sensual passions as they have come to be are well seen with right discernment as analogous to hot charcoals by a monk whose effluents are ended. The fact that sensual passions as they have come to be are well seen with right discernment as analogous to hot charcoals by a monk whose effluents are ended is also a strength of a monk whose effluents are ended, with reference to which he affirms the ending of the effluents (thus): 'The effluents are ended in me.'", "spans": [], "meta": {"identifier": "an08.028.than.html", "title": "Bala Sutta", "source": "neg"}}
{"text": "\"But as for what's called 'mind,' 'intellect,' or 'consciousness,' the uninstructed run-of-the-mill person is unable to grow disenchanted with it, unable to grow dispassionate toward it, unable to gain release from it. Why is that? For a long time this has been relished, appropriated, and grasped by the uninstructed run-of-the-mill person as, 'This is me, this is my self, this is what I am.' Thus the uninstructed run-of-the-mill person is unable to grow disenchanted with it, unable to grow dispassionate toward it, unable to gain release from it.", "spans": [], "meta": {"identifier": "sn12.061.than.html", "title": "Assutavā Sutta", "source": "neg"}}
{"text": "\"And how is a monk skilled in reading his own mind? Imagine a young woman — or man — fond of adornment, examining the image of her own face in a bright, clean mirror or bowl of clear water: If she saw any dirt or blemish there, she would try to remove it. If she saw no dirt or blemish there, she would be pleased, her resolves fulfilled: 'How fortunate I am! How clean I am!' In the same way, a monk's self-examination is very productive in terms of skillful qualities: [2] 'Am I one who achieves internal tranquility of awareness, or am I one who does not achieve internal tranquility of awareness? Am I one who achieves insight into phenomena through heightened discernment, or am I one who does not achieve insight into phenomena through heightened discernment?\"", "spans": [], "meta": {"identifier": "an10.054.than.html", "title": "Samatha Sutta", "source": "neg"}}
{"text": "\"For a person whose mind is concentrated, there is no need for an act of will, 'May I know & see things as they actually are.' It is in the nature of things that a person whose mind is concentrated knows & sees things as they actually are.", "spans": [], "meta": {"identifier": "an11.002.than.html", "title": "Cetana Sutta", "source": "neg"}}
{"text": ". \"When a noble disciple has thus understood craving, the origin of craving, the cessation of craving, and the way leading to the cessation of craving... he here and now makes an end of suffering. In that way too a noble disciple is one of right view... and has arrived at this true Dhamma.\"", "spans": [], "meta": {"identifier": "mn.009.ntbb.html", "title": "Sammaditthi Sutta", "source": "neg"}}
{"text": "\"The thought occurred to the deva living in the sala tree: 'Now what future danger did my friends & companions, relatives & kin — garden devas, forest devas, tree devas, devas living in herbs, grass, & forest monarchs — foresee in that maluva creeper seed that they gathered together to console me: \"Have no fear, have no fear. In all likelihood a peacock is sure to swallow this maluva creeper seed, or a deer will eat it, or a brush fire will burn it up, or woodsmen will pick it up, or termites will carry it off, and anyway it probably isn't really a seed.\" It's pleasant, the touch of this maluva creeper's soft, tender, downy tendril.'", "spans": [], "meta": {"identifier": "mn.045.than.html", "title": "Cula-dhammasamadana Sutta", "source": "neg"}}
{"text": "\"But a person of integrity notices, 'It's not through gains that the quality of greed goes to its end; it's not through gains that the quality of aversion... the quality of delusion goes to its end. Even though one is not one who gains robe-cloth, alms-food, lodgings, & medicinal requisites for the sick, if — practicing the Dhamma in line with the Dhamma, practicing masterfully — he is one who follows the Dhamma, he is to be honored for that, praised for that.' So, giving priority just to the practice, he neither exalts himself for his gains nor disparages others. This is the quality of a person of integrity.", "spans": [], "meta": {"identifier": "mn.113.than.html", "title": "Sappurisa Sutta", "source": "neg"}}
{"text": "\"Now, there is the case where a monk enters & remains in a certain peaceful awareness-release. He attends to the cessation of self-identification, and as he is attending to the cessation of self-identification his mind leaps up, grows confident, steadfast, & firm in the cessation of self-identification. For him the cessation of self-identification is to be expected. Just as if a man were to grasp a branch with a clean hand, his hand would not stick to it, grip it, or adhere to it; in the same way, the monk enters & remains in a certain peaceful awareness-release. He attends to the cessation of self-identification, and as he is attending to the cessation of self-identification his mind leaps up, grows confident, steadfast, & firm in the cessation of self-identification. For him the cessation of self-identification is to be expected.", "spans": [], "meta": {"identifier": "an04.178.than.html", "title": "Jambali Sutta", "source": "neg"}}
{"text": "\"Then the creeper, having enwrapped the sala tree, having made a canopy over it, & cascading down around it, caused the massive limbs of the sala tree to come crashing down. The thought occurred to the deva living in the tree: 'This was the future danger my friends... foresaw in that maluva creeper seed, that they gathered together to console me... It's because of that maluva creeper seed that I'm now experiencing sharp, burning pains.'", "spans": [], "meta": {"identifier": "mn.045.than.html", "title": "Cula-dhammasamadana Sutta", "source": "neg"}}
{"text": "\"'The perception of distaste for every world, when developed & pursued, is of great fruit, of great benefit. It gains a footing in the Deathless, has the Deathless as its final end': Thus was it said, and in reference to this was it said.", "spans": [], "meta": {"identifier": "an07.046.than.html", "title": "Sañña Sutta", "source": "neg"}}
{"text": "\" Just as , of all wood fragrances, red sandalwood is reckoned the foremost; in the same way, all skillful qualities are rooted in heedfulness, converge in heedfulness, and heedfulness is reckoned the foremost among them.", "spans": [], "meta": {"identifier": "an10.015.than.html", "title": "Appamada Sutta", "source": "neg"}}
{"text": ". \"And what, friends, is the unwholesome, what is the root of the unwholesome, what is the wholesome, what is the root of the wholesome? Killing living beings is unwholesome; taking what is not given is unwholesome; misconduct in sensual pleasures is unwholesome; false speech is unwholesome; malicious speech is unwholesome; harsh speech is unwholesome; gossip is unwholesome; covetousness is unwholesome; ill will is unwholesome; wrong view is unwholesome. This is called the unwholesome.", "spans": [], "meta": {"identifier": "mn.009.ntbb.html", "title": "Sammaditthi Sutta", "source": "neg"}}
{"text": "\"And as I remained thus heedful, ardent, & resolute, thinking imbued with non-ill will arose in me. I discerned that 'Thinking imbued with non-ill will has arisen in me; and that leads neither to my own affliction, nor to the affliction of others, nor to the affliction of both. It fosters discernment, promotes lack of vexation, & leads to Unbinding. If I were to think & ponder in line with that even for a night... even for a day... even for a day & night, I do not envision any danger that would come from it, except that thinking & pondering a long time would tire the body. When the body is tired, the mind is disturbed; and a disturbed mind is far from concentration.' So I steadied my mind right within, settled, unified, & concentrated it. Why is that? So that my mind would not be disturbed.", "spans": [], "meta": {"identifier": "mn.019.than.html", "title": "Dvedhavitakka Sutta", "source": "neg"}}
{"text": "\"And what, monks, are the qualities that make one a contemplative, that make one a brahman? 'We will be endowed with conscience & concern (for the consequences of wrong-doing)': That's how you should train yourselves. Now the thought may occur to you, 'We are endowed with conscience & concern. That much is enough, that much means we're done, so that the goal of our contemplative state has been reached. There's nothing further to be done,' and you may rest content with just that. So I tell you, monks. I exhort you, monks. Don't let those of you who seek the contemplative state fall away from the goal of the contemplative state when there is more to be done.", "spans": [], "meta": {"identifier": "mn.039.than.html", "title": "Maha-Assapura Sutta", "source": "neg"}}
{"text": "\"I would take it out, lord. If I couldn't get it out right away, then holding its head in my left hand and crooking a finger of my right, I would take it out, even if it meant drawing blood. Why is that? Because I have sympathy for the young boy.\"", "spans": [], "meta": {"identifier": "mn.058.than.html", "title": "Abhaya Sutta", "source": "neg"}}
{"text": "\"Monks, there are these three kinds of suffering. [1] What three? Suffering caused by pain, [2] suffering caused by the formations (or conditioned existence), [3] suffering due to change. [4] It is for the full comprehension, clear understanding, ending and abandonment of these three forms of suffering that the Noble Eightfold Path is to be cultivated...\"", "spans": [], "meta": {"identifier": "sn45.165.wlsh.html", "title": "Dukkhata Sutta", "source": "neg"}}
{"text": "\"Seeing thus, the instructed disciple of the noble ones grows disenchanted with form, disenchanted with feeling, disenchanted with perception, disenchanted with fabrications, disenchanted with consciousness. Disenchanted, he becomes dispassionate. Through dispassion, he is fully released. With full release, there is the knowledge, 'Fully released.' He discerns that 'Birth is ended, the holy life fulfilled, the task done. There is nothing further for this world.'\"", "spans": [], "meta": {"identifier": "sn22.097.than.html", "title": "Nakhasikha Sutta", "source": "neg"}}
{"text": "\"And how is a person of integrity a person of integrity in the way he acts? There is the case where a person of integrity is one who refrains from taking life, refrains from stealing, refrains from illicit sex. This is how a person of integrity is a person of integrity in the way he acts.", "spans": [], "meta": {"identifier": "mn.110.than.html", "title": "Cula-punnama Sutta", "source": "neg"}}
{"text": "\" Just as with a pond not far from a town or village, with clear water, cool water, fresh water, clean, with good fords, delightful. People would draw water from it or drink it or bathe in it or apply it to their needs. And so that water, properly put to use, would go to a good use and not to waste. In the same way, when a person of integrity acquires lavish wealth... his wealth, properly put to use, goes to a good use and not to waste.\"", "spans": [], "meta": {"identifier": "sn03.019.than.html", "title": "Aputtaka Sutta", "source": "neg"}}
{"text": "\" That disciple of the noble ones , headman — thus devoid of covetousness, devoid of ill will, unbewildered, alert, mindful — keeps pervading the first direction [the east] with an awareness imbued with good will, likewise the second, likewise the third, likewise the fourth. Thus above, below, & all around, everywhere, in its entirety, he keeps pervading the all-encompassing cosmos with an awareness imbued with good will — abundant, expansive, immeasurable, without hostility, without ill will. Just as a strong conch-trumpet blower can notify the four directions without any difficulty, in the same way, when the awareness-release through good will is thus developed, thus pursued, any deed done to a limited extent no longer remains there, no longer stays there.", "spans": [], "meta": {"identifier": "sn42.008.than.html", "title": "Sankha Sutta", "source": "neg"}}
{"text": "\"And how is a person of integrity a person of integrity in the way he gives a gift? There is the case where a person of integrity gives a gift attentively, with his own hand, respectfully, not as if throwing it away, with the view that something will come of it. This is how a person of integrity is a person of integrity in the way he gives a gift.", "spans": [], "meta": {"identifier": "mn.110.than.html", "title": "Cula-punnama Sutta", "source": "neg"}}
{"text": "\"There is the case where the monks accuse a monk of an offense. He, being accused of an offense by the monks, denies the offense, [saying,] 'I don't remember. I don't remember.' He, I tell you, is just like the unruly horse who — when goaded, ordered, and told 'Go!' by the charioteer — backs up and pushes the chariot back with its hindquarters. Some unruly men are like this. This is the first fault in a man.", "spans": [], "meta": {"identifier": "an08.014.than.html", "title": "Khalunga Sutta", "source": "neg"}}
{"text": "\"From the origination of name-&-form comes the origination of the six sense media. From the cessation of name-&-form comes the cessation of the six sense media. And the way of practice leading to the cessation of the six sense media is just this very noble eightfold path: right view, right resolve, right speech, right action, right livelihood, right effort, right mindfulness, right concentration.", "spans": [], "meta": {"identifier": "mn.009.than.html", "title": "Sammaditthi Sutta", "source": "neg"}}
{"text": "\"Furthermore, there is the case where the mind of a monk, when attending to harmfulness, doesn't leap up at harmfulness, doesn't grow confident, steadfast, or released in harmfulness. But when attending to harmlessness, his mind leaps up at harmlessness, grows confident, steadfast, & released in harmlessness. When his mind is rightly-gone, rightly developed, has rightly risen above, gained release, and become disjoined from harmfulness, then whatever fermentations, torments, & fevers there are that arise in dependence on harmfulness, he is released from them. He does not experience that feeling. This is expounded as the escape from harmfulness.", "spans": [], "meta": {"identifier": "an05.200.than.html", "title": "Nissaraniya Sutta", "source": "neg"}}
{"text": "\"With the complete transcending of the dimension of the infinitude of consciousness, [perceiving,] 'There is nothing,' he enters & remains in the dimension of nothingness. Gratified, he allays his itch.", "spans": [], "meta": {"identifier": "an09.040.than.html", "title": "Naga Sutta", "source": "neg"}}
{"text": "\"Mental formations, O monks, are not-self; if mental formations were self, then mental formations would not lead to affliction and it should obtain regarding mental formations: 'May my perception be thus, may my mental formations not be thus'; and indeed, O monks, since mental formations are not-self, therefore, mental formations lead to affliction and it does not obtain regarding mental formations: 'May my mental formations be thus, may my mental formations not be thus.'", "spans": [], "meta": {"identifier": "sn22.059.mend.html", "title": "Anatta-lakkhana Sutta", "source": "neg"}}
{"text": "\" Just as when a peak-roofed house is poorly roofed: The peak of the roof is unprotected, the roof beams are unprotected, the walls are unprotected. The peak of the roof... the roof beams... the walls get soggy. The peak of the roof... the roof beams... the walls then rot.", "spans": [], "meta": {"identifier": "an03.105.than.html", "title": "Kuta Sutta", "source": "neg"}}
{"text": "\"And how, monks, does one not yearn for the future? He thinks: 'I may have such form in the future' but brings no delight to bear on it. He thinks: 'I may have such feeling... such perception... such formations...'... He thinks: 'I may have such consciousness in the future' but brings no delight to bear on it. That is how, monks, one does not yearn for the future.", "spans": [], "meta": {"identifier": "mn.131.nana.html", "title": "Bhaddekaratta Sutta", "source": "neg"}}
{"text": "\"In the Dhamma thus well-proclaimed by me — clear, open, evident, stripped of rags — those monks who have abandoned the three fetters, are all stream-winners, steadfast, never again destined for states of woe, headed for self-awakening. This is how the Dhamma well-proclaimed by me is clear, open, evident, stripped of rags.", "spans": [], "meta": {"identifier": "mn.022.than.html", "title": "Alagaddupama Sutta", "source": "neg"}}
{"text": "\" Now suppose that in the autumn — when it's raining in fat, heavy drops — a water bubble were to appear & disappear on the water, and a man with good eyesight were to see it, observe it, & appropriately examine it. To him — seeing it, observing it, & appropriately examining it — it would appear empty, void, without substance: for what substance would there be in a water bubble? In the same way, a monk sees, observes, & appropriately examines any feeling that is past, future, or present; internal or external; blatant or subtle; common or sublime; far or near. To him — seeing it, observing it, & appropriately examining it — it would appear empty, void, without substance: for what substance would there be in feeling?", "spans": [], "meta": {"identifier": "sn22.095.than.html", "title": "Phena Sutta", "source": "neg"}}
{"text": "\"And how is a monk one with a sense of time? There is the case where a monk knows the time: 'This is the time for recitation; this, the time for questioning; this, the time for making an effort [in meditation]; this, the time for seclusion.' If he didn't know the time — 'This is the time for recitation; this, the time for questioning; this, the time for making an effort; this, the time for seclusion' — he wouldn't be said to be one with a sense of time. So it's because he does know the time — 'This is the time for recitation; this, the time for questioning; this, the time for making an effort; this, the time for seclusion' — that he is said to be one with a sense of time. This is one with a sense of Dhamma, a sense of meaning, a sense of himself, a sense of moderation, & a sense of time.", "spans": [], "meta": {"identifier": "an07.064.than.html", "title": "Dhammaññu Sutta", "source": "neg"}}
{"text": "\"I had three palaces : one for the cold season, one for the hot season, one for the rainy season. During the four months of the rainy season I was entertained in the rainy-season palace by minstrels without a single man among them, and I did not once come down from the palace. Whereas the servants, workers, & retainers in other people's homes are fed meals of lentil soup & broken rice, in my father's home the servants, workers, & retainers were fed wheat, rice, and meat.", "spans": [], "meta": {"identifier": "an03.038.than.html", "title": "Sukhamala Sutta", "source": "neg"}}
{"text": "\"And which is painful practice with slow intuition? There is the case where a monk remains focused on unattractiveness with regard to the body, percipient of loathsomeness with regard to food, percipient of non-delight with regard to the entire world, (and) focused on inconstancy with regard to all fabrications. The perception of death is well established within him. He dwells in dependence on the five strengths of a learner — strength of conviction, strength of conscience, strength of concern, strength of persistence, & strength of discernment — but these five faculties of his — the faculty of conviction, the faculty of persistence, the faculty of mindfulness, the faculty of concentration, the faculty of discernment — appear weakly. Because of their weakness, he attains only slowly the immediacy [1] that leads to the ending of the effluents. This is called painful practice with slow intuition.", "spans": [], "meta": {"identifier": "an04.163.than.html", "title": "Asubha Sutta", "source": "neg"}}
{"text": "\"And furthermore, with the fading of rapture, he remains equanimous, mindful, & alert, and senses pleasure with the body. He enters & remains in the third jhana, of which the Noble Ones declare, 'Equanimous & mindful, he has a pleasant abiding.' He permeates and pervades, suffuses and fills this very body with the pleasure divested of rapture, so that there is nothing of his entire body unpervaded with pleasure divested of rapture.", "spans": [], "meta": {"identifier": "an05.028.than.html", "title": "Samadhanga Sutta", "source": "neg"}}
{"text": "\"Then, with the fading of rapture, he remains equanimous, mindful, & alert, and senses pleasure with the body. He enters & remains in the third jhana, of which the Noble Ones declare, 'Equanimous & mindful, he has a pleasant abiding.'", "spans": [], "meta": {"identifier": "mn.027.than.html", "title": "Cula-hatthipadopama Sutta", "source": "neg"}}
{"text": "\"Further, a disciple of the noble ones considers this: 'I am not the only one subject to illness, who has not gone beyond illness.'... 'I am not the only one subject to death, who has not gone beyond death.'... 'I am not the only one who will grow different, separate from all that is dear and appealing to me.'...", "spans": [], "meta": {"identifier": "an05.057.than.html", "title": "Upajjhatthana Sutta", "source": "neg"}}
{"text": "\"There is the case, monk, where a monk has heard, 'All things are unworthy of attachment.' Having heard that all things are unworthy of attachment, he directly knows every thing. Directly knowing every thing, he comprehends every thing. Comprehending every thing, he sees all themes [2] as something separate. [3]", "spans": [], "meta": {"identifier": "sn35.080.than.html", "title": "Avijja Sutta", "source": "neg"}}
{"text": "\"And what are fabrications? These six classes of intention — intention with regard to form, intention with regard to sound, intention with regard to smell, intention with regard to taste, intention with regard to tactile sensation, intention with regard to ideas: these are called fabrications. From the origination of contact comes the origination of fabrications. From the cessation of contact comes the cessation of fabrications. And just this noble eightfold path is the path of practice leading to the cessation of fabrications...", "spans": [], "meta": {"identifier": "sn22.056.than.html", "title": "Parivatta Sutta", "source": "neg"}}
{"text": "\"Delight in sensuality does not obsess him. Delight in ill will does not obsess him. Delight in harmfulness does not obsess him. Delight in form does not obsess him. Delight in self-identity does not obsess him. From the lack of any obsession with sensuality, the lack of any obsession with ill will... to harmfulness... to form... to self-identity, he is called a monk without attachment. He has cut through craving, has turned away from the fetter, and by rightly breaking through conceit he has put an end to suffering & stress.", "spans": [], "meta": {"identifier": "an05.200.than.html", "title": "Nissaraniya Sutta", "source": "neg"}}
{"text": "\"He assumes (mental) fabrications to be the self, or the self as possessing fabrications, or fabrications as in the self, or the self as in fabrications. He is seized with the idea that 'I am fabrications' or 'Fabrications are mine.' As he is seized with these ideas, his fabrications change & alter, and he falls into sorrow, lamentation, pain, distress, & despair over their change & alteration.", "spans": [], "meta": {"identifier": "sn22.001.than.html", "title": "Nakulapita Sutta", "source": "neg"}}
{"text": "\"He finds gratification in that, finds it desirable and looks to it for his well-being; steady and resolute thereon, he abides much in it, and if he dies without losing it, he reappears among the gods of a High Divinity's retinue.", "spans": [], "meta": {"identifier": "an04.125.nymo.html", "title": "Metta Sutta", "source": "neg"}}
{"text": "\"In whatever monk or nun there arises desire, passion, aversion, delusion, or mental resistance with regard to sounds cognizable via the ear... aromas cognizable via the nose... flavors cognizable via the tongue... tactile sensations cognizable via the body... ideas cognizable via the intellect, he/she should hold the mind in check. [Thinking,] 'It's dangerous & dubious, that path, thorny & overgrown, a miserable path, a devious path, impenetrable. It's a path followed by people of no integrity, not a path followed by people of integrity. It's not worthy of you,' he/she should hold the mind in check with regard to ideas cognizable via the intellect.", "spans": [], "meta": {"identifier": "sn35.205.than.html", "title": "Vina Sutta", "source": "neg"}}
{"text": "\"Abandoning abusive speech, he abstains from abusive speech. He speaks words that are soothing to the ear, that are affectionate, that go to the heart, that are polite, appealing and pleasing to people at large.", "spans": [], "meta": {"identifier": "mn.027.than.html", "title": "Cula-hatthipadopama Sutta", "source": "neg"}}
{"text": "\"In the same way, monks, on any occasion when the mind is restless, that is the wrong time to develop analysis of qualities as a factor for awakening, persistence as a factor for awakening, rapture as a factor for awakening. Why is that? The restless mind is hard to still with those mental qualities.", "spans": [], "meta": {"identifier": "sn46.053.than.html", "title": "Aggi Sutta", "source": "neg"}}
{"text": "\"From the origination of craving comes the origination of clinging. From the cessation of craving comes the cessation of clinging. And the way of practice leading to the cessation of clinging is just this very noble eightfold path: right view, right resolve, right speech, right action, right livelihood, right effort, right mindfulness, right concentration.", "spans": [], "meta": {"identifier": "mn.009.than.html", "title": "Sammaditthi Sutta", "source": "neg"}}
{"text": "\"In which four? There is the case where a monk remains focused on the body in & of itself — ardent, alert, & mindful — subduing greed & distress with reference to the world. He remains focused on feelings... mind... mental qualities in & of themselves — ardent, alert, & mindful — subduing greed & distress with reference to the world.", "spans": [], "meta": {"identifier": "sn47.041.than.html", "title": "Amata Sutta", "source": "neg"}}
{"text": "\"If a monk should wish: 'May I remain percipient of unloathsomeness in the presence of what is loathsome,' then he should attend carefully to this same concentration through mindfulness of in-&-out breathing.", "spans": [], "meta": {"identifier": "sn54.008.than.html", "title": "Dipa Sutta", "source": "neg"}}
{"text": "\"Monks, with the abandoning & destruction of the seven obsessions, the holy life is fulfilled. Which seven? The obsession of sensual passion, the obsession of resistance, the obsession of views, the obsession of uncertainty, the obsession of conceit, the obsession of passion for becoming, the obsession of ignorance. With the abandoning & destruction of these seven obsessions, the holy life is fulfilled.", "spans": [], "meta": {"identifier": "an07.012.than.html", "title": "Anusaya Sutta", "source": "neg"}}
{"text": "\"Then there is the warrior who — taking his sword & shield, strapping on his bow & quiver — goes down into the thick of battle. There in the battle he strives & makes effort. But while he is striving & making an effort, his opponents wound him. He gets carried out and taken to his relatives. But while he is being taken to his relatives, before he has reached them he dies along the way. Some warriors are like this. This is the second type of warrior who can be found existing in the world.", "spans": [], "meta": {"identifier": "an05.076.than.html", "title": "Yodhajiva Sutta", "source": "neg"}}
{"text": "\"For the purpose of concealing his bodily misconduct, he formulates evil desires: He desires, 'May they not know about me.' He resolves, 'May they not know about me.' He speaks, [thinking,] 'May they not know about me.' He makes an effort with his body, [thinking,] 'May they not know about me.' For the purpose of concealing his verbal misconduct... For the purpose of concealing his mental misconduct, he formulates evil desires: He desires, 'May they not know about me.' He resolves, 'May they not know about me.' He speaks, [thinking,] 'May they not know about me.' He makes an effort with his body, [thinking,] 'May they not know about me.' For him, I tell you, this is interest payment.", "spans": [], "meta": {"identifier": "an06.045.than.html", "title": "Ina Sutta", "source": "neg"}}
{"text": "\"Suppose that an archer or archer's apprentice were to practice on a straw man or mound of clay, so that after a while he would become able to shoot long distances, to fire accurate shots in rapid succession, and to pierce great masses. In the same way, there is the case where a monk... enters & remains in the dimension of the infinitude of space. He regards whatever phenomena there that are connected with feeling, perception, fabrications, & consciousness, as inconstant, stressful, a disease, a cancer, an arrow, painful, an affliction, alien, a disintegration, an emptiness, not-self. He turns his mind away from those phenomena, and having done so, inclines his mind to the property of deathlessness: 'This is peace, this is exquisite — the resolution of all fabrications; the relinquishment of all acquisitions; the ending of craving; dispassion; cessation; Unbinding.'", "spans": [], "meta": {"identifier": "an09.036.than.html", "title": "Jhana Sutta", "source": "neg"}}
{"text": "\"Lord, the water in the great ocean that had gone to extinction, to its total end, would be far greater. The two or three remaining drops of water would be next to nothing. They wouldn't be a hundredth, a thousandth, a one hundred-thousandth — the two or three remaining drops of water — when compared with the water in the great ocean that had gone to extinction, to its total end.\"", "spans": [], "meta": {"identifier": "sn13.008.than.html", "title": "Samudda Sutta", "source": "neg"}}
{"text": "\"Furthermore, the royal frontier fortress has a gate-keeper — wise, experienced, intelligent — to keep out those he doesn't know and to let in those he does. With this sixth requisite of a fortress it is well provided for the protection of those within and to ward off those without.", "spans": [], "meta": {"identifier": "an07.063.than.html", "title": "Nagara Sutta", "source": "neg"}}
{"text": "\"And how is one a person in training, someone following the way? There is the case where, when seeing a form with the eye, there arises in a monk what is agreeable, what is disagreeable, what is agreeable & disagreeable. He feels horrified, humiliated, & disgusted with the arisen agreeable thing... disagreeable thing... agreeable & disagreeable thing.", "spans": [], "meta": {"identifier": "mn.152.than.html", "title": "Indriya-bhavana Sutta", "source": "neg"}}
{"text": "\"In a person of right view, right resolve comes into being. In a person of right resolve, right speech. In a person of right speech, right action. In a person of right action, right livelihood. In a person of right livelihood, right effort. In a person of right effort, right mindfulness. In a person of right mindfulness, right concentration. In a person of right concentration, right knowledge. In a person of right knowledge, right release. [1]", "spans": [], "meta": {"identifier": "an10.103.than.html", "title": "Micchatta Sutta", "source": "neg"}}
{"text": "\"'Cessation of suffering, as a noble truth, is this.' Such was the vision... 'This cessation of suffering, as a noble truth, can be verified.' Such was the vision... 'This cessation of suffering, as a noble truth, has been verified.' Such was the vision... in regard to ideas not heard by me before.", "spans": [], "meta": {"identifier": "sn56.011.nymo.html", "title": "Dhammacakkappavattana Sutta", "source": "neg"}}
{"text": "\"What do you think — whatever there is that arises in dependence on contact at the eye as a mode of feeling, a mode of perception, a mode of fabrication, or a mode of consciousness: [1] Is it constant or inconstant?\"", "spans": [], "meta": {"identifier": "mn.147.than.html", "title": "Cula-Rahulovada Sutta", "source": "neg"}}
{"text": "\"There is the case where a monk is wholly accomplished in virtue, moderately accomplished in concentration, and moderately accomplished in discernment. With reference to the lesser and minor training rules, he falls into offenses and rehabilitates himself. Why is that? Because I have not declared that to be a disqualification in these circumstances. But as for the training rules that are basic to the holy life and proper to the holy life, he is one of permanent virtue, one of steadfast virtue. Having undertaken them, he trains in reference to the training rules.", "spans": [], "meta": {"identifier": "an03.086.than.html", "title": "Sekhin Sutta", "source": "neg"}}
{"text": "\"What do you think, monks — Is consciousness constant or inconstant?\" \"Inconstant, lord.\" \"And is that which is inconstant easeful or stressful?\" \"Stressful, lord.\" \"And is it fitting to regard what is inconstant, stressful, subject to change as: 'This is mine. This is my self. This is what I am'?\"", "spans": [], "meta": {"identifier": "sn22.079.than.html", "title": "Khajjaniya Sutta", "source": "neg"}}
{"text": "\"There is the case of a warrior who — taking his sword & shield, strapping on his bow & quiver — goes down into the thick of battle. There in the battle he strives & makes effort. But while he is striving & making an effort, his opponents strike him down and finish him off. Some warriors are like this. This is the first type of warrior who can be found existing in the world.", "spans": [], "meta": {"identifier": "an05.076.than.html", "title": "Yodhajiva Sutta", "source": "neg"}}
{"text": "\"In giving a meal, the donor gives five things to the recipient. Which five? He/she gives life, beauty, happiness, strength, & quick-wittedness. Having given life, he/she has a share in long life, either human or divine. Having given beauty, he/she has a share in beauty, either human or divine. Having given happiness, he/she has a share in happiness, either human or divine. Having given strength, he/she has a share in strength, either human or divine. Having given quick-wittedness, he/she has a share in quick-wittedness, either human or divine. In giving a meal, the donor gives these five things to the recipient.\"", "spans": [], "meta": {"identifier": "an05.037.than.html", "title": "Bhojana Sutta", "source": "neg"}}
{"text": "\"There is the case where one individual, through discussion with another, knows this: 'From the way this person rises to an issue, from the way he applies [his reasoning], from the way he addresses a question, he is dull, not discerning. Why is that? He does not make statements that are deep, tranquil, refined, beyond the scope of conjecture, subtle, to-be-experienced by the wise. He cannot declare the meaning, teach it, describe it, set it forth, reveal it, explain it, or make it plain. He is dull, not discerning.' Just as if a man with good eyesight standing on the shore of a body of water were to see a small fish rise. The thought would occur to him, 'From the rise of this fish, from the break of its ripples, from its speed, it is a small fish, not a large one.' In the same way, one individual, in discussion with another, knows this: 'From the way this person rises to an issue, from the way he applies [his reasoning], from the way he addresses a question... he is dull, not discerning.'", "spans": [], "meta": {"identifier": "an04.192.than.html", "title": "Thana Sutta", "source": "neg"}}
{"text": "\"Thus, monks, I have reckoned the life of a person living for 100 years: I have reckoned the life span, reckoned the seasons, reckoned the years, [2] reckoned the months, reckoned the fortnights, reckoned the nights, reckoned the days, reckoned the meals, reckoned the obstacles to eating. Whatever a teacher should do — seeking the welfare of his disciples, out of sympathy for them — that have I done for you. Over there are the roots of trees; over there, empty dwellings. Practice jhana, monks. Don't be heedless. Don't later fall into regret. This is our message to you all.\"", "spans": [], "meta": {"identifier": "an07.070.than.html", "title": "Arakenanusasani Sutta", "source": "neg"}}
{"text": "\"One who, after pondering with a modicum of discernment, has accepted that these phenomena are this way is called a Dhamma-follower: one who has entered the orderliness of rightness, entered the plane of people of integrity, transcended the plane of the run-of-the-mill. He is incapable of doing any deed by which he might be reborn in hell, in the animal womb, or in the realm of hungry shades. He is incapable of passing away until he has realized the fruit of stream-entry.", "spans": [], "meta": {"identifier": "sn25.006.than.html", "title": "Sañña Sutta", "source": "neg"}}
{"text": "When the night had passed, the senior monks put on their robes in the early morning and — taking their bowls & outer robes — went to Citta's residence. There they sat down on the appointed seats. Citta the householder went to them and, having bowed down to them, sat to one side. As he was sitting there, he said to the most senior monk:", "spans": [], "meta": {"identifier": "sn41.003.than.html", "title": "Isidatta Sutta", "source": "neg"}}
{"text": "\"Then train in reference to those three trainings: the training in heightened virtue, the training in heightened mind, the training in heightened discernment. As you train in heightened virtue, heightened mind, & heightened discernment, your passion, aversion, & delusion — when trained in heightened virtue, heightened mind, & heightened discernment — will be abandoned. You — with the abandoning of passion, the abandoning of aversion, the abandoning of delusion — will not do anything unskillful or engage in any evil.\"", "spans": [], "meta": {"identifier": "an03.083.than.html", "title": "Vajjiputta Sutta", "source": "neg"}}
{"text": "\"A mother can't get (her wish) with regard to her child who is growing ill, 'I am growing ill, but may my child not grow ill.' A child can't get (its wish) with regard to its mother who is growing ill, 'I am growing ill, but may my mother not grow ill.'", "spans": [], "meta": {"identifier": "an03.062.than.html", "title": "Bhaya Sutta", "source": "neg"}}
{"text": "\"Whatever pleasure & joy arises dependent on consciousness: that is the allure of consciousness. The fact that consciousness is inconstant, stressful, subject to change: that is the drawback of consciousness. The subduing of desire & passion, the abandoning of desire & passion for consciousness: that is the escape from consciousness.\"", "spans": [], "meta": {"identifier": "mn.109.than.html", "title": "Maha-punnama Sutta", "source": "neg"}}
{"text": "“And which, monks, is the release from the bondage of the bond of sensual pleasure? Here, monks, someone understands as it really is the arising, the subsiding, the sweetness, the wretchedness, and the leaving behind of sensual pleasures. For one who knows as it really is the arising, the subsiding, the sweetness, the wretchedness, and the leaving behind of sensual pleasures; who, with respect to sensual pleasure, is not obsessed with passion for sensual pleasure, delight in sensual pleasure, affection for sensual pleasure, intoxication with sensual pleasure, thirst for sensual pleasure, fever for sensual pleasure, attachment to sensual pleasure, craving for sensual pleasure: this, monks, is called ‘the release from bondage of the bond of sensual pleasure’. Thus the release from bondage of the bond of sensual pleasure.", "spans": [], "meta": {"identifier": "an04.010.niza.html", "title": "Yoga Sutta", "source": "neg"}}
{"text": "\" Just as when an ocean-going ship, rigged with masts & stays, after six months on the water, is left on shore for the winter: Its stays, weathered by the heat & wind, moistened by the clouds of the rainy season, easily wither & rot away. In the same way, when a monk dwells devoting himself to development, his fetters easily wither & rot away.\"", "spans": [], "meta": {"identifier": "sn22.101.than.html", "title": "Nava Sutta", "source": "neg"}}
{"text": "\"Monks, there is the person who is engaged in promoting the good of another but not in promoting his own good. Of these two individuals the latter is superior. Monks, there is the person who is engaged in promoting his own good but not in promoting the good of another. Of these three individuals he is superior. Monks, there is the person who is engaged in promoting his own good and also in promoting another's good. Of these four individuals he is the foremost, the chief, the principal, the best and the supreme.", "spans": [], "meta": {"identifier": "an04.095.budd.html", "title": "Chavalata Sutta", "source": "neg"}}
{"text": "\"Monks, I have made this simile to convey a meaning. Here the meaning is this: 'The four vipers of utmost heat & horrible venom' stands for the four great existents: the earth property, the liquid property, the fire-property, & the wind property. 'The five enemy executioners' stands for the five clinging-aggregates: the form clinging-aggregate, the feeling clinging-aggregate, the perception clinging-aggregate, the fabrications clinging-aggregate, the consciousness clinging-aggregate. 'The sixth fellow-traveling executioner with upraised sword' stands for passion & delight.", "spans": [], "meta": {"identifier": "sn35.197.than.html", "title": "Asivisa Sutta", "source": "neg"}}
{"text": "\"In the Dhamma thus well-proclaimed by me — clear, open, evident, stripped of rags — those monks who are Dhamma-followers and conviction-followers [18] are all headed for self-awakening. This is how the Dhamma well-proclaimed by me is clear, open, evident, stripped of rags.", "spans": [], "meta": {"identifier": "mn.022.than.html", "title": "Alagaddupama Sutta", "source": "neg"}}
{"text": "When the enlightenment-factor of energy is present, he knows, \"The enlightenment-factor of energy is in me\"; when the enlightenment-factor of energy is absent, he knows, \"The enlightenment-factor of energy is not in me\"; and he knows how the arising of the non-arisen enlightenment-factor of energy comes to be, and how perfection in the development of the arisen enlightenment-factor of energy comes to be.", "spans": [], "meta": {"identifier": "mn.010.nysa.html", "title": "Satipatthana Sutta", "source": "neg"}}
{"text": "\"Sisters, there are these seven factors for awakening [2] through whose development & pursuit a monk enters & remains in the fermentation-free awareness-release & discernment-release, [3] having directly known & realized them for himself right in the here & now. Which seven? There is the case where a monk develops mindfulness as a factor for awakening dependent on seclusion, dependent on dispassion, dependent on cessation, resulting in relinquishment. He develops analysis of qualities as a factor for awakening ... persistence as a factor for awakening ... rapture as a factor for awakening ... serenity as a factor for awakening ... concentration as a factor for awakening ... equanimity as a factor for awakening dependent on seclusion, dependent on dispassion, dependent on cessation, resulting in relinquishment. These are the seven factors for awakening through whose development & pursuit a monk enters & remains in the fermentation-free awareness-release & discernment-release, having directly known & realized them for himself right in the here & now.\"", "spans": [], "meta": {"identifier": "mn.146.than.html", "title": "Nandakovada Sutta", "source": "neg"}}
{"text": "\"He discerns, as it actually is present, that 'The eye is inconstant'... 'Forms are inconstant'... 'Eye-consciousness is inconstant'... 'Eye-contact is inconstant'... 'Whatever arises in dependence on eye-contact, experienced either as pleasure, as pain, or as neither-pleasure-nor-pain, that too is inconstant.'", "spans": [], "meta": {"identifier": "sn35.099.than.html", "title": "Samadhi Sutta", "source": "neg"}}
{"text": "\" Just as when boys or girls are playing with little sand castles: [4] as long as they are not free from passion, desire, love, thirst, fever, & craving for those little sand castles, that's how long they have fun with those sand castles, enjoy them, treasure them, feel possessive of them. But when they become free from passion, desire, love, thirst, fever, & craving for those little sand castles, then they smash them, scatter them, demolish them with their hands or feet and make them unfit for play.", "spans": [], "meta": {"identifier": "sn23.002.than.html", "title": "Satta Sutta", "source": "neg"}}
{"text": "\"Unflagging persistence was aroused in me, and unmuddled mindfulness established. My body was calm & unaroused, my mind concentrated & single. Quite withdrawn from sensuality, withdrawn from unskillful mental qualities, I entered & remained in the first jhana: rapture & pleasure born from withdrawal, accompanied by directed thought & evaluation. With the stilling of directed thoughts & evaluations, I entered & remained in the second jhana: rapture & pleasure born of composure, unification of awareness free from directed thought & evaluation — internal assurance. With the fading of rapture I remained in equanimity, mindful & alert, and physically sensitive of pleasure. I entered & remained in the third jhana, of which the Noble Ones declare, 'Equanimous & mindful, he has a pleasant abiding.' With the abandoning of pleasure & pain — as with the earlier disappearance of elation & distress — I entered & remained in the fourth jhana: purity of equanimity & mindfulness, neither pleasure nor pain.", "spans": [], "meta": {"identifier": "mn.019.than.html", "title": "Dvedhavitakka Sutta", "source": "neg"}}
{"text": "\"And which are the three factors of the recipients? There is the case where the recipients are free of passion or are practicing for the subduing of passion; free of aversion or practicing for the subduing of aversion; and free of delusion or practicing for the subduing of delusion. These are the three factors of the recipients.", "spans": [], "meta": {"identifier": "an06.037.than.html", "title": "Dana Sutta", "source": "neg"}}
{"text": "\"And what is the right livelihood that is noble, without effluents, transcendent, a factor of the path? The abstaining, desisting, abstinence, avoidance of wrong livelihood in one developing the noble path whose mind is noble, whose mind is without effluents, who is fully possessed of the noble path. This is the right livelihood that is noble, without effluents, transcendent, a factor of the path. \"One tries to abandon wrong livelihood & to enter into right livelihood: This is one's right effort. One is mindful to abandon wrong livelihood & to enter & remain in right livelihood: This is one's right mindfulness. Thus these three qualities — right view, right effort, & right mindfulness — run & circle around right livelihood.", "spans": [], "meta": {"identifier": "mn.117.than.html", "title": "Maha-cattarisaka Sutta", "source": "neg"}}
{"text": "\"But a person of integrity notices, 'It's not through being a wilderness dweller that the quality of greed goes to its end; it's not through being a wilderness dweller that the quality of aversion... the quality of delusion goes to its end. Even though one is not a wilderness dweller, if — practicing the Dhamma in line with the Dhamma, practicing masterfully — he is one who follows the Dhamma, he is to be honored for that, praised for that.' So, giving priority just to the practice, he neither exalts himself for being a wilderness dweller nor disparages others. This is the quality of a person of integrity.", "spans": [], "meta": {"identifier": "mn.113.than.html", "title": "Sappurisa Sutta", "source": "neg"}}
{"text": "\"And these two, husband and wife, killed their only son, so dearly beloved by them, prepared dried and roasted meat, and, eating their son's flesh, crossed in that way the remaining part of the desert. And while eating their son's flesh, they were beating their breast and crying: 'Where are you, our only and beloved son? Where are you, our only and beloved son?'", "spans": [], "meta": {"identifier": "sn12.063.nypo.html", "title": "Puttamansa Sutta", "source": "neg"}}
{"text": "\"It's through dealing with a person that his purity may be known, and then only after a long period, not a short period; by one who is attentive, not by one who is inattentive; by one who is discerning, not by one who is not discerning.", "spans": [], "meta": {"identifier": "an04.192.than.html", "title": "Thana Sutta", "source": "neg"}}
{"text": "\"And what is meant by admirable friendship? There is the case where a lay person, in whatever town or village he may dwell, spends time with householders or householders' sons, young or old, who are advanced in virtue. He talks with them, engages them in discussions. He emulates consummate conviction in those who are consummate in conviction, consummate virtue in those who are consummate in virtue, consummate generosity in those who are consummate in generosity, and consummate discernment in those who are consummate in discernment. This is called admirable friendship.", "spans": [], "meta": {"identifier": "an08.054.than.html", "title": "Dighajanu (Vyagghapajja) Sutta", "source": "neg"}}
{"text": "\"Furthermore, there is the case where a monk, with the abandoning of pleasure & stress — as with the earlier disappearance of elation & distress — enters & remains in the fourth jhana: purity of equanimity & mindfulness, neither-pleasure-nor-pain. If, as he remains there, he is beset with attention to perceptions dealing with equanimity, that is an affliction for him...", "spans": [], "meta": {"identifier": "an09.034.than.html", "title": "Nibbana Sutta", "source": "neg"}}
{"text": "\"What do you think, great king: Suppose a trustworthy, reliable man of yours were to come to you from the east. On arrival he would say to you, 'May it please your majesty to know, I have come from the east. There I saw a great country, powerful & prosperous, populous & crowded with people. Plenty are the elephant troops there, plenty the cavalry troops, chariot troops, & infantry troops. Plenty is the ivory-work there, plenty the gold & silver, both worked & unworked. Plenty are the women for the taking. It is possible, with the forces you now have, to conquer it. Conquer it, great king!' What would you do?\"", "spans": [], "meta": {"identifier": "mn.082.than.html", "title": "Ratthapala Sutta", "source": "neg"}}
{"text": "Thus he lives contemplating the body in the body internally, or he lives contemplating the body in the body externally, or he lives contemplating the body in the body internally and externally. He lives contemplating origination factors in the body, or he lives contemplating dissolution factors in the body, or he lives contemplating origination-and-dissolution factors in the body. [10] Or his mindfulness is established with the thought: \"The body exists,\" to the extent necessary just for knowledge and mindfulness, and he lives detached, and clings to nothing in the world. Thus also, monks, a monk lives contemplating the body in the body.", "spans": [], "meta": {"identifier": "mn.010.nysa.html", "title": "Satipatthana Sutta", "source": "neg"}}
{"text": "\"Then, householder, you should train yourself in this way: 'I won't cling to this world; my consciousness will not be dependent on this world... I won't cling to the world beyond; my consciousness will not be dependent on the world beyond.' That's how you should train yourself.", "spans": [], "meta": {"identifier": "mn.143.than.html", "title": "Anathapindikovada Sutta", "source": "neg"}}
{"text": "\"From the origination of feeling comes the origination of craving. From the cessation of feeling comes the cessation of craving. And the way of practice leading to the cessation of craving is just this very noble eightfold path: right view, right resolve, right speech, right action, right livelihood, right effort, right mindfulness, right concentration.", "spans": [], "meta": {"identifier": "mn.009.than.html", "title": "Sammaditthi Sutta", "source": "neg"}}
{"text": "\"And how is a monk resilient to aromas? There is the case where a monk, on smelling an aroma with the nose, feels no passion for an aroma that incites passion and can center his mind. This is how a monk is resilient to aromas.", "spans": [], "meta": {"identifier": "an05.139.than.html", "title": "Akkhama Sutta", "source": "neg"}}
{"text": "\"Bhikkhus! In this Teaching, the bhikkhu, reflecting properly, can endure cold, heat, hunger, thirst, gadflies, mosquitoes, wind, heat of the sun, snakes, scorpions and lice. He can endure ill-spoken and unwholesome words. He has the nature of being able to endure severe, cruel, excruciatingly sharp, disagreeable, unpleasant, deadly and painful sensations which arise in the body.", "spans": [], "meta": {"identifier": "mn.002.bpit.html", "title": "Sabbasava Sutta", "source": "neg"}}
{"text": "\"Furthermore, an enemy wishes of an enemy, 'O, may this person not profit!' Why is that? An enemy is not pleased with an enemy's profits. Now, when a person is angry — overcome with anger, oppressed with anger — then even when he suffers a loss, he thinks, 'I've gained a profit'; and even when he gains a profit, he thinks, 'I've suffered a loss.' When he has grabbed hold of these ideas that work in mutual opposition [to the truth], they lead to his long-term suffering & loss, all because he is overcome with anger. This is the third thing pleasing to an enemy, bringing about an enemy's aim, that comes to a man or woman who is angry.", "spans": [], "meta": {"identifier": "an07.060.than.html", "title": "Kodhana Sutta", "source": "neg"}}
{"text": "\"Because this empty space, most venerable sir, is formless and invisible. He cannot possibly draw a picture or make a painting appear on this empty space. On the contrary, that person will only reap weariness and frustration.\"", "spans": [], "meta": {"identifier": "mn.021x.budd.html", "title": "Kakacupama Sutta", "source": "neg"}}
{"text": "\"'This Dhamma is for one whose mindfulness is established, not for one whose mindfulness is confused.' Thus was it said. With reference to what was it said? There is the case where a monk is mindful, highly meticulous, remembering & able to call to mind even things that were done & said long ago. 'This Dhamma is for one whose mindfulness is established, not for one whose mindfulness is confused.' Thus was it said. And with reference to this was it said.", "spans": [], "meta": {"identifier": "an08.030.than.html", "title": "Anuruddha Sutta", "source": "neg"}}
{"text": "\" 'The six classes of consciousness should be known': thus was it said. And in reference to what was it said? Eye-consciousness, ear-consciousness, nose-consciousness, tongue-consciousness, body-consciousness, intellect-consciousness. 'The six classes of consciousness should be known': thus was it said. And in reference to thus was it said.", "spans": [], "meta": {"identifier": "mn.137.than.html", "title": "Salayatana-vibhanga Sutta", "source": "neg"}}
{"text": "[6] \" There are these four modes of practice . Which four? Painful practice with slow intuition, painful practice with quick intuition, pleasant practice with slow intuition, and pleasant practice with quick intuition. These are the four modes of practice. Now, of these four modes of practice, this is supreme: pleasant practice with quick intuition. And there are beings whose practice is like this. Yet even in the beings whose practice is like this there is still aberration, there is change. Seeing this, the instructed disciple of the noble ones grows disenchanted with that. Being disenchanted with that, he becomes dispassionate toward what is supreme, and even more so toward what is inferior.", "spans": [], "meta": {"identifier": "an10.029.than.html", "title": "Kosala Sutta", "source": "neg"}}
{"text": "\"Or, brahman, it's as if a man in need of heartwood, seeking heartwood, wandering in search of heartwood — passing over the heartwood of a great standing tree possessed of heartwood — cutting away the sapwood, were to go off carrying it, thinking, 'heartwood.' A man with good eyesight, seeing him, would say, 'Ah, how this good man didn't know heartwood, didn't know sapwood, didn't know inner bark, didn't know outer bark, didn't know twigs & leaves! That's why he, in need of heartwood, seeking heartwood, wandering in search of heartwood — passing over the heartwood of a great standing tree possessed of heartwood — cutting away the sapwood, went off carrying it, thinking, \"heartwood.\" Whatever heartwood-business he had with heartwood, his purpose won't be served.'", "spans": [], "meta": {"identifier": "mn.030.than.html", "title": "Cula Saropama Sutta", "source": "neg"}}
{"text": "\"Furthermore, the disciple of the noble ones is discerning, endowed with discernment of arising & passing away — noble, penetrating, leading to the right ending of stress. This is the fourth bonanza of merit, bonanza of skillfulness, nourishment of bliss.", "spans": [], "meta": {"identifier": "sn55.033.than.html", "title": "Abhisanda Sutta", "source": "neg"}}
{"text": "\"So he follows along and sees in the elephant forest a large elephant footprint, long in extent and broad in width, with some scratch marks and tusk slashes high up and some broken-off branches. And he sees that bull elephant at the foot of the tree or in an open clearing, walking, standing, sitting, or lying down. He comes to the conclusion, 'That's the big bull elephant.'", "spans": [], "meta": {"identifier": "mn.027.than.html", "title": "Cula-hatthipadopama Sutta", "source": "neg"}}
{"text": "\"Even so, monks, whatever isn't yours: Let go of it. Your letting go of it will be for your long-term welfare & happiness. And what isn't yours? Form isn't yours... Feeling isn't yours... Perception... Thought fabrications... Consciousness isn't yours: Let go of it. Your letting go of it will be for your long-term welfare & happiness.", "spans": [], "meta": {"identifier": "mn.022.than.html", "title": "Alagaddupama Sutta", "source": "neg"}}
{"text": "\"And how is a monk calmed in his bodily fabrication? [4] There is the case where a monk, with the abandoning of pleasure & pain — as with the earlier disappearance of elation & distress — enters & remains in the fourth jhana: purity of equanimity & mindfulness, neither pleasure nor pain. This is how a monk is calmed in his bodily fabrication.", "spans": [], "meta": {"identifier": "an10.020.than.html", "title": "Ariyavasa Sutta", "source": "neg"}}
{"text": "\"Furthermore, the royal frontier fortress has ramparts: high & thick & completely covered with plaster. With this seventh requisite of a fortress it is well provided for the protection of those within and to ward off those without.", "spans": [], "meta": {"identifier": "an07.063.than.html", "title": "Nagara Sutta", "source": "neg"}}
{"text": "\"There is the case where a monk — quite secluded from sensuality, secluded from unskillful qualities — enters & remains in the first jhāna: rapture & pleasure born of seclusion, accompanied by directed thought & evaluation. This is a quality higher & more sublime than knowledge & vision. [2]", "spans": [], "meta": {"identifier": "mn.030.than.html", "title": "Cula Saropama Sutta", "source": "neg"}}
{"text": "\"Seeing thus, the well-instructed disciple of the noble ones grows disenchanted with form, disenchanted with feeling, disenchanted with perception, disenchanted with fabrications, disenchanted with consciousness. Disenchanted, he becomes dispassionate. Through dispassion, he is fully released. With full release, there is the knowledge, 'Fully released.' He discerns that 'Birth is ended, the holy life fulfilled, the task done. There is nothing further for this world.'\"", "spans": [], "meta": {"identifier": "sn22.100.than.html", "title": "Gaddula Sutta", "source": "neg"}}
{"text": "12 . \"But here some woman or man is not envious, he does not envy, begrudge or harbor envy about others' gain, honor, veneration, respect, salutations and offerings. Due to having performed and completed such kammas, on the dissolution of the body, after death, he reappears in a happy destination... If instead he comes to the human state, he is influential wherever he is reborn. This is the way that leads to influence, that is to say, not to be envious, not to envy, begrudge or harbor envy about others' gain, honor, veneration, respect, salutations and offerings.", "spans": [], "meta": {"identifier": "mn.135.nymo.html", "title": "Cula-kammavibhanga Sutta", "source": "neg"}}
{"text": "\"Bhikkhus! In one who considers attentively certain factors [which should be considered], there does not arise the defilement of sense-pleasure that has not yet arisen, and the defilement of sense-pleasure also that has already arisen is removed; there does not arise the defilement of hankering after better existence that has not yet arisen, and the defilement of hankering after better existence also that has already arisen is removed; there does not arise the defilement of ignorance that has not yet arisen, and the defilement of ignorance also that has already arisen is removed. These are the factors which are considered attentively [by the ariya disciple] as they should be considered.", "spans": [], "meta": {"identifier": "mn.002.bpit.html", "title": "Sabbasava Sutta", "source": "neg"}}
{"text": "(b) \"Having a single perception of form internally, one sees forms externally as immeasurable, beautiful & ugly. Mastering them, one has the perception, 'I know; I see.' This is the second dimension of [mental] mastery.", "spans": [], "meta": {"identifier": "an10.029.than.html", "title": "Kosala Sutta", "source": "neg"}}
{"text": "Thus at that very moment, at that instant, the cry (that the Wheel of Truth is set in motion) spread as far as Brahma realm, the system of ten thousand worlds trembled and quaked and shook. A boundless sublime radiance surpassing the effulgence (power) of devas appeared in the world.", "spans": [], "meta": {"identifier": "sn56.011.piya.html", "title": "Dhammacakkappavattana Sutta", "source": "neg"}}
{"text": "\"And what is it that he neither pulls in nor discards, but stands having discarded it? He neither pulls in nor discards form, but stands having discarded it. He neither pulls in nor discards feeling... perception... fabrications... consciousness, but stands having discarded it.", "spans": [], "meta": {"identifier": "sn22.079.than.html", "title": "Khajjaniya Sutta", "source": "neg"}}
{"text": "\"There are some contemplatives and brahmans who consent to gold & silver, who don't refrain from accepting gold & silver. This is the third obscuration of contemplatives and brahmans, obscured by which some contemplatives and brahmans don't glow, don't shine, don't dazzle.", "spans": [], "meta": {"identifier": "an04.050.than.html", "title": "Upakkilesa Sutta", "source": "neg"}}
{"text": "\"And what is form? The four great existents [1] and the form derived from them: this is called form. From the origination of nutriment comes the origination of form. From the cessation of nutriment comes the cessation of form. And just this noble eightfold path is the path of practice leading to the cessation of form, i.e., right view, right resolve, right speech, right action, right livelihood, right effort, right mindfulness, right concentration.", "spans": [], "meta": {"identifier": "sn22.056.than.html", "title": "Parivatta Sutta", "source": "neg"}}
{"text": "\"Monks, I do not say that the attainment of gnosis is all at once. Rather, the attainment of gnosis is after gradual training, gradual action, gradual practice. And how is there the attainment of gnosis after gradual training, gradual action, gradual practice? There is the case where, when conviction has arisen, one visits [a teacher]. Having visited, one grows close. Having grown close, one lends ear. Having lent ear, one hears the Dhamma. Having heard the Dhamma, one remembers it. Remembering, one penetrates the meaning of the teachings. Penetrating the meaning, one comes to an agreement through pondering the teachings. There being an agreement through pondering the teachings, desire arises. When desire has arisen, one is willing. When one is willing, one contemplates. Having contemplated, one makes an exertion. Having made an exertion, one realizes with the body the ultimate truth and, having penetrated it with discernment, sees it. [10]", "spans": [], "meta": {"identifier": "mn.070.than.html", "title": "Kitagiri Sutta", "source": "neg"}}
{"text": "\"Monks, these four types of individuals are to be found existing in the world. Which four? The one who practices neither for his/her own benefit nor for that of others. The one who practices for the benefit of others but not for his/her own. The one who practices for his/her own benefit but not for that of others. The one who practices for his/her own benefit and for that of others.", "spans": [], "meta": {"identifier": "an04.095.than.html", "title": "Chavalata Sutta", "source": "neg"}}
{"text": "\"Form, O monks, is not-self; if form were self, then form would not lead to affliction and it should obtain regarding form: 'May my form be thus, may my form not be thus'; and indeed, O monks, since form is not-self, therefore form leads to affliction and it does not obtain regarding form: 'May my form be thus, may my form not be thus.'", "spans": [], "meta": {"identifier": "sn22.059.mend.html", "title": "Anatta-lakkhana Sutta", "source": "neg"}}
{"text": "\"A monk endowed with these eleven factors is capable of attaining growth, increase, & abundance in this Dhamma-Vinaya. Which eleven? There is the case where a monk is well-versed in forms, skilled in characteristics, picks out flies' eggs, dresses wounds, fumigates, knows fords, knows what it is to have drunk, knows the road, is skilled in pastures, doesn't milk dry, and shows extra respect for the elder monks with seniority, who have been ordained long, who are fathers & leaders of the Community.", "spans": [], "meta": {"identifier": "an11.018.than.html", "title": "Gopalaka Sutta", "source": "neg"}}
{"text": "\"In the same way, monks, others may use these five modes of speech when speaking to you — speech that is timely or untimely, true or false, gentle or harsh, with a good or a harmful motive, and with a loving heart or hostility. In this way, monks, you should train yourselves: 'Neither shall our minds be affected by this, nor for this matter shall we give vent to evil words, but we shall remain full of concern and pity, with a mind of love, and we shall not give in to hatred. On the contrary, we shall live projecting thoughts of universal love to that very person, making him as well as the whole world the object of our thoughts of universal love — thoughts that have grown great, exalted and measureless. We shall dwell radiating these thoughts which are void of hostility and ill will.' It is in this way, monks, that you should train yourselves.", "spans": [], "meta": {"identifier": "mn.021x.budd.html", "title": "Kakacupama Sutta", "source": "neg"}}
{"text": "\"Or, instead... he gives a gift with the thought, 'When this gift of mine is given, it makes the mind serene. Gratification & joy arise'... on the break-up of the body, after death, he reappears in the company of the devas who have power over the creations of others. Then, having exhausted that action, that power, that status, that sovereignty, he is a returner, coming back to this world.", "spans": [], "meta": {"identifier": "an07.049.than.html", "title": "Dana Sutta", "source": "neg"}}
{"text": "\"With his mind thus concentrated, purified, & bright, unblemished, free from defects, pliant, malleable, steady, & attained to imperturbability, he directs and inclines it to the knowledge of the ending of the mental fermentations. He discerns, as it has come to be, that 'This is stress... This is the origination of stress... This is the cessation of stress... This is the way leading to the cessation of stress... These are mental fermentations... This is the origination of fermentations... This is the cessation of fermentations... This is the way leading to the cessation of fermentations.' His heart, thus knowing, thus seeing, is released from the fermentation of sensuality, the fermentation of becoming, the fermentation of ignorance. With release, there is the knowledge, 'Released.' He discerns that 'Birth is ended, the holy life fulfilled, the task done. There is nothing further for this world.'", "spans": [], "meta": {"identifier": "an05.076.than.html", "title": "Yodhajiva Sutta", "source": "neg"}}
{"text": "\"This is the fourth future danger that is just enough, when considered, for a monk — heedful, ardent, and resolute — to live for the attaining of the as-yet-unattained, the reaching of the as-yet-unreached, the realization of the as-yet-unrealized.", "spans": [], "meta": {"identifier": "an05.078.than.html", "title": "Anagata-bhayani Sutta", "source": "neg"}}
{"text": "\"On cognizing an idea with the intellect, do not grasp at any theme or details by which — if you were to dwell without restraint over the faculty of the intellect — evil, unskillful qualities such as greed or distress might assail you. Practice for its restraint. Guard the faculty of the intellect. Secure your restraint with regard to the faculty of the intellect.", "spans": [], "meta": {"identifier": "sn35.199.than.html", "title": "Kumma Sutta", "source": "neg"}}
{"text": "\"And what is the fire property? The fire property may be either internal or external. What is the internal fire property? Anything internal, belonging to oneself, that's fire, fiery, & sustained: that by which [the body] is warmed, aged, & consumed with fever; and that by which what is eaten, drunk, chewed, & savored gets properly digested; or anything else internal, within oneself, that's fire, fiery, & sustained: This is called the internal fire property. Now both the internal fire property & the external fire property are simply fire property. And that should be seen as it actually is present with right discernment: 'This is not mine, this is not me, this is not my self.' When one sees it thus as it actually is present with right discernment, one becomes disenchanted with the fire property and makes the fire property fade from the mind.", "spans": [], "meta": {"identifier": "mn.062.than.html", "title": "Maha-Rahulovada Sutta", "source": "neg"}}
{"text": "\"That disciple of the noble ones — thus devoid of covetousness, devoid of ill will, unbewildered, alert, mindful — keeps pervading the first direction with an awareness imbued with equanimity, likewise the second, likewise the third, likewise the fourth. Thus above, below, & all around, everywhere, in its entirety, he keeps pervading the all-encompassing cosmos with an awareness imbued with equanimity — abundant, expansive, immeasurable, without hostility, without ill will. He discerns, 'Before, this mind of mine was limited & undeveloped. But now this mind of mine is immeasurable & well developed. And whatever action that was done in a measurable way does not remain there, does not linger there.'", "spans": [], "meta": {"identifier": "an10.208.than.html", "title": "Brahmavihara Sutta", "source": "neg"}}
{"text": "\"Then again, a monk keeps pervading the first direction [2] with an awareness imbued with good will, likewise the second, likewise the third, likewise the fourth. Thus above, below, & all around, everywhere, in its entirety, he keeps pervading the all-encompassing cosmos with an awareness imbued with good will — abundant, expansive, immeasurable, without hostility, without ill will. He reflects on this and discerns, 'This awareness-release through good will is fabricated & intended. Now whatever is fabricated & intended is inconstant & subject to cessation.' Staying right there, he reaches the ending of the mental fermentations. Or, if not, then — through this very Dhamma-passion, this Dhamma-delight, and from the total wasting away of the first five Fetters — he is due to be reborn [in the Pure Abodes], there to be totally unbound, never again to return from that world.", "spans": [], "meta": {"identifier": "an11.017.than.html", "title": "Dasama Sutta", "source": "neg"}}
{"text": "\"Now, what are the frames of reference? There is the case where a monk remains focused on the body in & of itself — ardent, alert, & mindful — putting aside greed & distress with reference to the world. He remains focused on feelings in & of themselves... mind in & of itself... mental qualities in & of themselves — ardent, alert, & mindful — putting aside greed & distress with reference to the world.", "spans": [], "meta": {"identifier": "sn47.040.than.html", "title": "Satipatthana-vibhanga Sutta", "source": "neg"}}
{"text": "\"And furthermore, with the abandoning of pleasure and stress — as with the earlier disappearance of elation and distress — he enters and remains in the fourth jhana: purity of equanimity and mindfulness, neither-pleasure nor stress. He sits, permeating the body with a pure, bright awareness. Just as if a man were sitting covered from head to foot with a white cloth so that there would be no part of his body to which the white cloth did not extend; even so, the monk sits, permeating the body with a pure, bright awareness. There's nothing of his entire body unpervaded by pure, bright awareness.", "spans": [], "meta": {"identifier": "mn.039.than.html", "title": "Maha-Assapura Sutta", "source": "neg"}}
{"text": "\"'\" There are these four noble truths\" is a Dhamma taught by me that is unrefuted, undefiled, blameless, not faulted by knowledgeable brahmans & contemplatives': Thus was it said. And in reference to what was it said?", "spans": [], "meta": {"identifier": "an03.061.than.html", "title": "Tittha Sutta", "source": "neg"}}
{"text": "\"And how does a monk not flare up? There is the case where, there not being 'I am because of this (or: by means of this),' there doesn't come to be 'I am here because of this,' there doesn't come to be 'I am like this because of this' ... 'I am otherwise because of this' ... 'I am bad because of this' ... 'I am good because of this' ... 'I might be because of this' ... 'I might be here because of this' ... 'I might be like this because of this' ... 'I might be otherwise because of this' ... 'May I be because of this' ... 'May I be here because of this' ... 'May I be like this because of this' ... 'May I be otherwise because of this' ... 'I will be because of this' ... 'I will be here because of this' ... 'I will be like this because of this' ... 'I will be otherwise because of this.'", "spans": [], "meta": {"identifier": "an04.200.than.html", "title": "Pema Sutta", "source": "neg"}}
{"text": "\"A man attends inwardly to his masculine faculties, masculine gestures, masculine manners, masculine poise, masculine desires, masculine voice, masculine charms. He is excited by that, delighted by that. Being excited & delighted by that, he attends outwardly to feminine faculties, feminine gestures, feminine manners, feminine poise, feminine desires, feminine voices, feminine charms. He is excited by that, delighted by that. Being excited & delighted by that, he wants to be bonded to what is outside him, wants whatever pleasure & happiness that arise based on that bond. Delighting, caught up in his masculinity, a man goes into bondage with reference to women. This is how a man does not transcend his masculinity.", "spans": [], "meta": {"identifier": "an07.048.than.html", "title": "Saññoga Sutta", "source": "neg"}}
{"text": "\"The intellect is empty of a self or of anything pertaining to a self. Ideas... Intellect-consciousness... Intellect-contact is empty of a self or of anything pertaining to a self. Thus it is said that the world is empty.\"", "spans": [], "meta": {"identifier": "sn35.085.than.html", "title": "Suñña Sutta", "source": "neg"}}
{"text": "\"Abandoning abusive speech, he abstains from abusive speech. He speaks words that are soothing to the ear, that are affectionate, that go to the heart, that are polite, appealing and pleasing to people at large.", "spans": [], "meta": {"identifier": "mn.038.than.html", "title": "Mahatanhasankhaya Sutta", "source": "neg"}}
{"text": "\"And what qualities are to be comprehended through direct knowledge? 'The five clinging-aggregates,' should be the reply. Which five? Form as a clinging-aggregate... feeling... perception... fabrications... consciousness as a clinging-aggregate. These are the qualities that are to be comprehended through direct knowledge.", "spans": [], "meta": {"identifier": "mn.149.than.html", "title": "Maha-salayatanika Sutta", "source": "neg"}}
{"text": "\"Furthermore, when tasting a flavor with the tongue, there arises in a monk what is agreeable, what is disagreeable, what is agreeable & disagreeable. He discerns that 'This agreeable thing has arisen in me, this disagreeable thing... this agreeable & disagreeable thing has arisen in me. And that is compounded, gross, dependently co-arisen. But this is peaceful, this is exquisite, i.e., equanimity.' With that, the arisen agreeable thing... disagreeable thing... agreeable & disagreeable thing ceases, and equanimity takes its stance. Just as a strong man might easily spit out a ball of saliva gathered on the tip of his tongue, that is how quickly, how rapidly, how easily, no matter what it refers to, the arisen agreeable thing... disagreeable thing... agreeable & disagreeable thing ceases, and equanimity takes its stance. In the discipline of a noble one, this is called the unexcelled development of the faculties with regard to flavors cognizable by the tongue.", "spans": [], "meta": {"identifier": "mn.152.than.html", "title": "Indriya-bhavana Sutta", "source": "neg"}}
{"text": "\"He dwells with his awareness overcome by ill will... sloth & drowsiness... restlessness & anxiety... uncertainty, obsessed with uncertainty. He does not discern the escape, as it actually is present, from uncertainty once it has arisen. Making that uncertainty the focal point, he absorbs himself with it, besorbs, resorbs, & supersorbs himself with it.", "spans": [], "meta": {"identifier": "an11.010.than.html", "title": "Sandha Sutta", "source": "neg"}}
{"text": "Furthermore, the monk is content with any old lodging at all. He speaks in praise of being content with any old lodging at all. He does not, for the sake of lodging, do anything unseemly or inappropriate. Not getting lodging, he is not agitated. Getting lodging, he uses it not tied to it, uninfatuated, guiltless, seeing the drawbacks (of attachment to it), and discerning the escape from them. He does not, on account of his contentment with any old lodging at all, exalt himself or disparage others. In this he is skillful, energetic, alert, and mindful. This, monks, is said to be a monk standing firm in the ancient, original traditions of the Noble Ones.", "spans": [], "meta": {"identifier": "an04.028.than.html", "title": "Ariya-vamsa Sutta", "source": "neg"}}
{"text": "\"Why is that? From an inconstruable beginning comes transmigration. A beginning point is not evident, though beings hindered by ignorance and fettered by craving are transmigrating & wandering on. Long have you thus experienced stress, experienced pain, experienced loss, swelling the cemeteries — enough to become disenchanted with all fabricated things, enough to become dispassionate, enough to be released.\"", "spans": [], "meta": {"identifier": "sn15.012.than.html", "title": "Sukhita Sutta", "source": "neg"}}
{"text": "\"And what is the cessation of stress? From the cessation of craving is the cessation of stress; and just this noble eightfold path — right view, right resolve, right speech, right action, right livelihood, right effort, right mindfulness, right concentration — is the path of practice leading to the cessation of stress.", "spans": [], "meta": {"identifier": "an06.063.than.html", "title": "Nibbedhika Sutta", "source": "neg"}}
{"text": "\"He does not assume consciousness to be the self, or the self as possessing consciousness, or consciousness as in the self, or the self as in consciousness. He is not seized with the idea that 'I am consciousness' or 'Consciousness is mine.' As he is not seized with these ideas, his consciousness changes & alters, but he does not fall into sorrow, lamentation, pain, distress, or despair over its change & alteration.", "spans": [], "meta": {"identifier": "sn22.001.than.html", "title": "Nakulapita Sutta", "source": "neg"}}
{"text": "\"Excellent, monk. Excellent. These three feelings have been spoken of by me: a feeling of pleasure, a feeling of pain, & a feeling of neither pleasure nor pain. These are the three feelings spoken of by me. But I have also said: 'Whatever is felt comes under stress.' That I have stated simply in connection with the inconstancy of fabrications. That I have stated simply in connection with the nature of fabrications to end... in connection with the nature of fabrications to fall away... to fade away... to cease... in connection with the nature of fabrications to change.", "spans": [], "meta": {"identifier": "sn36.011.than.html", "title": "Rahogata Sutta", "source": "neg"}}
{"text": "\"And how is an individual like an inscription in soil? There is the case where a certain individual is often angered, but his anger doesn't stay with him a long time. Just as an inscription in soil is quickly effaced by wind or water and doesn't last a long time, in the same way a certain individual is often angered, but his anger doesn't stay with him a long time. This is called an individual like an inscription in soil.", "spans": [], "meta": {"identifier": "an03.130.than.html", "title": "Lekha Sutta", "source": "neg"}}
{"text": "\"Thus asked, you should answer, 'When one is not free from passion, desire, love, thirst, fever, & craving for form, then from any change & alteration in that form, there arises sorrow, lamentation, pain, grief, & despair. When one is not free from passion... for feeling... for perception... for fabrications... When one is not free from passion, desire, love, thirst, fever, & craving for consciousness, then from any change & alteration in that consciousness, there arise sorrow, lamentation, pain, grief, & despair. Seeing this danger, our teacher teaches the subduing of passion & desire for form... for feeling... for perception... for fabrications. Seeing this danger our teacher teaches the subduing of passion & desire for consciousness.'", "spans": [], "meta": {"identifier": "sn22.002.than.html", "title": "Devadaha Sutta", "source": "neg"}}
{"text": "\"Abandoning abusive speech, he abstains from abusive speech. He speaks words that are soothing to the ear, that are affectionate, that go to the heart, that are polite, appealing & pleasing to people at large.", "spans": [], "meta": {"identifier": "mn.041.than.html", "title": "Saleyyaka Sutta", "source": "neg"}}
{"text": "[4] \" And what is the perception of drawbacks? There is the case where a monk — having gone to the wilderness, to the foot of a tree, or to an empty dwelling — reflects thus: 'This body has many pains, many drawbacks. In this body many kinds of disease arise, such as: seeing-diseases, hearing-diseases, nose-diseases, tongue-diseases, body-diseases, head-diseases, ear-diseases, mouth-diseases, teeth-diseases, cough, asthma, catarrh, fever, aging, stomach-ache, fainting, dysentery, grippe, cholera, leprosy, boils, ringworm, tuberculosis, epilepsy, skin-disease, itch, scab, psoriasis, scabies, jaundice, diabetes, hemorrhoids, fistulas, ulcers; diseases arising from bile, from phlegm, from the wind-property, from combinations of bodily humors, from changes in the weather, from uneven care of the body, from attacks, from the result of kamma; cold, heat, hunger, thirst, defecation, urination.' Thus he remains focused on drawbacks with regard to this body. This is called the perception of drawbacks.", "spans": [], "meta": {"identifier": "an10.060.than.html", "title": "Girimananda Sutta", "source": "neg"}}
{"text": "\"Now, it is because of the sick person who will recover from that illness if he receives amenable food, amenable medicine, & proper nursing — but not if he doesn't — that food for the sick has been allowed, medicine for the sick has been allowed, nursing for the sick has been allowed. And it is because there is this sort of sick person that the other sorts of sick persons are to be nursed as well. [1]", "spans": [], "meta": {"identifier": "an03.022.than.html", "title": "Gilana Sutta", "source": "neg"}}
{"text": "\"'The near shore,' monks, stands for the six internal sense media. 'The far shore' stands for the six external sense media. 'Sinking in the middle' stands for passion & delight. 'Being washed up on high ground' stands for the conceit, 'I am.'", "spans": [], "meta": {"identifier": "sn35.200.than.html", "title": "Daruka-khandha Sutta", "source": "neg"}}
{"text": "\"Then again there is the case where an excellent thoroughbred horse is not stirred & agitated on seeing the shadow of the goad-stick, but when his coat is pricked [with the goad stick] he is stirred & agitated, [thinking,] 'I wonder what task the trainer will have me do today? What should I do in response?' Some excellent thoroughbred horses are like this. And this is the second type of excellent thoroughbred horse to be found existing in the world.", "spans": [], "meta": {"identifier": "an04.113.than.html", "title": "Patoda Sutta", "source": "neg"}}
{"text": "\"And what is the still greater unworldly equanimity? When a taint-free monk looks upon his mind that is freed of greed, freed of hatred and freed of delusion, then there arises equanimity. This is called a 'still greater unworldly equanimity.'", "spans": [], "meta": {"identifier": "sn36.031.nypo.html", "title": "Niramisa Sutta", "source": "neg"}}
{"text": "\"In the same way, any brahmans or contemplatives endowed with right view, right resolve, right speech, right action, right livelihood, right effort, right mindfulness, & right concentration: If they follow the holy life even when having made a wish [for results]... having made no wish... both having made a wish and having made no wish... neither having made a wish nor having made no wish, they are capable of obtaining results. Why is that? Because it is an appropriate way of obtaining results.", "spans": [], "meta": {"identifier": "mn.126.than.html", "title": "Bhumija Sutta", "source": "neg"}}
{"text": "\"And how is one the type of person in light who is headed for darkness? There is the case where a person is born into an upper class family — a noble warrior family, a priestly family, a prosperous householder family — a family that is rich, with much wealth, with many possessions, with a great deal of money, a great many accoutrements of wealth, a great many commodities. And he is well-built, handsome, extremely inspiring, endowed with a lotus-like complexion. He receives [gifts of] food, drink, clothing, & vehicles; garlands, perfumes, & ointments; bedding, shelter, & lamps. He engages in bodily misconduct, verbal misconduct, & mental misconduct. Having engaged in bodily misconduct, verbal misconduct, & mental misconduct, he — on the break-up of the body, after death — reappears in the plane of deprivation, the bad destination, the lower realms, in hell. This is the type of person in light who is headed for darkness.", "spans": [], "meta": {"identifier": "an04.085.than.html", "title": "Tamonata Sutta", "source": "neg"}}
{"text": "\"There is the case where a monk remains focused on the body in & of itself — ardent, alert, & mindful — subduing greed & distress with reference to the world. For him, remaining focused on the body in and of itself, any desire for the body is abandoned. From the abandoning of desire, the deathless is realized.", "spans": [], "meta": {"identifier": "sn47.037.than.html", "title": "Chanda Sutta", "source": "neg"}}
{"text": "35 . \"And how is the monk a Noble One who has taken down the flag, put down the burden, become unfettered? He has abandoned the conceit of self, has cut it off at the root, removed it from is soil like a palmyra tree, brought it to utter extinction, incapable of arising again. Thus is the monk a Noble One who has taken down the flag, put down the burden, become unfettered.", "spans": [], "meta": {"identifier": "mn.022.nypo.html", "title": "Alagaddupama Sutta", "source": "neg"}}
{"text": "\"And who is the individual who stands fast? There is the case where an individual, with the total ending of the first set of five fetters, is due to be reborn [in the Pure Abodes], there to be totally unbound, never again to return from that world. This is called the individual who stands fast.", "spans": [], "meta": {"identifier": "an04.005.than.html", "title": "Anusota Sutta", "source": "neg"}}
{"text": "\"Monks, there are these four modes of practice. Which four? Painful practice with slow intuition, painful practice with quick intuition, pleasant practice with slow intuition, & pleasant practice with quick intuition.", "spans": [], "meta": {"identifier": "an04.163.than.html", "title": "Asubha Sutta", "source": "neg"}}
{"text": "\"Furthermore, when cognizing an idea with the intellect, there arises in a monk what is agreeable, what is disagreeable, what is agreeable & disagreeable. He discerns that 'This agreeable thing has arisen in me, this disagreeable thing... this agreeable & disagreeable thing has arisen in me. And that is compounded, gross, dependently co-arisen. But this is peaceful, this is exquisite, i.e., equanimity. With that, the arisen agreeable thing... disagreeable thing... agreeable & disagreeable thing ceases, and equanimity takes its stance. Just as a strong man might let two or three drops of water fall onto an iron pan heated all day: Slow would be the falling of the drops of water, but they quickly would vanish & disappear. That is how quickly, how rapidly, how easily, no matter what it refers to, the arisen agreeable thing... disagreeable thing... agreeable & disagreeable thing ceases, and equanimity takes its stance. In the discipline of a noble one, this is called the unexcelled development of the faculties with regard to ideas cognizable by the intellect.", "spans": [], "meta": {"identifier": "mn.152.than.html", "title": "Indriya-bhavana Sutta", "source": "neg"}}
{"text": "\"With the abandoning and eradication of stinginess as to one's monastery [lodgings], the holy life is fulfilled. With the abandoning and eradication of stinginess as to one's family [of supporters] ... stinginess as to one's gains ... stinginess as to one's status ... stinginess as to the Dhamma, the holy life is fulfilled.", "spans": [], "meta": {"identifier": "an05.254.than.html", "title": "Macchariya Suttas", "source": "neg"}}
{"text": "\"Because such a person considers attentively the factors which should not be considered and does not consider attentively the factors which should be considered, there arise in him āsavas that have not yet arisen and there increase in him āsavas that have already arisen.", "spans": [], "meta": {"identifier": "mn.002.bpit.html", "title": "Sabbasava Sutta", "source": "neg"}}
{"text": "\"Monks, one who hasn't abandoned nine things is incapable of realizing arahantship. Which nine? Passion, aversion, delusion, anger, resentment, arrogance, insolence, envy, & stinginess. One who hasn't abandoned these nine things is incapable of realizing arahantship.", "spans": [], "meta": {"identifier": "an09.062.than.html", "title": "Bhabba Sutta", "source": "neg"}}
{"text": "\"In one who has right release, wrong release is purged away, and the many evil, unskillful mental qualities that come into play in dependence on wrong release are purged away as well, while the many skillful mental qualities that depend on right release go to the culmination of their development.", "spans": [], "meta": {"identifier": "an10.108.than.html", "title": "Virecana (Tikicchaka) Sutta", "source": "neg"}}
{"text": "\" Suppose that a black ox and a white ox were joined with a single collar or yoke. If someone were to say, 'The black ox is the fetter of the white ox, the white ox is the fetter of the black' — speaking this way, would he be speaking rightly?\"", "spans": [], "meta": {"identifier": "sn35.191.than.html", "title": "Kotthita Sutta", "source": "neg"}}
{"text": "\"He keeps pervading the first direction — as well as the second direction, the third, & the fourth — with an awareness imbued with appreciation. Thus he keeps pervading above, below, & all around, everywhere & in every respect the all-encompassing cosmos with an awareness imbued with appreciation: abundant, expansive, immeasurable, free from hostility, free from ill will.", "spans": [], "meta": {"identifier": "an03.065.than.html", "title": "Kalama Sutta", "source": "neg"}}
{"text": "\"And how is a monk one with a sense of himself? There is the case where a monk knows himself: 'This is how far I have come in conviction, virtue, learning, liberality, discernment, quick-wittedness.' If he didn't know himself — 'This is how far I have come in conviction, virtue, learning, liberality, discernment, quick-wittedness' — he wouldn't be said to be one with a sense of himself. So it's because he does know himself — 'This is how far I have come in conviction, virtue, learning, liberality, discernment, quick-wittedness' — that he is said to be one with a sense of himself. This is one with a sense of Dhamma, a sense of meaning, & a sense of himself.", "spans": [], "meta": {"identifier": "an07.064.than.html", "title": "Dhammaññu Sutta", "source": "neg"}}
{"text": "\"Thus he lives contemplating the body in the body internally or he lives contemplating the body in the body externally, or he lives contemplating the body in the body internally and externally. He lives contemplating origination-things in the body or he lives contemplating dissolution-things in the body, or he lives contemplating origination-and-dissolution-things in the body. Or indeed his mindfulness is established with the thought, 'The body exists,' to the extent necessary just for knowledge and remembrance, and he lives independent, and clings to naught in the world.", "spans": [], "meta": {"identifier": "mn.010.soma.html", "title": "Satipatthana Sutta", "source": "neg"}}
{"text": "\"Then again, some unruly horses — when goaded, ordered, and told 'Go!' by the charioteer — go neither forward nor back, but stand right there like a post. Some unruly horses are like this. This is the seventh fault in a horse.", "spans": [], "meta": {"identifier": "an08.014.than.html", "title": "Khalunga Sutta", "source": "neg"}}
{"text": "\"'Keep pervading the first direction with an awareness imbued with equanimity, likewise the second, likewise the third, likewise the fourth. Thus above, below, & all around, everywhere, in its entirety, keep pervading the all-encompassing cosmos with an awareness imbued with equanimity — abundant, expansive, immeasurable, without hostility, without ill will.'", "spans": [], "meta": {"identifier": "sn46.054.than.html", "title": "Metta Sutta", "source": "neg"}}
{"text": "\"Suffering, as a noble truth, is this: Birth is suffering, aging is suffering, sickness is suffering, death is suffering, sorrow and lamentation, pain, grief and despair are suffering; association with the loathed is suffering, dissociation from the loved is suffering, not to get what one wants is suffering — in short, suffering is the five categories of clinging objects.", "spans": [], "meta": {"identifier": "sn56.011.nymo.html", "title": "Dhammacakkappavattana Sutta", "source": "neg"}}
{"text": "\"Three qualities of the world, great king, when arising, arise for harm, stress, & discomfort. Which three? Greed, great king, is a quality of the world that, when arising, arises for harm, stress, & discomfort. Aversion... Delusion is a quality of the world that, when arising, arises for harm, stress, & discomfort. These are the three qualities of the world, great king, that when arising, arise for harm, stress, & discomfort.\"", "spans": [], "meta": {"identifier": "sn03.023.than.html", "title": "Loka Sutta", "source": "neg"}}
{"text": "\"Then the thought occurred to me, 'Aging & death don't exist when what doesn't exist? From the cessation of what comes the cessation of aging & death?' From my appropriate attention there came the breakthrough of discernment: 'Aging & death don't exist when birth doesn't exist. From the cessation of birth comes the cessation of aging & death.'... 'Name-&-form doesn't exist when what doesn't exist? From the cessation of what comes the cessation of name-&-form?' From my appropriate attention there came the breakthrough of discernment: 'Name-&-form doesn't exist when consciousness doesn't exist. From the cessation of consciousness comes the cessation of name-&-form.' Then the thought occurred to me, 'Consciousness doesn't exist when what doesn't exist? From the cessation of what comes the cessation of consciousness?' From my appropriate attention there came the breakthrough of discernment: 'Consciousness doesn't exist when name-&-form doesn't exist. From the cessation of name-&-form comes the cessation of consciousness.'", "spans": [], "meta": {"identifier": "sn12.065.than.html", "title": "Nagara Sutta", "source": "neg"}}
{"text": "\"And how is a person of no integrity a person of no integrity in his friendship? There is the case where a person of no integrity has, as his friends & companions, those brahmans & contemplatives who are lacking in conviction, lacking in conscience, lacking in concern, unlearned, lazy, of muddled mindfulness, & poor discernment. This is how a person of no integrity is a person of no integrity in his friendship.", "spans": [], "meta": {"identifier": "mn.110.than.html", "title": "Cula-punnama Sutta", "source": "neg"}}
{"text": "\"In the same way, when a monk utters words about knowing... about developing... about knowing & developing, saying, 'I know this Dhamma; I see this Dhamma; I am developed in bodily action, developed in virtue, developed in mind, developed in discernment,' and he remains with his mind not conquered by greed, his mind not conquered by aversion, delusion, anger, hostility, hypocrisy, spite, selfishness, evil envy, or evil longing, then it should be known of him that, 'This venerable one discerns how it is that, when one discerns, greed does not come into being, which is why he remains with his mind not conquered by greed. This venerable one discerns how it is that, when one discerns, aversion... delusion... anger... hostility... hypocrisy... spite... selfishness... evil envy... evil longing does not come into being, which is why he remains with his mind not conquered by evil longing.'\"", "spans": [], "meta": {"identifier": "an10.024.than.html", "title": "Cunda Sutta", "source": "neg"}}
{"text": "\"Monks, you would do well to depend on a view-dependency (ditthi-nissaya), depending on which there would not arise sorrow, lamentation, pain, grief, & despair. But do you see a view-dependency, depending on which there would not arise sorrow, lamentation, pain, grief, & despair?\"", "spans": [], "meta": {"identifier": "mn.022.than.html", "title": "Alagaddupama Sutta", "source": "neg"}}
{"text": "\" [13] He trains himself, 'I will breathe in focusing on inconstancy.' He trains himself, 'I will breathe out focusing on inconstancy.' [14] He trains himself, 'I will breathe in focusing on dispassion.' [2] He trains himself, 'I will breathe out focusing on dispassion.' [15] He trains himself, 'I will breathe in focusing on cessation.' He trains himself, 'I will breathe out focusing on cessation.' [16] He trains himself, 'I will breathe in focusing on relinquishment.' He trains himself, 'I will breathe out focusing on relinquishment.'", "spans": [], "meta": {"identifier": "sn54.013.than.html", "title": "Ananda Sutta", "source": "neg"}}
{"text": "\"Then again, the disciple of the noble ones considers this: 'Sensuality here & now; sensuality in lives to come; sensual perceptions here & now; sensual perceptions in lives to come: whatever is form, every form, is the four great elements or a form derived from the four great elements.' Practicing & frequently abiding in this way, his mind acquires confidence in that dimension. There being full confidence, he either attains the imperturbable now or else is committed to discernment. With the break-up of the body, after death, it's possible that this leading-on consciousness of his will go to the imperturbable. This is declared to be the second practice conducive to the imperturbable.", "spans": [], "meta": {"identifier": "mn.106.than.html", "title": "Aneñja-sappaya Sutta", "source": "neg"}}
{"text": "\"Lord, what is the cause, what is the reason, why a person gives a gift of a certain sort and it does not bear great fruit or great benefit, whereas another person gives a gift of the same sort and it bears great fruit and great benefit?\"", "spans": [], "meta": {"identifier": "an07.049.than.html", "title": "Dana Sutta", "source": "neg"}}
{"text": "\"For him — uninfatuated, unattached, unconfused, remaining focused on their drawbacks — the five clinging-aggregates head toward future diminution. The craving that makes for further becoming — accompanied by passion & delight, relishing now this & now that — is abandoned by him. His bodily disturbances & mental disturbances are abandoned. His bodily torments & mental torments are abandoned. His bodily distresses & mental distresses are abandoned. He is sensitive both to ease of body & ease of awareness.", "spans": [], "meta": {"identifier": "mn.149.than.html", "title": "Maha-salayatanika Sutta", "source": "neg"}}
{"text": "\"And what is the fire property? The fire property may be either internal or external. What is the internal fire property? Whatever internal, belonging to oneself, is fire, fiery, & sustained: that by which [the body] is warmed, aged, & consumed with fever; and that by which what is eaten, drunk, chewed, & savored gets properly digested, or whatever else internal, within oneself, is fire, fiery, & sustained: This is called the internal fire property. Now both the internal fire property and the external fire property are simply fire property. And that should be seen as it actually is present with right discernment: 'This is not mine, this is not me, this is not my self.' When one sees it thus as it actually is present with right discernment, one becomes disenchanted with the fire property and makes the mind dispassionate toward the fire property.", "spans": [], "meta": {"identifier": "mn.028.than.html", "title": "Maha-hatthipadopama Sutta", "source": "neg"}}
{"text": "\"Then again, the disciple of the noble ones considers this: 'Sensuality here & now; sensuality in lives to come; sensual perceptions here & now; sensual perceptions in lives to come; forms here & now; forms in lives to come; form-perceptions here & now; form-perceptions in lives to come; perceptions of the imperturbable: all are perceptions. Where they cease without remainder: that is peaceful, that is exquisite, i.e., the dimension of nothingness.' Practicing & frequently abiding in this way, his mind acquires confidence in that dimension. There being full confidence, he either attains the dimension of nothingness now or else is committed to discernment. With the break-up of the body, after death, it's possible that this leading-on consciousness of his will go to the dimension of nothingness. This is declared to be the first practice conducive to the dimension of nothingness.", "spans": [], "meta": {"identifier": "mn.106.than.html", "title": "Aneñja-sappaya Sutta", "source": "neg"}}
{"text": "\"And what is equanimity coming from singleness, dependent on singleness? There is equanimity dependent on the dimension of the infinitude of space, equanimity dependent on the dimension of the infinitude of consciousness... dependent on the dimension of nothingness... dependent on the dimension of neither perception nor non-perception. This is equanimity coming from singleness, dependent on singleness.", "spans": [], "meta": {"identifier": "mn.137.than.html", "title": "Salayatana-vibhanga Sutta", "source": "neg"}}
{"text": "\"Thus it is friend, that without ardor, without taking care, one is unable to gain enlightenment, unable to gain Nibbaana, unable to gain relief from bondage. And how, friend, is one ardent? When a monk thinks: 'Evil and unskilled states...' ... 'Skilled states...' [ As before but after each thought : 'and he arouses ardor'] — this, friend, is arousing ardor. [ The same repeated with: 'taking care']. Thus it is, friend, that by arousing ardor and taking care one is able to gain enlightenment, to gain Nibbaana, to gain relief from bondage.\"", "spans": [], "meta": {"identifier": "sn16.002.wlsh.html", "title": "Anottaapi Sutta", "source": "neg"}}
{"text": "10 . [8] \"There are here, O monks, some foolish men who study the Teaching; [9] having studied it, they do not wisely examine the purpose of those teachings. To those who do not wisely examine the purpose, these teachings will not yield insight. [10] They study the Teaching only to use it for criticizing or for refuting others in disputation. They do not experience the (true) purpose [11] for which they [12] (ought to) study the Teaching. To them these teachings wrongly grasped, will bring harm and suffering for a long time. And why? Because of their wrong grasp of the teachings.", "spans": [], "meta": {"identifier": "mn.022.nypo.html", "title": "Alagaddupama Sutta", "source": "neg"}}
{"text": "\"That disciple of the noble ones — thus devoid of covetousness, devoid of ill will, unbewildered, alert, mindful — keeps pervading the first direction [2] with an awareness imbued with good will, likewise the second, likewise the third, likewise the fourth. Thus above, below, & all around, everywhere, in its entirety, he keeps pervading the all-encompassing cosmos with an awareness imbued with good will — abundant, expansive, immeasurable, without hostility, without ill will. He discerns, 'Before, this mind of mine was limited & undeveloped. But now this mind of mine is immeasurable & well developed. And whatever action that was done in a measurable way does not remain there, does not linger there.'", "spans": [], "meta": {"identifier": "an10.208.than.html", "title": "Brahmavihara Sutta", "source": "neg"}}
{"text": "\"Furthermore, the disciple of the noble ones — using the wealth earned through his efforts & enterprise, amassed through the strength of his arm, and piled up through the sweat of his brow, righteous wealth righteously gained — institutes offerings of supreme aim, heavenly, resulting in happiness, leading to heaven, given to brahmans & contemplatives who abstain from intoxication & heedlessness, who endure all things with patience & humility, each taming himself, each restraining himself, each taking himself to Unbinding. This is the fifth benefit that can be obtained from wealth.", "spans": [], "meta": {"identifier": "an05.041.than.html", "title": "Adiya Sutta", "source": "neg"}}
