{"text": "I have heard that on one occasion the Blessed One was staying at Savatthi in the Eastern Monastery, the palace of Migara 's mother. Then in the evening, Ven. Ananda , coming out of seclusion, went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there, he said to the Blessed One: \"On one occasion, when the Blessed One was staying among the Sakyans in a Sakyan town named Nagaraka , there — face-to-face with the Blessed One — I heard this, face-to-face I learned this: 'I now remain fully in a dwelling of emptiness.' Did I hear that correctly, learn it correctly, attend to it correctly, remember it correctly?\"", "entities": [[38, 49, "PERSON"], [65, 73, "GPE"], [158, 164, "LOC"], [204, 215, "PERSON"], [316, 327, "PERSON"], [356, 367, "PERSON"], [462, 473, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.121.than.html", "title": "Cula-suññata Sutta", "para_seq": null}}

{"text": "\"Now, it is because of the person who will alight on the lawfulness, the rightness of skillful mental qualities if he gets to see the Tathagata and gets to hear the Dhamma & Discipline proclaimed by the Tathagata — but not if he doesn't — that the teaching of the Dhamma has been allowed. And it is because there is this sort of person that the other sorts of persons are to be taught the Dhamma as well [on the chance that they may actually turn out to need and benefit from the teaching].", "entities": [[134, 143, "PERSON"], [203, 212, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an03.022.than.html", "title": "Gilana Sutta", "para_seq": null}}
{"text": "On one occasion Ven. Sariputta and Ven. MahaKotthita were staying near Varanasi in the Deer Park at Isipatana . Then in the evening, arising from his seclusion, Ven. MahaKotthita went to Ven. Sariputta and, on arrival, exchanged courteous greetings with him. After an exchange of friendly greetings & courtesies, he sat to one side. As he was sitting there he said to Ven. Sariputta: \"Now tell me, Sariputta my friend: Are aging & death self-made or other-made or both self-made & other-made, or — without self-making or other-making — do they arise spontaneously?\"", "entities": [[16, 30, "PERSON"], [87, 96, "LOC"], [187, 201, "PERSON"], [368, 382, "PERSON"], [398, 407, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn12.067.than.html", "title": "Nalakalapiyo Sutta", "para_seq": null}}
{"text": "The brahman householders of Icchanangala heard it said, \"Gotama the contemplative — the son of the Sakyans, having gone forth from the Sakyan clan — on a wandering tour among the Kosalans with a large community of monks — has arrived at Icchanangala and is staying in the Icchanangala forest grove. And of that Master Gotama this fine reputation has spread: 'He is indeed a Blessed One, worthy, & rightly self-awakened, consummate in knowledge & conduct, well-gone, a knower of the cosmos, an unexcelled trainer of those persons ready to be tamed, teacher of human & divine beings, awakened, blessed. He has made known — having realized it through direct knowledge — this world with its devas, maras, & brahmas, its generations with their contemplatives & brahmans, their rulers & common people; has explained the Dhamma admirable in the beginning, admirable in the middle, admirable in the end; has expounded the holy life both in its particulars & in its essence, entirely perfect, surpassingly pure. It is good to see such a worthy one.'\"", "entities": [[57, 63, "PERSON"], [318, 324, "PERSON"], [374, 385, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an08.086.than.html", "title": "Yasa Sutta", "para_seq": null}}
{"text": "\"There would, my friend. \"For one who loves becoming, who is fond of becoming, who cherishes becoming, who does not know or see, as it actually is present, the cessation of becoming, there occurs the thought, 'The Tathagata exists after death' or 'The Tathagata does not exist after death' or 'The Tathagata both exists and does not exist after death' or 'The Tathagata neither exists nor does not exist after death.'", "entities": [[214, 223, "PERSON"], [252, 261, "PERSON"], [298, 307, "PERSON"], [360, 369, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn44.006.than.html", "title": "Sariputta-Kotthita Sutta", "para_seq": null}}
{"text": "\"Pleasant feeling is pleasant in remaining, & painful in changing, friend Visakha. Painful feeling is painful in remaining & pleasant in changing. Neither-pleasant-nor-painful feeling is pleasant in occurring together with knowledge, and painful in occurring without knowledge.\"", "entities": [[74, 81, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.044.than.html", "title": "Culavedalla Sutta", "para_seq": null}}
{"text": "Then in the early morning, a large number of monks, having put on their robes and carrying their bowls & outer robes, went into Savatthi for alms. Having gone for alms in Savatthi, after the meal, returning from their alms round, they went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As they were sitting there, they said to the Blessed One: \"Just now, lord, King Ajatasattu of Magadha, the son of Queen Videha, raising a fourfold army, marched toward Kasi against King Pasenadi Kosala. King Pasenadi heard, 'King Ajatasattu of Magadha, the son of Queen Videha, they say, has raised a fourfold army and is marching toward Kasi against me.' So King Pasenadi, raising a fourfold army, launched a counter-attack toward Kasi against King Ajatasattu. Then King Ajatasattu & King Pasenadi fought a battle, and in that battle King Ajatasattu defeated King Pasenadi. King Pasenadi, defeated, marched back to his capital at Savatthi.\"", "entities": [[128, 136, "GPE"], [171, 179, "GPE"], [247, 258, "PERSON"], [364, 375, "PERSON"], [399, 409, "PERSON"], [413, 420, "GPE"], [433, 445, "PERSON"], [487, 491, "GPE"], [500, 520, "PERSON"], [522, 535, "PERSON"], [549, 559, "PERSON"], [563, 570, "GPE"], [583, 595, "PERSON"], [657, 661, "GPE"], [678, 691, "PERSON"], [751, 755, "GPE"], [769, 779, "PERSON"], [791, 801, "PERSON"], [804, 817, "PERSON"], [859, 869, "PERSON"], [879, 892, "PERSON"], [894, 907, "PERSON"], [950, 958, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn03.014.than.html", "title": "Sangama Sutta", "para_seq": null}}
{"text": "Then the Blessed One, having stayed at Rajagaha as long as he liked, set out wandering to Savatthi . Wandering by stages, he arrived there and stayed in Jeta's Grove, Anathapindika's monastery . Ven. Punna Mantaniputta heard, \"The Blessed One has arrived at Savatthi and is staying near Savatthi in Jeta's Grove, Anathapindika's monastery.\" Setting his lodgings in order and taking his robes & bowl, he set out wandering to Savatthi. Wandering by stages, he went to where the Blessed One was staying in Jeta's Grove, Anathapindika's monastery. On arrival, having bowed down to the Blessed One, he sat to one side. As he was sitting there, the Blessed One instructed, urged, roused, & encouraged him with a Dhamma talk. Then Ven. Punna — instructed, urged, roused, & encouraged with the Blessed One's Dhamma talk; delighting & approving of the Blessed One's words — got up from his seat, bowed down to the Blessed One, circumambulated him, and went to the Grove of the Blind for the day's abiding.", "entities": [[9, 20, "PERSON"], [39, 47, "GPE"], [90, 98, "GPE"], [153, 165, "LOC"], [167, 180, "PERSON"], [200, 218, "PERSON"], [231, 242, "PERSON"], [258, 266, "GPE"], [287, 295, "GPE"], [299, 311, "LOC"], [313, 326, "PERSON"], [424, 432, "GPE"], [476, 487, "PERSON"], [503, 515, "LOC"], [517, 530, "PERSON"], [581, 592, "PERSON"], [643, 654, "PERSON"], [786, 797, "PERSON"], [843, 854, "PERSON"], [905, 916, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.024.than.html", "title": "Ratha-vinita Sutta", "para_seq": null}}
{"text": "As they were sitting there, the Blessed One said to them, \"Monks, whom in our native land do the native-land monks — his companions in the holy life — esteem in this way: 'Having few wants himself, he gives talks to the monks on fewness of wants. Contented himself, he gives talks to the monks on contentment. Secluded himself, he gives talks to the monks on seclusion. Unentangled himself, he gives talks to the monks on non-entanglement. Having aroused persistence in himself, he gives talks to the monks on arousing persistence. Consummate in his own virtue, he gives talks to the monks on becoming consummate in virtue. Consummate in his own concentration, he gives talks to the monks on becoming consummate in concentration. Consummate in his own discernment, he gives talks to the monks on becoming consummate in discernment. Consummate in his own release, he gives talks to the monks on becoming consummate in release. Consummate in his own knowledge & vision of release, he gives talks to the monks on becoming consummate in the knowledge & vision of release. [1] He is one who exhorts, informs, instructs, urges, rouses, & encourages his companions in the holy life.'\"", "entities": [[32, 43, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.024.than.html", "title": "Ratha-vinita Sutta", "para_seq": null}}
{"text": "\" Great king , this was said by the Blessed One who knows & sees, worthy and rightly self-awakened: 'Come now, monks: Keep guarding the doors to your sense faculties. On seeing a form with the eye, do not grasp at any theme or variations by which — if you were to dwell without restraint over the faculty of the eye — evil, unskillful qualities such as greed or distress might assail you. Practice with restraint. Guard the faculty of the eye. Achieve restraint with regard to the faculty of the eye.", "entities": [[36, 47, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn35.127.than.html", "title": "Bharadvaja Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying among the Kajjangalas in the Bamboo Grove. Then the young brahman Uttara , a student of Parasiri [1] went to the Blessed One and, on arrival, exchanged friendly greetings & courtesies. After this exchange of courteous greetings he sat to one side.", "entities": [[38, 49, "PERSON"], [91, 103, "LOC"], [175, 186, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.152.than.html", "title": "Indriya-bhavana Sutta", "para_seq": null}}
{"text": "Then the Blessed One, leaving the road, went to sit at the root of a certain tree — his legs crossed, his body erect, with mindfulness established to the fore. Then Dona, following the Blessed One's footprints, saw him sitting at the root of the tree: confident, inspiring confidence, his senses calmed, his mind calmed, having attained the utmost control & tranquility, tamed, guarded, his senses restrained, a naga. [1] On seeing him, he went to him and said, \"Master, are you a deva?\" [2]", "entities": [[9, 20, "PERSON"], [185, 196, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an04.036.than.html", "title": "Dona Sutta", "para_seq": null}}
{"text": "\"Furthermore, with the complete transcending of the dimension of neither perception nor non-perception, he enters & remains in the cessation of perception & feeling. And as he sees with discernment, the mental fermentations go to their total end. And he knows it through discernment. It is to this extent that one is described by the Blessed One as released through discernment without a sequel.\"", "entities": [[334, 345, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an09.044.than.html", "title": "Paññavimutti Sutta", "para_seq": null}}
{"text": "[The Blessed One said:] \"Ananda, true was the exposition that Pañcakanga the carpenter would not accept from Ven. Udayin. And true was the exposition that Ven. Udayin would not accept from Pañcakanga the carpenter. There is the exposition by which I have spoken of two feelings, the exposition by which I have spoken of three feelings ... five feelings ... six feelings ... eighteen feelings ... 36 feelings ... 108 feelings. [1] Thus I have taught the Dhamma by means of exposition. When I have taught the Dhamma by means of exposition, it can be expected that when there are those who do not consent to, assent to, or accept what is well-said and well-stated by one another, there will be arguing, quarreling, & disputing, and they will dwell wounding one another with the sword of the tongue. Thus I have taught the Dhamma by means of exposition. When I have taught the Dhamma by means of exposition, it can be expected that when there are those who do consent to, assent to, & accept what is well-said and well-stated by one another, they will live in harmony, with courtesy, without quarreling, like milk mixed with water, regarding one another with friendly eyes.", "entities": [[5, 16, "PERSON"], [25, 31, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.059.than.html", "title": "Bahuvedaniya Sutta", "para_seq": null}}
{"text": "\"Ananda, when knowing — as they actually are — the origination, passing away, allure, drawbacks of — and escape from — these seven stations of consciousness and two spheres, a monk is released through lack of clinging, he is said to be a monk released through discernment.", "entities": [[1, 7, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.15.0.than.html", "title": "Maha-nidana Sutta", "para_seq": null}}
{"text": "When Vajjiya Mahita the householder had been instructed, urged, roused & encouraged by the Blessed One with a talk on Dhamma, he got up from his seat and, having bowed down to the Blessed One, left, keeping the Blessed One on his right side. Not long afterward, the Blessed One addressed the monks: \"Monks, even a monk who has long penetrated the Dhamma in this Doctrine & Discipline would do well periodically & righteously to refute the wanderers of other persuasions in just the way Vajjiya Mahita the householder has done.\"", "entities": [[91, 102, "PERSON"], [180, 191, "PERSON"], [211, 222, "PERSON"], [266, 277, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an10.094.than.html", "title": "Vajjiya Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion, as the Blessed One was wandering among the Magadhans , he entered Rajagaha , went to the potter Bhaggava , and on arrival said to him, \"If it is no inconvenience for you, Bhaggava, I will stay for one night in your shed.\"", "entities": [[42, 53, "PERSON"], [101, 109, "GPE"]], "meta": {"nikaya": "MN", "identifier": "mn.140.than.html", "title": "Dhatu-vibhanga Sutta", "para_seq": null}}
{"text": "When this was said, Ven. Moggallana said to the Blessed One: \"Briefly, lord, in what respect is a monk released through the ending of craving, utterly complete, utterly free from bonds, a follower of the utterly holy life, utterly consummate: foremost among human & heavenly beings?\"", "entities": [[25, 35, "PERSON"], [48, 59, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an07.058.than.html", "title": "Capala (Pacala) Sutta", "para_seq": null}}
{"text": "\"This, too, is called a footprint of the Tathagata, a scratch mark of the Tathagata, a tusk slash of the Tathagata, but a disciple of the noble ones would not yet come to the conclusion, 'The Blessed One is rightly self-awakened; the Dhamma is well-taught by the Blessed One; the Sangha of the Blessed One's disciples has practiced rightly.'", "entities": [[41, 50, "PERSON"], [74, 83, "PERSON"], [105, 114, "PERSON"], [192, 203, "PERSON"], [263, 274, "PERSON"], [294, 305, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.027.than.html", "title": "Cula-hatthipadopama Sutta", "para_seq": null}}
{"text": "\"Then there is the case, Ānanda, where a certain contemplative or brahman — through ardency, exertion, commitment, heedfulness, & right attention — touches the sort of concentration of awareness that, when his mind is thus concentrated, he sees with the divine eye, pure and surpassing the human, that person — the case where one who abstains from taking life, abstains from taking what is not given, abstains from illicit sex, abstains from lying, abstains from speaking divisively, abstains from speaking abusively, abstains from idle chatter, is not covetous, not malevolent, & holds right view, with the breakup of the body, after death, reappears in a plane of deprivation, a bad destination, a lower realm, hell.", "entities": [[25, 31, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.136.than.html", "title": "Maha Kammavibhanga Sutta", "para_seq": null}}
{"text": "Replying, \"As you say, friends,\" to the elder monks, Ven. Dasaka went to Ven. Khemaka and on arrival said to him, \"The elders, friend Khemaka, say to you, 'Concerning these five clinging-aggregates described by the Blessed One — i.e., form as a clinging-aggregate... feeling... perception... fabrications... consciousness as a clinging-aggregate: If, with regard to these five clinging-aggregates, Ven. Khemaka assumes nothing to be self or belonging to self, then Ven. Khemaka is an arahant, devoid of fermentations.'\"", "entities": [[215, 226, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn22.089.than.html", "title": "Khemaka Sutta", "para_seq": null}}
{"text": "\"Just as any seeds that exhibit growth, increase, & proliferation, all do so in dependence on the earth; or just as any activities requiring strength that are done, all are done in dependence on the earth; in the same way, Master Gotama, an individual with form as self, taking a stance on form, produces merit or demerit. An individual with feeling as self... with perception as self... with fabrications as self... with consciousness as self, taking a stance on consciousness, produces merit or demerit.\"", "entities": [[230, 236, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.035.than.html", "title": "Cula-Saccaka Sutta", "para_seq": null}}
{"text": "\"On whatever occasion, with the complete transcending of the dimension of neither perception nor non-perception, he enters & remains in the cessation of perception & feeling; and, having seen [that] with discernment, his effluents are completely ended: He is said to be a monk who has put Māra in the dark. Having bound Māra's eyes and leaving no opening, he has become invisible to the Evil One, having crossed over attachment in the cosmos.\" [3]", "entities": [[289, 293, "PERSON"], [320, 324, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an09.039.than.html", "title": "Deva Sutta", "para_seq": null}}
{"text": "\"From where would our Dhanañjanin the brahman get any heedfulness, friend? Relying on the king, he plunders brahmans & householders. Relying on the brahmans & householders, he plunders the king. His wife — a woman of faith, fetched from a family with faith — has died. He has fetched another wife — a woman of no faith — from a family with no faith.\"", "entities": [[22, 33, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.097.than.html", "title": "Dhanañjani Sutta", "para_seq": null}}
{"text": "That is what the Blessed One said. Gratified, the monks delighted at his words. And while this explanation was being given, the hearts of the 1,000 monks, through no clinging (not being sustained), were fully released from fermentation/effluents.", "entities": [[17, 28, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn35.028.than.html", "title": "Adittapariyaya Sutta", "para_seq": null}}
{"text": "\"What do you think, Anuradha: Do you regard the Tathagata as being in form?... Elsewhere than form?... In feeling?... Elsewhere than feeling?... In perception?... Elsewhere than perception?... In fabrications?... Elsewhere than fabrications?... In consciousness?... Elsewhere than consciousness?\"", "entities": [[48, 57, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn22.086.than.html", "title": "Anuradha Sutta", "para_seq": null}}
{"text": "\"There is the case where the disciple of the noble ones is endowed with verified confidence in the Awakened One: 'Indeed, the Blessed One is worthy and rightly self-awakened, consummate in knowledge & conduct, well-gone, an expert with regard to the world, unexcelled as a trainer for those people fit to be tamed, the Teacher of divine & human beings, awakened, blessed.'", "entities": [[126, 137, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn55.022.than.html", "title": "Mahanama Sutta", "para_seq": null}}
{"text": "A second time, the Blessed One said to Saccaka the Nigaṇṭha-son: \"What do you think, Aggivessana? When you say, 'Form is my self,' do you wield power over that form: 'May my form be thus, may my form not be thus'?\"", "entities": [[19, 30, "PERSON"], [39, 63, "PERSON"], [85, 96, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.035.than.html", "title": "Cula-Saccaka Sutta", "para_seq": null}}
{"text": "[The Blessed One said:] \"There are these four qualities, TigerPaw, that lead to a lay person's happiness and well-being in this life. Which four? Being consummate in initiative, being consummate in vigilance, admirable friendship, and maintaining one's livelihood in tune.", "entities": [[5, 16, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an08.054.than.html", "title": "Dighajanu (Vyagghapajja) Sutta", "para_seq": null}}
{"text": "Then the thought occurred to Alavika the nun: \"Now who has recited this verse — a human being or a non-human one?\" Then it occurred to her: \"This is Mara the Evil One, who has recited this verse wanting to arouse fear, horripilation, & terror in me, wanting to make me fall away from seclusion.\"", "entities": [[149, 153, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn05.001.than.html", "title": "Alavika Sutta", "para_seq": null}}
{"text": "\"And through this line of reasoning one may know how the eye is not the fetter of forms, nor are forms the fetter of the eye, but whatever desire & passion arises in dependence on the two of them: That is the fetter there. The ear is not the fetter of sounds... The nose is not the fetter of aromas... The tongue is not the fetter of flavors... The body is not the fetter of tactile sensations... The intellect is not the fetter of ideas, nor are ideas the fetter of the intellect, but whatever desire & passion arises in dependence on the two of them: That is the fetter there. There is an eye in the Blessed One. The Blessed One sees forms with the eye. There is no desire or passion in the Blessed One. The Blessed One is well-released in mind.", "entities": [[602, 613, "PERSON"], [619, 630, "PERSON"], [693, 704, "PERSON"], [710, 721, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn35.191.than.html", "title": "Kotthita Sutta", "para_seq": null}}
{"text": "\"Magnificent, Master Kaccana! Magnificent! Just as if he were to place upright what was overturned, to reveal what was hidden, to show the way to one who was lost, or to carry a lamp into the dark so that those with eyes could see forms, in the same way has Master Kaccana — through many lines of reasoning — made the Dhamma clear. I go to Master Gotama for refuge, to the Dhamma, & to the community of monks. May Master Kaccana remember me as a lay follower who has gone for refuge from this day forward, for life.\"", "entities": [[21, 28, "PERSON"], [265, 272, "PERSON"], [347, 353, "PERSON"], [421, 428, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an02.038.than.html", "title": "Kandarayana Sutta", "para_seq": null}}
{"text": "On one occasion the Blessed One was staying near Rajagaha at the Squirrels' Sanctuary. Now at that time, when the king's assembly had gathered and was sitting together in the royal palace, this topic of conversation arose: \"Money [1] is allowable for the Sakyan-son contemplatives. The Sakyan-son contemplatives consent to money. The Sakyan-son contemplatives accept money.\"", "entities": [[20, 31, "PERSON"], [49, 57, "GPE"], [65, 85, "LOC"]], "meta": {"nikaya": "SN", "identifier": "sn42.010.than.html", "title": "Maniculaka Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi in Jeta's Grove, Anathapindika's monastery . Then Ven. Ananda went to the Blessed One and, on arrival, bowed down to him and sat to one side. As he was sitting there he addressed the Blessed One, saying, \"Is there one quality that, when developed & pursued, brings four qualities to completion? And four qualities that, when developed & pursued, bring seven qualities to completion? And seven qualities that, when developed & pursued, bring two qualities to completion?\"", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [79, 91, "LOC"], [93, 106, "PERSON"], [131, 137, "PERSON"], [150, 161, "PERSON"], [259, 270, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn54.013.than.html", "title": "Ananda Sutta", "para_seq": null}}
{"text": "\"Given that I have declared, Ananda, that bodily misconduct, verbal misconduct, & mental misconduct should not be done, these are the drawbacks one can expect when doing what should not be done: One can fault oneself; observant people, on close examination, criticize one; one's bad reputation gets spread about; one dies confused; and — on the break-up of the body, after death — one reappears in the plane of deprivation, the bad destination, the lower realms, in hell. Given that I have declared, Ananda, that bodily misconduct, verbal misconduct, & mental misconduct should not be done, these are the drawbacks one can expect when doing what should not be done.", "entities": [[29, 35, "PERSON"], [500, 506, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an02.018.than.html", "title": "Ekamsena Sutta", "para_seq": null}}
{"text": "\"Thus this is a cause, this is a reason, this is an origination, this is a requisite condition for seeking, i.e., craving. Thus, Ananda, these two phenomena [the chain of conditions leading from craving to birth, aging, and death, and the chain of conditions leading from craving to quarrels, etc.], as a duality, flow back into one place at feeling.", "entities": [[129, 135, "PERSON"]], "meta": {"nikaya": "DN", "identifier": "dn.15.0.than.html", "title": "Maha-nidana Sutta", "para_seq": null}}
{"text": "\"Very well, then: 'The cosmos is finite... The cosmos is infinite... The soul & the body are the same... The soul is one thing and the body another... After death a Tathagata exists... After death a Tathagata does not exist... After death a Tathagata both does & does not exist... After death a Tathagata neither does nor does not exist. Only this is true; anything otherwise is worthless.' Is this the sort of view you have?\"", "entities": [[165, 174, "PERSON"], [199, 208, "PERSON"], [241, 250, "PERSON"], [295, 304, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an10.096.than.html", "title": "Kokanuda Sutta", "para_seq": null}}
{"text": "\"No matter what Gotama the contemplative says, Mallika endorses it: 'If that was said by the Blessed One, great king, then that's the way it is.' Just as, no matter what his teacher says, a pupil endorses it: 'That's the way it is, teacher. That's the way it is.' In the same way, no matter what Gotama the contemplative says, Mallika endorses it: 'If that was said by the Blessed One, great king, then that's the way it is.' Go away, Mallika! Out of my sight!\"", "entities": [[16, 22, "PERSON"], [93, 104, "PERSON"], [296, 302, "PERSON"], [373, 384, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.087.than.html", "title": "Piyajatika Sutta", "para_seq": null}}
{"text": "\"Yes, lord,\" Ven. Sona answered the Blessed One. Then, having given this exhortation to Ven. Sona, the Blessed One — as a strong man might stretch out his bent arm or bend his outstretched arm — disappeared from the Cool Wood and appeared on Vulture Peak Mountain.", "entities": [[36, 47, "PERSON"], [103, 114, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an06.055.than.html", "title": "Sona Sutta", "para_seq": null}}
{"text": "[Ven. Sariputta:] \"Then, householder, you should train yourself in this way: 'I won't cling to the eye; my consciousness will not be dependent on the eye.' That's how you should train yourself. 'I won't cling to the ear... nose... tongue... body; my consciousness will not be dependent on the body.' ... 'I won't cling to the intellect; my consciousness will not be dependent on the intellect.' That's how you should train yourself.", "entities": [[1, 15, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.143.than.html", "title": "Anathapindikovada Sutta", "para_seq": null}}
{"text": "Then Ven. Ananda approached the nun and, on arrival, sat down on a prepared seat. As he was sitting there, he said to the nun: \"This body, sister, comes into being through food. And yet it is by relying on food that food is to be abandoned.", "entities": [[10, 16, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an04.159.than.html", "title": "Bhikkhuni Sutta", "para_seq": null}}
{"text": "\"Furthermore, the disciple of the noble ones is endowed with verified confidence in the Dhamma: 'The Dhamma is well-expounded by the Blessed One, to be seen here & now, timeless, inviting verification, pertinent, to be realized by the wise for themselves.' This is the second bonanza of merit, bonanza of skillfulness, nourishment of bliss.", "entities": [[133, 144, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn55.033.than.html", "title": "Abhisanda Sutta", "para_seq": null}}
{"text": "\"No, lord. King Seniya Bimbisara of Magadha hasn't provoked me, nor have the Licchavis of Vesali, nor has some other hostile king. There is a bandit in my realm, lord, named Angulimala: brutal, bloody-handed, devoted to killing & slaying, showing no mercy to living beings. He has turned villages into non-villages, towns into non-towns, settled countryside into unsettled countryside. Having repeatedly killed human beings, he wears a garland made of fingers. I am going to stamp him out.\" [1]", "entities": [[11, 32, "PERSON"], [36, 43, "GPE"], [77, 86, "NORP"], [90, 96, "GPE"]], "meta": {"nikaya": "MN", "identifier": "mn.086.than.html", "title": "Angulimala Sutta", "para_seq": null}}
{"text": "Then the brahman Nalijangha, delighting in & approving of the Blessed One's words, got up from his seat and went to Queen Mallika. On arrival, he told her all that had been said in his conversation with the Blessed One.", "entities": [[62, 73, "PERSON"], [116, 129, "PERSON"], [207, 218, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.087.than.html", "title": "Piyajatika Sutta", "para_seq": null}}
{"text": "Then a certain monk went to the Blessed One and, on arrival, having bowed down to him, sat to one side. As he was sitting there he said to the Blessed One: \" Just now, lord, while I was alone in seclusion, this train of thought arose in my awareness: 'Three feelings have been spoken of by the Blessed One: a feeling of pleasure, a feeling of pain, [1] & a feeling of neither pleasure nor pain. These are the three feelings spoken of by the Blessed One. But the Blessed One has said: \"Whatever is felt comes under stress.\" Now in what connection was this stated by the Blessed One: \"Whatever is felt comes under stress?\"'\"", "entities": [[32, 43, "PERSON"], [143, 154, "PERSON"], [294, 305, "PERSON"], [441, 452, "PERSON"], [462, 473, "PERSON"], [569, 580, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn36.011.than.html", "title": "Rahogata Sutta", "para_seq": null}}
{"text": "\"Being sustained, Ananda, he is sustained by the supreme sustenance; for this — the dimension of neither perception nor non-perception — is the supreme sustenance. There is [however] the case where a monk, having practiced in this way — 'It should not be, it should not occur to me; it will not be, it will not occur to me. What is, what has come to be, that I abandon' — obtains equanimity. He does not relish that equanimity, does not welcome it, does not remain fastened to it. As he does not relish that equanimity, does not welcome it, does not remain fastened to it, his consciousness is not dependent on it, is not sustained by it (does not cling to it). Without clinging/sustenance, Ananda, a monk is totally unbound.\"", "entities": [[18, 24, "PERSON"], [691, 697, "PERSON"]], "meta": {"nikaya": "MN", "identifier": "mn.106.than.html", "title": "Aneñja-sappaya Sutta", "para_seq": null}}
{"text": "The Blessed One said: \"Now what, monks, is five-factored noble right concentration? There is the case where a monk — quite withdrawn from sensuality, withdrawn from unskillful qualities — enters and remains in the first jhana: rapture and pleasure born from withdrawal, accompanied by directed thought and evaluation. He permeates and pervades, suffuses and fills this very body with the rapture and pleasure born from withdrawal. There is nothing of his entire body unpervaded by rapture and pleasure born from withdrawal.", "entities": [[4, 15, "PERSON"]], "meta": {"nikaya": "AN", "identifier": "an05.028.than.html", "title": "Samadhanga Sutta", "para_seq": null}}
{"text": "At Savatthi . Then, early in the morning, Vajira the nun put on her robes and, taking her bowl & outer robe, went into Savatthi for alms. When she had gone for alms in Savatthi and had returned from her alms round, after her meal she went to the Grove of the Blind to spend the day. Having gone deep into the Grove of the Blind, she sat down at the foot of a tree for the day's abiding.", "entities": [[3, 11, "GPE"], [119, 127, "GPE"], [168, 176, "GPE"]], "meta": {"nikaya": "SN", "identifier": "sn05.010.than.html", "title": "Vajira Sutta", "para_seq": null}}
{"text": "\"And what, Ananda, is another pleasure more extreme & refined than that? There is the case where a monk, with the abandoning of pleasure & stress — as with the earlier disappearance of elation & distress — enters & remains in the fourth jhana: purity of equanimity & mindfulness, neither-pleasure-nor-pain. This is another pleasure more extreme & refined than that. Though some might say, 'That is the highest pleasure that beings experience,' I would not grant them that. Why is that? Because there is another pleasure, more extreme & refined than that.", "entities": [[11, 17, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn36.019.than.html", "title": "Pañcakanga Sutta", "para_seq": null}}
{"text": "I have heard that on one occasion the Blessed One was staying near Savatthi at Jeta's Grove, Anathapindika's monastery. Then the Blessed One, picking up a little bit of dust with the tip of his fingernail, said to the monks, \"What do you think, monks? Which is greater: the little bit of dust I have picked up with the tip of my fingernail, or the great earth?\"", "entities": [[38, 49, "PERSON"], [67, 75, "GPE"], [79, 91, "LOC"], [93, 106, "PERSON"], [129, 140, "PERSON"]], "meta": {"nikaya": "SN", "identifier": "sn13.001.than.html", "title": "Nakhasikha Sutta", "para_seq": null}}
